var subData = {
    'stations': {
        //注释线下面的都是那条线上的地铁站
        //被注释的地铁站都是重复的
        //赞一线
        '城北枢纽': {
            'location': [-177, 40, -887]
        },
        '赞服国际机场': {
            'location': [
                [-173, 57, -430],
                [-200, 57, -431]
            ]
        },
        //出生点的4个点
        '出生点': {
            'location': [
                [-173, 57, 204],
                [-200, 57, 203],
                [-186, 49, 190],
                [-187, 49, 217]
            ]
        },
        '漆黑之翼': {
            'location': [-120, 40, 837]
        },
        //赞二线
        '未名阁': {
            'location': [-788, 40, 412]
        },
        '中央枢纽': {
            'location': [859, 40, 435]
        },
        '狼窝': {
            'location': [525, 40, 19]
        },
        //K1线
        'applezhou家旧址': {
            'location': [329, 40, -1700]
        },
        //Noawas的家
        '雨的故事的家': {
            'location': [681, 40, -1300]
        },
        // xiximi的家
        '象头岛': {
            'location': [860, 20, 20]
        },
        //'中央枢纽' : { 'location' : [859,40,435]}, 
        'LSF的家': {
            'location': [859, 40, 1036]
        },
        '无人沙村': {
            'location': [859, 40, 1349]
        },
        '魔瓶的家': {
            'location': [859, 40, 1737]
        },
        '森林枢纽': {
            'location': [1080, 40, 1997]
        },
        '夏尔镇': {
            'location': [2282, 50, 1996]
        },
        //爱国线
        //'夏尔镇' : { 'location' : [2282,50,1996]}, 
        'ACE的家': {
            'location': [2280, 40, 2816]
        },
        '夏尔村民农场南': {
            'location': [2800, 40, 2816]
        },
        'slantyone的家': {
            'location': [3376, 40, 2816]
        },
        '晓枫故居': {
            'location': [3376, 40, 3962]
        },
        '苏瑕瑜的家': {
            'location': [3375, 40, 4180]
        },
        '错误岛': {
            'location': [3374, 40, 4600]
        },
        '寒月的家': {
            'location': [3374, 20, 5600]
        },
        //少女前线
        'applezhou的家': {
        	'location': [2900, 40, 2599]
        },
        //'夏尔村民农场南' : { 'location' : [2880,40,2816]}, 
        '格里芬': {
            'location': [2800, 40, 3166]
        },
        //K2线
        'flam的家': {
            'location': [1549, 40, -900]
        },
        'xiximi的家': {
            'location': [691, 40, -890]
        },
        'KK的沙漠别墅': {
            'location': [206, 40, -751]
        },
        //'城北枢纽' : { 'location' : [-177,40,-887]}, 
        '彩虹半岛': {
            'location': [-410, 40, -889]
        },
        '彩虹镇洲际酒店': {
            'location': [-651, 40, -1018]
        },
        '彩虹镇': {
            'location': [-650, 40, -1177]
        },
        '三界枢纽': {
            'location': [-650, 40, -1985]
        },
        '妹控镇': {
            'location': [-385, 39, -2228]
        },
        'xiqiao的家': {
            'location': [-40, 40, -2229]
        },
        '寒月家旧址': {
            'location': [700, 40, -2229]
        },
        'ricky的家': {
            'location': [1550, 40, -2230]
        },
        //K3线
        '羊村': {
            'location': [943, 40, 834]
        },
        //'LSF的家' : { 'location' : [859,40,1036]}, 
        '土豆镇': {
            'location': [
                // 北站台，原土豆镇北
                [479, 40, 1160],
                // 南站台，原土豆镇西挪动
                [479, 40, 1350],
            ]
        },
        'Wintering_的家': {
            'location': [120, 40, 1174]
        },
        'FishWit的家': {
            'location': [-120, 40, 1175]
        },
        '尸冢': {
            'location': [-515, 40, 1174]
        },
        '白虎岭': {
            'location': [-671, 40, 1177]
        },
        '樱花乡': {
            'location': [-788, 40, 1175]
        },
        '樱花乡西': {
            'location': [-1030, 40, 1030]
        },
        //东方线
        //'中央枢纽' : { 'location' : [859,40,435]}, 
        '河神枢纽': {
            'location': [1305, 25, 436]
        },
        'miaomiao故居': {
            'location': [1919, 40, 160]
        },
        'lost的家': {
            'location': [1918, 40, -240]
        },
        'Byepast家旧址': {
            'location': [1920, 40, -375]
        },
        '福原枢纽': {
            'location': [1919, 40, -679]
        },
        'KK的安置房': {
            'location': [2050, 40, -681]
        },
        '猫音小村': {
            'location': [2350, 40, -681]
        },
        '艾德拉斯军事基地': {
            'location': [2351, 40, -1202]
        },
        '风车镇': {
            'location': [2322, 40, -1337]
        },
        //鱼塔线
        //'河神枢纽' : { 'location' : [1305,25,436]}, 
        '多拉鱼塔': {
            'location': [1306, 25, 314]
        },
        //二狗线
        //'miaomiao故居' : { 'location' : [1919,40,160]}, 
        '狗哥的家': {
            'location': [2315, 40, 140]
        },
        //K4线北段
        //'未名阁' : { 'location' : [-788,40,412]}, 
        '高地枢纽': {
            'location': [-1130, 40, 412]
        },
        '艾拉的家': {
            'location': [-1350, 40, 412]
        },
        '稻之乡南': {
            'location': [-2301, 40, 405]
        },
        //K4线南段
        //'漆黑之翼' : { 'location' : [-120,40,837]}, 
        //'FishWit的家' : { 'location' : [-120,40,1175]}, 
        'Xiao_Yun的家': {
            'location': [1, 40, 1349]
        },
        '终南山': {
            'location': [0, 40, 1737]
        },
        'KINDEL的家': {
            'location': [-92, 40, 2570]
        },
        '雪亭': {
            'location': [-92, 40, 3020]
        },
        'ij枢纽': {
            'location': [-11, 20, 3878]
        },
        'XS枢纽': {
            'location': [-10, 20, 4500]
        },
        '猫耳的家': {
            'location': [267, 40, 5301]
        },
        //K5线
        //'未名阁' : { 'location' : [-788,40,412]}, 
        '七魂家旧址': {
            'location': [-788, 40, 890]
        },
        '盘丝洞': {
            'location': [-785, 40, 1089]
        },
        //'樱花乡' : { 'location' : [-788,40,1175]}, 
        '风之镇': {
            'location': [-788, 40, 1737]
        },
        'lsy的家': {
            'location': [-862, 60, 1726]
        },
        '风之镇西': {
        	'location': [-1256, 56, 1863]
        },
        '沙漠枢纽': {
            'location': [-1245, 74, 2792]
        },
        'tz的家': {
            'location': [-236, 40, 2791]
        },
        '咸鱼': {
            'location': [-38, 40, 2886]
        },
        '双子阁': {
            'location': [106, 40, 3203]
        },
        //发如雪线
        //'风之镇' : { 'location' : [-788,40,1737]}, 
        //'终南山' : { 'location' : [0,40,1737]}, 
        //'魔瓶的家' : { 'location' : [859,40,1737]}, 
        //新风线
        //'沙漠枢纽' : { 'location' : [-1245,74,2792]}, 
        '糖湖镇': {
            'location': [-1258, 69, 3354]
        },
        //参宿线
        //'稻之乡南' : { 'location' : [-2301,40,405]}, 
        //'tz的家' : { 'location' : [-236,40,2791]}, 
        //'雪亭' : { 'location' : [-92,40,3020]}, 
        //'双子阁' : { 'location' : [106,40,3203]}, 
        //'ij枢纽' : { 'location' : [-11,20,3878]}, 
        //K6线
        //'樱花乡西' : { 'location' : [-1030,40,1030]}, 
        'ranfei的家': {
            'location': [-1129, 40, 585]
        },
        //'高地枢纽' : { 'location' : [-1130,40,412]}, 
        '老郭故居': {
            'location': [-1130, 40, -220]
        },
        '大裤衩': {
            'location': [-1130, 40, -400]
        },
        '肥宅乐园': {
            'location': [-1129, 40, -817]
        },
        'ZERO的家': {
            'location': [-1046, 40, -1177]
        },
        'Meowth的家': {
            'location': [-1045, 40, -1985]
        },
        //'三界枢纽' : { 'location' : [-650,40,-1985]}, 
        '妹控镇南': {
            'location': [-384, 39, -1985]
        },
        //'妹控镇' : { 'location' : [-385,39,-2228]}, 
        '螃蟹岛灯塔': {
            'location': [-253, 20, -2730]
        },
        '春暖花开': {
            'location': [-385, 20, -2841]
        },
        '卫岛': {
            'location': [-578, 20, -3121]
        },
        //雪国线
        //'春暖花开' : { 'location' : [-385,20,-2841]}, 
        '寒意镇': {
            'location': [-1045, 40, -2840]
        },
        '黄老菊的家': {
            'location': [-1840, 40, -2840]
        },
        '七魂的家': {
            'location': [-2810, 40, -2839]
        },
        //德意志线
        //'黄老菊的家' : { 'location' : [-1840,40,-2840]}, 
        '楚格峰': {
        	'location': [-1839, 40, -4501]
        },
        '柯尼斯堡': {
            'location': [-1841, 40, -4827]
        },
        //奥兹线
        //'寒意镇' : { 'location' : [-1045,40,-2840]}, 
        //'Meowth的家' : { 'location' : [-1045,40,-1985]}, 
        //K7线
        //'漆黑之翼' : { 'location' : [-120,40,837]}, 
        '天守阁': {
            'location': [-560, 40, 890]
        },
        //'七魂家旧址' : { 'location' : [-788,40,890]}, 
        //'樱花乡西' : { 'location' : [-1030,40,1030]}, 
        //K8线
        //'ZERO的家' : { 'location' : [-1046,40,-1177]}, 
        //'彩虹镇' : { 'location' : [-650,40,-1177]}, 
        '_qUUp_的家': {
            'location': [-35, 40, -1178]
        },
        'Noawas的家': {
            'location': [
                [330, 40, -1178],

                // 北站台，对接applezhou家和雨的故事的家
                [330, 40, -1301]
            ]
        },
        '方台': {
            'location': [810, 40, -1090]
        },
        'x_xGe海灯塔': {
            'location': [1549, 40, -1090]
        },
        //M1线
        //'福原枢纽' : { 'location' : [1919,40,-679]}, 
        '赞服苏维埃根据地': {
            'location': [1170, 40, -679]
        },
        //'flam的家' : { 'location' : [1549,40,-900]}, 
        //'x_xGe海灯塔' : { 'location' : [1549,40,-1090]}, 
        '末影镇': {
            'location': [1549, 40, -1610]
        },
        //'ricky的家' : { 'location' : [1550,40,-2230]}, 
        '红牛岛': {
            'location': [2000, 40, -3071]
        },
        'SCP驻赞服办事处': {
            'location': [3454, 47, -3650]
        },
        //K9线
        //'森林枢纽' : { 'location' : [1080,40,1997]}, 
        '富饶港': {
            'location': [1074, 40, 2700]
        },
        '沙河枢纽': {
            'location': [1080, 40, 3202]
        },
        '咸鱼东': {
            'location': [400, 40, 3203]
        },
        //'双子阁' : { 'location' : [106,40,3203]}, 
        //伊苏线
        //'沙河枢纽' : { 'location' : [1080,40,3202]}, 
        '泽民': {
            'location': [1205, 40, 3410]
        },
        '骨乐园': {
            'location': [1205, 40, 3690]
        },
        '寺院化石博物馆': {
            'location': [1206, 40, 4190]
        },
        '上海老江': {
            'location': [1207, 40, 4489]
        },
        //K10线
        //'老郭故居' : { 'location' : [-1130,40,-220]}, 
        '秋山的家': {
            'location': [-1950, 40, -221]
        },
        '光明镇': {
            'location': [-2150, 40, -130]
        },
        '稻之乡': {
            'location': [-2299, 40, 160]
        },
        //'稻之乡南' : { 'location' : [-2301,40,405]}, 
        '浮离': {
            'location': [-3100, 40, 499]
        },
        '蜀汉国界': {
        	'location': [-3901, 40, 1350]
        },
        //K11线
        //'七魂的家' : { 'location' : [-2810,40,-2839]}, 
        '作案哥的家': {
            'location': [-2809, 40, -1985]
        },
        //K12线
        //'作案哥的家' : { 'location' : [-2809,40,-1985]}, 
        //'Meowth的家' : { 'location' : [-1045,40,-1985]}, 
        //K13线
        //'Xiao_Yun的家' : { 'location' : [1,40,1349]}, 
        '荔宫': {
            'location': [160, 40, 1350]
        },
        /*        '土豆镇': {
                    'location': [
                        // 北站台，原土豆镇北
                        [479, 40, 1160],
                        // 南站台，原土豆镇西挪动
                        [479, 40, 1350],
                    ]
                },*/
        //'无人沙村' : { 'location' : [859,40,1349]}, 
        //K14线
        //'艾拉的家' : { 'location' : [-1350,40,412]}, 
        'gaffey的家': {
            'location': [-1349, 40, 120]
        },
        '海中粟': {
        	'location': [-1871, 20, 128]
        },
        //'稻之乡': {
        //    'location': [-2299, 40, 160]
        //},
        //K15线
        //'咸鱼东' : { 'location' : [400,40,3203]}, 
        '96Ko的家': {
            'location': [399, 40, 3340]
        },
        '提尼岛北': {
            'location': [401, 20, 4000]
        },
        '提尼岛工业园': {
            'location': [400, 20, 4499]
        },
        //'XS枢纽' : { 'location' : [-10,20,4500]},
        '共产主义大陆': {
            'location': [-945, 40, 4329]
        },
        '瑜陵': {
            'location': [
                [-1257, 20, 4329],
                [-1257, 72, 4329]
            ]
        },
        //'糖湖镇': {
        //    'location': [-1258, 69, 3354]
        //},
        //比利线
        '多拉的家': {
            'location': [654, 71, -2149]
        },
        '北方村庄': {
            'location': [556, 66, -1733]
        },
        //风光线
        //'风之镇': {
        //    'location': [-788, 40, 1737]
        //},
        '羊驼小屋': {
        	'location': [-849, 93, 1866]
        },
        '风之国塔': {
        	'location': [-1104, 96,1860]
        },
        //'风之镇西': {
        //	'location': [-1256, 56, 1863]
        //},
        //血汗线
        '楚格峰': {
        	'location': [-1839, 40, -4501]
        },
        '新手村': {
        	'location': [-3954, 40, -4501]
        },
        //X专线
        '狼窝': {
            'location': [525, 40, 19]
        },
        '象头岛': {
            'location': [860, 20, 20]
        },
        //吕梨线
        '共产主义大陆': {
            'location': [-945, 40, 4329]
        },
        //'瑜陵': {
        //    'location': [
        //        [-1257, 20, 4329],
        //        [-1257, 72, 4329]
        //    ]
        //},
    },
    'lines': {
        '赞一线': ['城北枢纽', '赞服国际机场', '出生点', '漆黑之翼'],
        '赞二线': ['未名阁', '出生点', '中央枢纽'],
        'K1线': ['applezhou家旧址', 'Noawas的家', '雨的故事的家', 'xiximi的家', '象头岛', '中央枢纽', 'LSF的家', '无人沙村', '魔瓶的家', '森林枢纽', '夏尔镇'],
        'K2线': ['flam的家', 'xiximi的家', 'KK的沙漠别墅', '城北枢纽', '彩虹半岛', '彩虹镇洲际酒店', '彩虹镇', '三界枢纽', '妹控镇', 'xiqiao的家', '寒月家旧址', 'ricky的家'],
        'K3线': ['羊村', 'LSF的家', '土豆镇', 'Wintering_的家', 'FishWit的家', '尸冢', '白虎岭', '樱花乡', '樱花乡西'],
        'K4线北段': ['未名阁', '高地枢纽', '艾拉的家', '稻之乡南'],
        'K4线南段': ['漆黑之翼', 'FishWit的家', 'Xiao_Yun的家', '终南山', 'KINDEL的家', '雪亭', 'ij枢纽', 'XS枢纽', '猫耳的家'],
        'K5线': ['未名阁', '七魂家旧址', '盘丝洞', '樱花乡', '风之镇', 'lsy的家', '风之镇西', '沙漠枢纽', 'tz的家', '咸鱼', '双子阁'],
        'K6线': ['樱花乡西', 'ranfei的家', '高地枢纽', '老郭故居', '大裤衩', '肥宅乐园', 'ZERO的家', 'Meowth的家', '三界枢纽', '妹控镇南', '妹控镇', '螃蟹岛灯塔', '春暖花开', '卫岛'],
        'K7线': ['漆黑之翼', '天守阁', '七魂家旧址', '樱花乡西'],
        'K8线': ['ZERO的家', '彩虹镇', '_qUUp_的家', 'Noawas的家', '方台', 'x_xGe海灯塔'],
        'K9线': ['森林枢纽', '富饶港', '沙河枢纽', '咸鱼东', '双子阁'],
        'K10线': ['老郭故居', '秋山的家', '光明镇', '稻之乡', '稻之乡南', '浮离', '蜀汉国界'],
        'K11线': ['七魂的家', '作案哥的家'],
        'K12线': ['作案哥的家', 'Meowth的家'],
        'K13线': ['Xiao_Yun的家', '荔宫', '土豆镇', '无人沙村'],
        'K14线': ['艾拉的家', 'gaffey的家','海中粟', '稻之乡'],
        'K15线': ['咸鱼东', '96Ko的家', '提尼岛北', '提尼岛工业园', 'XS枢纽', '共产主义大陆', '瑜陵', '糖湖镇'],
        'M1线': ['福原枢纽', '赞服苏维埃根据地', 'flam的家', 'x_xGe海灯塔', '末影镇', 'ricky的家', '红牛岛', 'SCP驻赞服办事处'],
        '爱国线': ['夏尔镇', 'ACE的家', '夏尔村民农场南', 'slantyone的家', '晓枫故居', '苏瑕瑜的家', '错误岛', '寒月的家'],
        '少女前线': ['applezhou的家', '夏尔村民农场南', '格里芬'],
        '东方线': ['中央枢纽', '河神枢纽', 'miaomiao故居', 'lost的家', 'Byepast家旧址', '福原枢纽', 'KK的安置房', '猫音小村', '艾德拉斯军事基地', '风车镇'],
        '二狗线': ['miaomiao故居', '狗哥的家'],
        '发如雪线': ['风之镇', '终南山', '魔瓶的家'],
        '参宿线': ['KINDEL的家', 'tz的家', '雪亭', '双子阁', 'ij枢纽'],
        '雪国线': ['春暖花开', '寒意镇', '黄老菊的家', '七魂的家'],
        '德意志线': ['黄老菊的家', '楚格峰', '柯尼斯堡'],
        '奥兹线': ['寒意镇', 'Meowth的家'],
        '新风线': ['沙漠枢纽', '糖湖镇'],
        '鱼塔线': ['河神枢纽', '多拉鱼塔'],
        '伊苏线': ['沙河枢纽', '泽民', '骨乐园', '寺院化石博物馆', '上海老江'],
        'X专线': ['狼窝', '象头岛'],
        '比利线': ['多拉的家', '北方村庄'],
        '风光线': ['风之镇', '羊驼小屋', '风之国塔', '风之镇西'],
        '血汗线': ['楚格峰', '新手村'],
        '吕梨线': ['共产主义大陆', '瑜陵']
    },
    'paths': [
        // 赞一线
        ['城北枢纽', '赞服国际机场', 479, [0,1]],
        ['赞服国际机场', '城北枢纽', 461, [0,0]],

        ['赞服国际机场', '出生点', 634, [1,1]],
        ['出生点', '赞服国际机场', 634, [0,0]],

        ['出生点', '漆黑之翼', 714, [1,0]],
        ['漆黑之翼', '出生点', 686, [0,0]],

        // 赞二线
        ['未名阁', '出生点', 796, [0, 3]],
        ['出生点', '未名阁', 824, [2, 0]],

        ['出生点', '中央枢纽', 1264, [3,0]],
        ['中央枢纽', '出生点', 1290, [0,2]],

        // K1线
        ['applezhou家旧址', 'Noawas的家', 400, [0, 1]],
        ['Noawas的家', 'applezhou家旧址', 523, [0, 0]], //这里距离按照南站台出发算

        ['Noawas的家', '雨的故事的家', 473],
        ['雨的故事的家', 'Noawas的家', 352, [0, 1]],//这里距离按照南站台出发算

        ['雨的故事的家', 'xiximi的家', 420],
        ['xiximi的家', '雨的故事的家', 420],

        ['xiximi的家', '象头岛', 1079],
        ['象头岛', 'xiximi的家', 1079],

        ['象头岛', '中央枢纽', 416],
        ['中央枢纽', '象头岛', 416],

        ['中央枢纽', 'LSF的家', 601],
        ['LSF的家', '中央枢纽', 601],

        ['LSF的家', '无人沙村', 313],
        ['无人沙村', 'LSF的家', 313],

        ['无人沙村', '魔瓶的家', 388],
        ['魔瓶的家', '无人沙村', 388],

        ['魔瓶的家', '森林枢纽', 481],
        ['森林枢纽', '魔瓶的家', 481],

        ['森林枢纽', '夏尔镇', 1203],
        ['夏尔镇', '森林枢纽', 1203],

        // K2线
        ['flam的家', 'xiximi的家', 868],
        ['xiximi的家', 'flam的家', 868],

        ['xiximi的家', 'KK的沙漠别墅', 624],
        ['KK的沙漠别墅', 'xiximi的家', 624],

        ['KK的沙漠别墅', '城北枢纽', 519],
        ['城北枢纽', 'KK的沙漠别墅', 519],

        ['城北枢纽', '彩虹半岛', 235],
        ['彩虹半岛', '城北枢纽', 235],

        ['彩虹半岛', '彩虹镇', 528],
        ['彩虹镇', '彩虹半岛', 528],

        // ---- 彩虹镇洲际酒店支线
        ['彩虹镇', '彩虹镇洲际酒店', 160],
        ['彩虹镇洲际酒店', '彩虹镇', 160],
        ['彩虹镇洲际酒店', '彩虹半岛', 370],
        // ---- 彩虹镇洲际酒店支线

        ['彩虹镇', '三界枢纽', 808],
        ['三界枢纽', '彩虹镇', 808],

        ['三界枢纽', '妹控镇', 508],
        ['妹控镇', '三界枢纽', 508],

        ['妹控镇', 'xiqiao的家', 346],
        ['xiqiao的家', '妹控镇', 346],

        ['xiqiao的家', '寒月家旧址', 740],
        ['寒月家旧址', 'xiqiao的家', 740],

        ['寒月家旧址', 'ricky的家', 851],
        ['ricky的家', '寒月家旧址', 851],

        // K3线
        ['羊村', 'LSF的家', 286],
        ['LSF的家', '羊村', 286],

        ['LSF的家', '土豆镇', 504, [0, 0]],
        ['土豆镇', 'LSF的家', 694, [1, 0]], //按照远的算

        ['土豆镇', 'Wintering_的家', 535, [1,0]],//按照远的算
        ['Wintering_的家', '土豆镇', 373, [0,0]],

        ['Wintering_的家', 'FishWit的家', 241],
        ['FishWit的家', 'Wintering_的家', 241],

        ['FishWit的家', '尸冢', 396],
        ['尸冢', 'FishWit的家', 396],

        ['尸冢', '樱花乡', 274],
        ['樱花乡', '尸冢', 274],

        // ---- 白虎岭支线
        ['白虎岭', '尸冢', 159],
        ['白虎岭', '樱花乡', 119],
        ['樱花乡', '白虎岭', 119],
        // ---- 白虎岭支线

        ['樱花乡', '樱花乡西', 387],
        ['樱花乡西', '樱花乡', 387],

        // K4线北段
        ['未名阁', '高地枢纽', 342],
        ['高地枢纽', '未名阁', 342],

        ['高地枢纽', '艾拉的家', 220],
        ['艾拉的家', '高地枢纽', 220],

        ['艾拉的家', '稻之乡南', 958],
        ['稻之乡南', '艾拉的家', 958],

        // K4线南段
        ['漆黑之翼', 'FishWit的家', 338],
        ['FishWit的家', '漆黑之翼', 338],

        ['FishWit的家', 'Xiao_Yun的家', 295],
        ['Xiao_Yun的家', 'FishWit的家', 295],

        ['Xiao_Yun的家', '终南山', 389],
        ['终南山', 'Xiao_Yun的家', 389],

        ['终南山', 'KINDEL的家', 925],
        ['KINDEL的家', '终南山', 925],

        ['KINDEL的家', '雪亭', 450],
        ['雪亭', 'KINDEL的家', 450],

        ['雪亭', 'ij枢纽', 939],
        ['ij枢纽', '雪亭', 939],

        ['ij枢纽', 'XS枢纽', 623],
        ['XS枢纽', 'ij枢纽', 623],

        ['XS枢纽', '猫耳的家', 1078],
        ['猫耳的家', 'XS枢纽', 1078],

        // K5线
        ['未名阁', '七魂家旧址', 478],
        ['七魂家旧址', '未名阁', 478],

        ['七魂家旧址', '樱花乡', 285],
        ['樱花乡', '七魂家旧址', 285],

        // ---- 盘丝洞支线
        ['盘丝洞', '樱花乡', 89],
        ['樱花乡', '盘丝洞', 89],
        ['盘丝洞', '七魂家旧址', 202],
        // ---- 盘丝洞支线

        ['樱花乡', '风之镇', 562],
        ['风之镇', '樱花乡', 562],

        // ----lsy的家支线
        ['风之镇', 'lsy的家', 85],
        ['lsy的家', '风之镇', 85],
        // ----lsy的家支线

        ['风之镇', '风之镇西', 594],
        ['风之镇西', '风之镇', 594],

        ['风之镇西', '沙漠枢纽', 940],
        ['沙漠枢纽', '风之镇西', 940],

        ['沙漠枢纽', 'tz的家', 1010],
        ['tz的家', '沙漠枢纽', 1010],

        ['tz的家', '咸鱼', 293],
        ['咸鱼', 'tz的家', 293],

        ['双子阁', '咸鱼', 461],
        ['咸鱼', '双子阁', 461],

        // K6线
        ['樱花乡西', 'ranfei的家', 544],
        ['ranfei的家', '樱花乡西', 544],

        ['ranfei的家', '高地枢纽', 174],
        ['高地枢纽', 'ranfei的家', 174],

        ['高地枢纽', '老郭故居', 632],
        ['老郭故居', '高地枢纽', 632],

        ['老郭故居', '大裤衩', 180],
        ['大裤衩', '老郭故居', 180],

        ['大裤衩', '肥宅乐园', 418],
        ['肥宅乐园', '大裤衩', 418],

        ['肥宅乐园', 'ZERO的家', 443],
        ['ZERO的家', '肥宅乐园', 443],

        ['ZERO的家', 'Meowth的家', 809],
        ['Meowth的家', 'ZERO的家', 809],

        ['Meowth的家', '三界枢纽', 395],
        ['三界枢纽', 'Meowth的家', 395],

        ['三界枢纽', '妹控镇南', 266],
        ['妹控镇南', '三界枢纽', 266],

        ['妹控镇南', '妹控镇', 244],
        ['妹控镇', '妹控镇南', 244],

        // ---- 螃蟹岛灯塔支线
        ['妹控镇', '螃蟹岛灯塔', 634],
        ['螃蟹岛灯塔', '妹控镇', 634],
        ['螃蟹岛灯塔', '春暖花开', 243],
        ['春暖花开', '螃蟹岛灯塔', 243],

        // ---- 螃蟹岛灯塔支线

        ['妹控镇', '春暖花开', 613],
        ['春暖花开', '妹控镇', 613],

        ['春暖花开', '卫岛', 473],
        ['卫岛', '春暖花开', 473],

        // K7线
        ['漆黑之翼', '天守阁', 493],
        ['天守阁', '漆黑之翼', 493],

        ['天守阁', '七魂家旧址', 228],
        ['七魂家旧址', '天守阁', 228],

        ['七魂家旧址', '樱花乡西', 382],
        ['樱花乡西', '七魂家旧址', 382],

        // K8线
        ['ZERO的家', '彩虹镇', 396],
        ['彩虹镇', 'ZERO的家', 396],

        ['彩虹镇', '_qUUp_的家', 616],
        ['_qUUp_的家', '彩虹镇', 616],

        ['_qUUp_的家', 'Noawas的家', 365],
        ['Noawas的家', '_qUUp_的家', 365],

        ['Noawas的家', '方台', 568],
        ['方台', 'Noawas的家', 568],

        ['方台', 'x_xGe海灯塔', 739],
        ['x_xGe海灯塔', '方台', 739],

        // K9线
        ['森林枢纽', '富饶港', 709],
        ['富饶港', '森林枢纽', 709],

        ['富饶港', '沙河枢纽', 508],
        ['沙河枢纽', '富饶港', 508],

        ['沙河枢纽', '咸鱼东', 681],
        ['咸鱼东', '沙河枢纽', 681],

        ['咸鱼东', '双子阁', 294],
        ['双子阁', '咸鱼东', 294],

        // K10线
        ['老郭故居', '秋山的家', 821],
        ['秋山的家', '老郭故居', 821],

        ['秋山的家', '光明镇', 291],
        ['光明镇', '秋山的家', 291],

        ['光明镇', '稻之乡', 439],
        ['稻之乡', '光明镇', 439],

        ['稻之乡', '稻之乡南', 247],
        ['稻之乡南', '稻之乡', 247],

        ['稻之乡南', '浮离', 893],
        ['浮离', '稻之乡南', 893],

        ['浮离', '蜀汉国界', 1652],
        ['蜀汉国界', '浮离', 1652],

        // K11线
        ['七魂的家', '作案哥的家', 855],
        ['作案哥的家', '七魂的家', 855],

        // K12线
        ['作案哥的家', 'Meowth的家', 1764],
        ['Meowth的家', '作案哥的家', 1764],

        // K13线
        ['Xiao_Yun的家', '荔宫', 160],
        ['荔宫', 'Xiao_Yun的家', 160],

        ['荔宫', '土豆镇', 319, [0, 1]],
        ['土豆镇', '荔宫', 509, [0, 0]],//按照远的算

        ['土豆镇', '无人沙村', 569, [0, 0]],//按照远的算
        ['无人沙村', '土豆镇', 381, [0, 1]],

        // K14线
        ['艾拉的家', 'gaffey的家', 293],
        ['gaffey的家', '艾拉的家', 293],

        ['gaffey的家', '海中粟', 530],
        ['海中粟', 'gaffey的家', 530],

        ['海中粟', '稻之乡', 460],
        ['稻之乡', '海中粟', 460],

        // K15线
        ['咸鱼东', '96Ko的家', 138],
        ['96Ko的家', '咸鱼东', 138],

        ['96Ko的家', '提尼岛北', 662],
        ['提尼岛北', '96Ko的家', 662],

        ['提尼岛北', '提尼岛工业园', 500],
        ['提尼岛工业园', '提尼岛北', 500],

        ['提尼岛工业园', 'XS枢纽', 411],
        ['XS枢纽', '提尼岛工业园', 411],

        ['XS枢纽', '共产主义大陆', 1106],
        ['共产主义大陆', 'XS枢纽', 1106],

        ['共产主义大陆', '瑜陵', 312],
        ['瑜陵', '共产主义大陆', 312],

        ['瑜陵', '糖湖镇', 976],
        ['糖湖镇', '瑜陵', 976],

        // M1线
        ['福原枢纽', '赞服苏维埃根据地', 749],
        ['赞服苏维埃根据地', '福原枢纽', 749],

        ['赞服苏维埃根据地', 'flam的家', 600],
        ['flam的家', '赞服苏维埃根据地', 600],

        ['flam的家', 'x_xGe海灯塔', 190],
        ['x_xGe海灯塔', 'flam的家', 190],

        ['x_xGe海灯塔', '末影镇', 520],
        ['末影镇', 'x_xGe海灯塔', 520],

        ['末影镇', 'ricky的家', 621],
        ['ricky的家', '末影镇', 621],

        ['ricky的家', '红牛岛', 1291],
        ['红牛岛', 'ricky的家', 1291],

        ['红牛岛', 'SCP驻赞服办事处', 2033],
        ['SCP驻赞服办事处', '红牛岛', 2033],

        // 爱国线
        ['夏尔镇', 'ACE的家', 822],
        ['ACE的家', '夏尔镇', 822],

        ['ACE的家', '夏尔村民农场南', 520],
        ['夏尔村民农场南', 'ACE的家', 520],

        ['夏尔村民农场南', 'slantyone的家', 576],
        ['slantyone的家', '夏尔村民农场南', 576],

        ['slantyone的家', '晓枫故居', 1146],
        ['晓枫故居', 'slantyone的家', 1146],

        ['晓枫故居', '苏瑕瑜的家', 219],
        ['苏瑕瑜的家', '晓枫故居', 219],

        ['苏瑕瑜的家', '错误岛', 421],
        ['错误岛', '苏瑕瑜的家', 421],

        ['错误岛', '寒月的家', 1000],
        ['寒月的家', '错误岛', 1000],

        // 少女前线
        ['applezhou的家', '夏尔村民农场南', 317],
        ['夏尔村民农场南', 'applezhou的家', 317],

        ['夏尔村民农场南', '格里芬', 350],
        ['格里芬', '夏尔村民农场南', 350],

        // 东方线
        ['中央枢纽', '河神枢纽', 447],
        ['河神枢纽', '中央枢纽', 447],

        ['河神枢纽', 'miaomiao故居', 890],
        ['miaomiao故居', '河神枢纽', 890],

        ['miaomiao故居', 'lost的家', 401],
        ['lost的家', 'miaomiao故居', 401],

        ['lost的家', 'Byepast家旧址', 137],
        ['Byepast家旧址', 'lost的家', 137],

        ['Byepast家旧址', '福原枢纽', 305],
        ['福原枢纽', 'Byepast家旧址', 305],

        ['福原枢纽', 'KK的安置房', 133],
        ['KK的安置房', '福原枢纽', 133],

        ['KK的安置房', '猫音小村', 300],
        ['猫音小村', 'KK的安置房', 300],

        ['猫音小村', '艾德拉斯军事基地', 522],
        ['艾德拉斯军事基地', '猫音小村', 522],

        ['艾德拉斯军事基地', '风车镇', 164],
        ['风车镇', '艾德拉斯军事基地', 164],

        // 二狗线
        ['miaomiao故居', '狗哥的家', 416],
        ['狗哥的家', 'miaomiao故居', 416],

        // 发如雪线
        ['风之镇', '终南山', 788],
        ['终南山', '风之镇', 788],

        ['终南山', '魔瓶的家', 859],
        ['魔瓶的家', '终南山', 859],

        // 参宿线
        ['KINDEL的家', 'tz的家', 365],
        ['tz的家', 'KINDEL的家', 365],

        ['tz的家', '雪亭', 373],
        ['雪亭', 'tz的家', 373],

        ['雪亭', '双子阁', 381],
        ['双子阁', '雪亭', 381],

        ['双子阁', 'ij枢纽', 792],
        ['ij枢纽', '双子阁', 792],

        // 雪国线
        ['春暖花开', '寒意镇', 661],
        ['寒意镇', '春暖花开', 661],

        ['寒意镇', '黄老菊的家', 795],
        ['黄老菊的家', '寒意镇', 795],

        ['黄老菊的家', '七魂的家', 971],
        ['七魂的家', '黄老菊的家', 971],

        // 德意志线
        ['黄老菊的家', '楚格峰', 1662],
        ['楚格峰', '黄老菊的家', 1662],

        ['楚格峰', '柯尼斯堡', 328],
        ['柯尼斯堡', '楚格峰', 328],

        // 奥兹线
        ['寒意镇', 'Meowth的家', 855],
        ['Meowth的家', '寒意镇', 855],

        // 新风线
        ['沙漠枢纽', '糖湖镇', 575],
        ['糖湖镇', '沙漠枢纽', 575],

        // 鱼塔线
        ['河神枢纽', '多拉鱼塔', 123],
        ['多拉鱼塔', '河神枢纽', 123],

        // 伊苏线
        ['沙河枢纽', '泽民', 333],
        ['泽民', '沙河枢纽', 333],

        ['泽民', '骨乐园', 280],
        ['骨乐园', '泽民', 280],

        ['骨乐园', '寺院化石博物馆', 501],
        ['寺院化石博物馆', '骨乐园', 501],

        ['寺院化石博物馆', '上海老江', 300],
        ['上海老江', '寺院化石博物馆', 300],

        // X专线
        ['狼窝', '象头岛', 336],
        ['象头岛', '狼窝', 336],

        // 比利线
        ['多拉的家', '北方村庄', 1074],
        ['北方村庄', '多拉的家', 1074],

        // 文明线
        ['糖湖镇', '共产主义大陆', 1288],
        ['共产主义大陆', '糖湖镇', 1288],

        //风光线
        ['风之镇', '羊驼小屋', 190],
        ['羊驼小屋', '风之镇', 190],

        ['羊驼小屋', '风之国塔', 261],
        ['风之国塔', '羊驼小屋', 261],

        ['风之国塔', '风之镇西', 155],
        ['风之镇西', '风之国塔', 155],
      
        //血汗线
        ['楚格峰', '新手村', 2115],
        ['新手村', '楚格峰', 2115],

        //吕梨线
        ['共产主义大陆', '瑜陵', 312],
        ['瑜陵', '共产主义大陆', 312],
    ]
}
