var subData = {
	'lines': {
		'赞一线': ['城北枢纽', '赞服国际机场', '出生点', '漆黑之翼'],
		'赞二线': ['未名阁', '出生点', '中央枢纽'],
		'K1线': ['中央枢纽', 'LSF的家', '无人沙村', '魔瓶的家', '森林枢纽', '夏尔镇'],
		'爱国线': ['夏尔镇', 'ACE的家', '夏尔村民农场南', 'slantyone的家', '晓枫故居', '苏瑕瑜的家', '错误岛', '寒月的家']
	},
	'paths': [
		// 赞一线
		['城北枢纽', '赞服国际机场', 466],
		['赞服国际机场', '城北枢纽', 466],

		['赞服国际机场', '出生点', 204],
		['出生点', '赞服国际机场', 204],

		['出生点', '漆黑之翼', 700],
		['漆黑之翼', '出生点', 700],

		// 赞二线
		['未名阁', '出生点', 810],
		['出生点', '未名阁', 810],

		['出生点', '中央枢纽', 1277],
		['中央枢纽', '出生点', 1277],

		// K1线
		['中央枢纽', 'LSF的家', 601],
		['LSF的家', '中央枢纽', 601],

		['LSF的家', '无人沙村', 313],
		['无人沙村', 'LSF的家', 313],

		['无人沙村', '魔瓶的家', 388],
		['魔瓶的家', '无人沙村', 388],

		['魔瓶的家', '森林枢纽', 481],
		['森林枢纽', '魔瓶的家', 481],

		['森林枢纽', '夏尔镇', 1203],
		['夏尔镇', '森林枢纽', 1203],

		// 爱国线
		['夏尔镇', 'ACE的家', 822],
		['ACE的家', '夏尔镇', 822],

		['ACE的家', '夏尔村民农场南', 600],
		['夏尔村民农场南', 'ACE的家', 600],

		['夏尔村民农场南', 'slantyone的家', 496],
		['slantyone的家', '夏尔村民农场南', 496],

		['slantyone的家', '晓枫故居', 1146],
		['晓枫故居', 'slantyone的家', 1146],

		['晓枫故居', '苏瑕瑜的家', 219],
		['苏瑕瑜的家', '晓枫故居', 219],

		['苏瑕瑜的家', '错误岛', 421],
		['错误岛', '苏瑕瑜的家', 421],

		['错误岛', '寒月的家', 1000],
		['寒月的家', '错误岛', 1000]
	]
}