var subData = {
    'stations': {
        //注释线下面的都是那条线上的地铁站
        //被注释的地铁站都是重复的

        //赞一线
        '城北枢纽': {
            'location': [-177, 40, -887],
            'description': '连接赞一线和K2线的枢纽站。',
            'img': 'station_chengbeishuniu.jpg'
        },
        '赞服国际机场': {
            'location': [
                [-173, 57, -430],
                [-200, 57, -431]
            ]
        },
        //出生点的4个点
        '出生点': {
            'location': [
                [-173, 57, 204],
                [-200, 57, 203],
                [-186, 49, 190],
                [-187, 49, 217]
            ]
        },
        '漆黑之翼': {
            'location': [-120, 40, 837]
        },
        //赞二线
        '未名阁': {
            'location': [-788, 40, 412]
        },
        '中央枢纽': {
            'location': [859, 40, 435]
        },
        '狼窝': {
            'location': [525, 40, 19]
        },

        //K1线
        //'妹控镇南': {'location': [-384, 39, -1985]},
        'applezhou家旧址': {
            'location': [329, 40, -1700]
        },
        //星海湾
        '雨的故事的家': {
            'location': [681, 40, -1300]
        },
        // xiximi的家
        '象头岛': {
            'location': [860, 20, 20]
        },
        //'中央枢纽' : { 'location' : [859,40,435]}, 
        'LSF的家': {
            'location': [859, 40, 1036]
        },
        '无人沙村': {
            'location': [859, 40, 1349]
        },
        '魔瓶的家': {
            'location': [859, 40, 1737]
        },
        '森林枢纽': {
            'location': [1080, 40, 1997]
        },
        '夏尔镇': {
            'location': [2282, 50, 1996]
        },

        //爱国线
        //'夏尔镇' : { 'location' : [2282,50,1996]}, 
        'ACE的家': {
            'location': [2280, 40, 2816]
        },
        '夏尔村民农场南': {
            'location': [2800, 40, 2816]
        },
        'slantyone的家': {
            'location': [3376, 40, 2816]
        },
        '晓枫故居': {
            'location': [3376, 40, 3962]
        },
        '苏瑕瑜的家': {
            'location': [3375, 40, 4180]
        },
        '错误岛': {
            'location': [3374, 40, 4600]
        },
        '寒月的家': {
            'location': [3374, 20, 5600]
        },

        //少女前线
        'applezhou的家': {
            'location': [2900, 40, 2599]
        },
        //'夏尔村民农场南' : { 'location' : [2880,40,2816]}, 
        '格里芬': {
            'location': [2800, 40, 3166]
        },

        //K2线
        'flam的家': {
            'location': [1549, 40, -900]
        },
        'xiximi的家': {
            'location': [691, 40, -890],
            'description': 'xiximi建在云上高山的家。',
            'img': 'station_xiximidejia.jpg'
        },
        'KK的沙漠别墅': {
            'location': [206, 40, -751],
            'description': 'KK的第一个赞服建筑，地皮机场征用，被迫搬迁，现已荒废。',
            'img': 'station_kkdeshamobieshu.jpg'
        },
        //'城北枢纽' : { 'location' : [-177,40,-887]}, 
        '彩虹半岛': {
            'location': [-410, 40, -889],
            'description': '彩虹镇东南沿海的半岛。',
            'img': 'station_caihongbandao.jpg'
        },
        '彩虹镇洲际酒店': {
            'location': [-651, 40, -1018],
            'description': '又大又长的酒店，住在里面很舒适。',
            'img': 'station_caihongzhenzhoujijiudian.jpg'
        },
        '彩虹镇': {
            'location': [-650, 40, -1177]
        },
        '三界枢纽': {
            'location': [-650, 40, -1985]
        },
        '妹控镇': {
            'location': [-385, 39, -2228],
            'description': 'Shadow_Xi创建的小镇，有大鱼大船。',
            'img': 'station_meikongzhen.jpg'
        },
        'xiqiao的家': {
            'location': [-40, 40, -2229]
        },
        '寒月家旧址': {
            'location': [700, 40, -2229]
        },
        'ricky的家': {
            'location': [1550, 40, -2230]
        },

        //K3线
        '羊村': {
            'location': [943, 40, 834]
        },
        //'LSF的家' : { 'location' : [859,40,1036]}, 
        '土豆镇': {
            'location': [
                // 北站台，原土豆镇北
                [479, 40, 1160],
                // 南站台，原土豆镇西挪动
                [479, 40, 1350],
            ]
        },
        'Wintering_的家': {
            'location': [120, 40, 1174]
        },
        'FishWit的家': {
            'location': [-120, 40, 1175]
        },
        '尸冢': {
            'location': [-515, 40, 1174]
        },
        '白虎岭': {
            'location': [-671, 40, 1177]
        },
        '樱花乡': {
            'location': [-788, 40, 1175]
        },
        '樱花乡西': {
            'location': [-1030, 40, 1030]
        },

        //东方线
        //'中央枢纽' : { 'location' : [859,40,435]}, 
        '河神枢纽': {
            'location': [1305, 25, 436]
        },
        'miaomiao故居': {
            'location': [1919, 40, 160]
        },
        'lost的家': {
            'location': [1918, 40, -240]
        },
        'Byepast家旧址': {
            'location': [1920, 40, -375]
        },
        '福原枢纽': {
            'location': [1919, 40, -679]
        },
        'KK的安置房': {
            'location': [2050, 40, -681]
        },
        '猫音小村': {
            'location': [2350, 40, -681]
        },
        '艾德拉斯军事基地': {
            'location': [2351, 40, -1202]
        },
        '风车镇': {
            'location': [2322, 40, -1337]
        },

        //鱼塔线
        //'河神枢纽' : { 'location' : [1305,25,436]}, 
        '多拉鱼塔': {
            'location': [1306, 25, 314]
        },

        //二狗线
        //'miaomiao故居' : { 'location' : [1919,40,160]}, 
        '狗哥的家': {
            'location': [2315, 40, 140]
        },

        //K4线北段
        //'未名阁' : { 'location' : [-788,40,412]}, 
        '高地枢纽': {
            'location': [-1130, 40, 412]
        },
        '艾拉的家': {
            'location': [-1350, 40, 412]
        },
        '稻之乡南': {
            'location': [-2301, 40, 405]
        },

        //K4线南段
        //'漆黑之翼' : { 'location' : [-120,40,837]}, 
        //'FishWit的家' : { 'location' : [-120,40,1175]}, 
        '阿云台': {
            'location': [1, 40, 1349]
        },
        '终南山': {
            'location': [0, 40, 1737]
        },
        'KINDEL的家': {
            'location': [-92, 40, 2570]
        },
        '雪亭': {
            'location': [-92, 40, 3020]
        },
        'ij枢纽': {
            'location': [-11, 20, 3378]
        },
        'XS枢纽': {
            'location': [-10, 20, 4500]
        },
        '猫村枢纽': {
            'location': [-11, 40, 5301]
        },

        //K5线
        //'未名阁' : { 'location' : [-788,40,412]}, 
        '七魂家旧址': {
            'location': [-788, 40, 890]
        },
        '盘丝洞': {
            'location': [-785, 40, 1089]
        },
        //'樱花乡' : { 'location' : [-788,40,1175]}, 
        '风之镇': {
            'location': [-788, 40, 1737]
        },
        'lsy的家': {
            'location': [-862, 60, 1726]
        },
        '风之镇西': {
            'location': [-1256, 56, 1863]
        },
        '沙漠枢纽': {
            'location': [-1245, 74, 2792]
        },
        'tz的家': {
            'location': [-236, 40, 2791]
        },
        '咸鱼': {
            'location': [-38, 40, 2886]
        },
        '双子阁': {
            'location': [106, 40, 3203]
        },

        //发如雪线
        //'风之镇' : { 'location' : [-788,40,1737]}, 
        //'终南山' : { 'location' : [0,40,1737]}, 
        //'魔瓶的家' : { 'location' : [859,40,1737]}, 

        //新风线
        //'沙漠枢纽' : { 'location' : [-1245,74,2792]}, 
        '糖湖镇': {
            'location': [-1258, 69, 3354]
        },

        //参宿线
        //'稻之乡南' : { 'location' : [-2301,40,405]}, 
        //'tz的家' : { 'location' : [-236,40,2791]}, 
        //'雪亭' : { 'location' : [-92,40,3020]}, 
        //'双子阁' : { 'location' : [106,40,3203]}, 
        //'ij枢纽' : { 'location' : [-11,20,3878]}, 

        //K6线
        //'樱花乡西' : { 'location' : [-1030,40,1030]}, 
        'ranfei的家': {
            'location': [-1129, 40, 585]
        },
        //'高地枢纽' : { 'location' : [-1130,40,412]}, 
        '老郭故居': {
            'location': [-1130, 40, -220]
        },
        '大裤衩': {
            'location': [-1130, 40, -400]
        },
        '肥宅乐园': {
            'location': [-1129, 40, -817]
        },
        'ZERO的家': {
            'location': [-1046, 40, -1177]
        },
        'Meowth的家': {
            'location': [-1045, 40, -1985]
        },
        //'三界枢纽' : { 'location' : [-650,40,-1985]}, 
        '妹控镇南': {
            'location': [-384, 39, -1985]
        },
        '妹控客栈': {
            'location': [-405, 39, -2064]
        },
        //'妹控镇' : { 'location' : [-385,39,-2228]}, 
        '螃蟹岛灯塔': {
            'location': [-253, 20, -2730]
        },
        '春暖花开': {
            'location': [-385, 20, -2841]
        },
        '卫岛': {
            'location': [-578, 20, -3121]
        },

        //雪国线
        //'春暖花开' : { 'location' : [-385,20,-2841]}, 
        '寒意镇': {
            'location': [-1045, 40, -2840]
        },
        '黄老菊的家': {
            'location': [-1840, 40, -2840]
        },
        '七魂的家': {
            'location': [-2810, 40, -2839]
        },
        // '新手村': {'location': [-3987, 40, -4502]},
        '天照遗址': {
            'location': [-4600, 40, -4500]
        },
        '冰船比赛活动场地': {
            'location': [-4599, 40, -5340]
        },

        //德意志线
        //'黄老菊的家' : { 'location' : [-1840,40,-2840]}, 
        '楚格峰': {
            'location': [-1839, 40, -4501]
        },
        '柯尼斯堡': {
            'location': [-1841, 40, -4827]
        },

        //奥兹线
        //'寒意镇' : { 'location' : [-1045,40,-2840]}, 
        //'Meowth的家' : { 'location' : [-1045,40,-1985]}, 

        //K7线
        //'漆黑之翼' : { 'location' : [-120,40,837]}, 
        '天守阁': {
            'location': [-560, 40, 890]
        },
        //'七魂家旧址' : { 'location' : [-788,40,890]}, 
        //'樱花乡西' : { 'location' : [-1030,40,1030]}, 

        //K8线
        //'ZERO的家' : { 'location' : [-1046,40,-1177]}, 
        //'彩虹镇' : { 'location' : [-650,40,-1177]}, 
        '_qUUp_的家': {
            'location': [-35, 40, -1178]
        },
        '星海湾': {
            'location': [
                [330, 40, -1178],

                // 北站台，对接applezhou家和雨的故事的家
                [330, 40, -1301]
            ]
        },
        '方台': {
            'location': [810, 40, -1090]
        },
        'x_xGe海灯塔': {
            'location': [1549, 40, -1090]
        },

        //M1线
        //'福原枢纽' : { 'location' : [1919,40,-679]}, 
        '赞服苏维埃根据地': {
            'location': [1770, 40, -679]
        },
        //'flam的家' : { 'location' : [1549,40,-900]}, 
        //'x_xGe海灯塔' : { 'location' : [1549,40,-1090]}, 
        '末影镇': {
            'location': [1549, 40, -1610]
        },
        //'ricky的家' : { 'location' : [1550,40,-2230]}, 
        '红牛岛': {
            'location': [2000, 40, -3071]
        },
        'SCP驻赞服总办事处': {
            'location': [3454, 47, -3650]
        },

        //K9线
        //'森林枢纽' : { 'location' : [1080,40,1997]}, 
        '富饶港': {
            'location': [1074, 40, 2700]
        },
        '沙河枢纽': {
            'location': [1080, 40, 3202]
        },
        '咸鱼东': {
            'location': [400, 40, 3203]
        },
        //'双子阁' : { 'location' : [106,40,3203]}, 

        //伊苏线
        //'沙河枢纽' : { 'location' : [1080,40,3202]}, 
        '泽民': {
            'location': [1205, 40, 3410]
        },
        '骨乐园': {
            'location': [1205, 40, 3690]
        },
        '寺院化石博物馆': {
            'location': [1206, 40, 4190]
        },
        '上海老江': {
            'location': [1207, 40, 4489]
        },
        '地下城': {
            'location': [917, 40, 4737]
        },
        //'地下城北': {'location': [917, 40, 4499]},
        '猫耳的家': {
            'location': [267, 40, 5301]
        },
        //'猫村枢纽': {'location': [-11, 40, 5301]},
        //'四方枢纽': {'location': [-900, 40, 5300]},
        '照桥': {
            'location': [-1960, 119, 5260]
        },

        //K10线
        //'老郭故居' : { 'location' : [-1130,40,-220]}, 
        '秋山的家': {
            'location': [-1950, 40, -221]
        },
        '光明镇': {
            'location': [-2150, 40, -130]
        },
        '稻之乡': {
            'location': [-2299, 40, 160]
        },
        //'稻之乡南' : { 'location' : [-2301,40,405]}, 
        //'运通枢纽': {'location': [-2700, 40, 499]},
        '浮离': {
            'location': [-3100, 40, 499],
            'description': '一个力图实用与美观相结合的小镇。',
            'img': 'station_fuli.jpg'
        },
        '蜀汉国界': {
            'location': [-3901, 40, 1350]
        },

        //K11线
        //'七魂的家' : { 'location' : [-2810,40,-2839]}, 
        '作案哥的家': {
            'location': [-2809, 40, -1985]
        },

        //K12线
        //'作案哥的家' : { 'location' : [-2809,40,-1985]}, 
        //'Meowth的家' : { 'location' : [-1045,40,-1985]}, 

        //K13线
        //'阿云台' : { 'location' : [1,40,1349]}, 
        '荔宫': {
            'location': [160, 40, 1350],
            'description': 'b站搜索纯种荔枝酱，了解一下',
            'img': 'station_ligong.jpg'
        },
        //'土豆镇': {'location': [[479, 40, 1160],[479, 40, 1350],]},
        //'无人沙村' : { 'location' : [859,40,1349]},

        //K14线
        //'艾拉的家' : { 'location' : [-1350,40,412]}, 
        'gaffey的家': {
            'location': [-1349, 40, 120]
        },
        '海中粟': {
            'location': [-1871, 20, 128]
        },
        //'稻之乡': {
        //    'location': [-2299, 40, 160]
        //},

        //K15线
        //'咸鱼东' : { 'location' : [400,40,3203]}, 
        '96Ko的家': {
            'location': [399, 40, 3340]
        },
        '提尼岛北': {
            'location': [401, 20, 4000]
        },
        '提尼岛工业园': {
            'location': [400, 20, 4499]
        },
        //'XS枢纽' : { 'location' : [-10,20,4500]},
        '共产主义大陆': {
            'location': [-945, 40, 4329]
        },
        '瑜陵': {
            'location': [
                [-1257, 20, 4329],
                [-1257, 72, 4329]
            ]
        },
        //'糖湖镇': {'location': [-1258, 69, 3354]},

        //比利线
        '多拉的家': {
            'location': [654, 71, -2149]
        },
        '北方村庄': {
            'location': [556, 66, -1733]
        },

        //波止线
        //'提尼岛工业园': {'location': [400, 20, 4499]},
        '地下城北': {
            'location': [917, 40, 4499]
        },
        //'上海老江': {'location': [1207, 40, 4489]},

        //风光线
        //'风之镇': {'location': [-788, 40, 1737]},
        '羊驼小屋': {
            'location': [-849, 93, 1866]
        },
        '风之国塔': {
            'location': [-1104, 96, 1860]
        },
        //'风之镇西': {'location': [-1256, 56, 1863]},
        '风之新镇北': {
            'location': [-1575, 71, 1860]
        },

        //血汗线
        '楚格峰': {
            'location': [-1839, 40, -4501]
        },
        '新手村': {
            'location': [-3987, 40, -4502]
        },

        //X专线
        '狼窝': {
            'location': [525, 40, 19],
            'description': '距主城最近又最丑还没被强拆的家。',
            'img': 'station_langwo.jpg'
        },
        '象头岛': {
            'location': [860, 20, 20],
            'description': '大象头部形状的一个岛屿。',
            'img': 'station_xiangtoudao.jpg'
        },

        //吕梨线
        //'共产主义大陆': {'location': [-945, 40, 4329]},
        //'瑜陵': {'location': [[-1257, 20, 4329],[-1257, 72, 4329]]},

        // K16线
        //'共产主义大陆': {'location': [-945, 40, 4329]},
        '四方枢纽': {
            'location': [-900, 40, 5300]
        },
        '影山居': {
            'location': [-919, 41, 5990]
        },

        // K17线
        '运通枢纽': {
            'location': [-2700, 40, 499]
        },
        '同妹在樱花下看麦田': {
            'location': [-2699, 40, 1502]
        },
        '村下屋根': {
            'location': [-1880, 40, 1864]
        },
        //'风之新镇北': {'location': [-1575, 71,1860]},
    },
    'lines': {
        '赞一线': {
            "color": "#FF0000",
            "stations": ['城北枢纽', '赞服国际机场', '出生点', '漆黑之翼']
        },
        '赞二线': {
            "color": "#000066",
            "stations": ['未名阁', '出生点', '中央枢纽']
        },
        'K1线': {
            "color": "#3399CC",
            "stations": ['妹控镇南', 'applezhou家旧址', '星海湾', '雨的故事的家', 'xiximi的家', '象头岛', '中央枢纽', 'LSF的家', '无人沙村', '魔瓶的家', '森林枢纽', '夏尔镇']
        },
        'K2线': {
            "color": "#999999",
            "stations": ['flam的家', 'xiximi的家', 'KK的沙漠别墅', '城北枢纽', '彩虹半岛', '彩虹镇洲际酒店', '彩虹镇', '三界枢纽', '妹控镇', 'xiqiao的家', '寒月家旧址', 'ricky的家']
        },
        'K3线': {
            "color": "#996600",
            "stations": ['羊村', 'LSF的家', '土豆镇', 'Wintering_的家', 'FishWit的家', '尸冢', '白虎岭', '樱花乡', '樱花乡西']
        },
        'K4线北段': {
            "color": "#CC6699",
            "stations": ['未名阁', '高地枢纽', '艾拉的家', '稻之乡南']
        },
        'K4线南段': {
            "color": "#CC6699",
            "stations": ['漆黑之翼', 'FishWit的家', '阿云台', '终南山', 'KINDEL的家', '雪亭', 'ij枢纽', 'XS枢纽', '猫村枢纽']
        },
        'K5线': {
            "color": "#99CCFF",
            "stations": ['未名阁', '七魂家旧址', '盘丝洞', '樱花乡', '风之镇', 'lsy的家', '风之镇西', '沙漠枢纽', 'tz的家', '咸鱼', '双子阁']
        },
        'K6线': {
            "color": "#FF9999",
            "stations": ['樱花乡西', 'ranfei的家', '高地枢纽', '老郭故居', '大裤衩', '肥宅乐园', 'ZERO的家', 'Meowth的家', '三界枢纽', '妹控镇南', '妹控客栈', '妹控镇', '螃蟹岛灯塔', '春暖花开', '卫岛']
        },
        'K7线': {
            "color": "#FF6633",
            "stations": ['漆黑之翼', '天守阁', '七魂家旧址', '樱花乡西']
        },
        'K8线': {
            "color": "#99CCCC",
            "stations": ['ZERO的家', '彩虹镇', '_qUUp_的家', '星海湾', '方台', 'x_xGe海灯塔']
        },
        'K9线': {
            "color": "#CC9999",
            "stations": ['森林枢纽', '富饶港', '沙河枢纽', '咸鱼东', '双子阁']
        },
        'K10线': {
            "color": "#33CC66",
            "stations": ['老郭故居', '秋山的家', '光明镇', '稻之乡', '稻之乡南', '运通枢纽', '浮离', '蜀汉国界']
        },
        'K11线': {
            "color": "#CC6600",
            "stations": ['七魂的家', '作案哥的家']
        },
        'K12线': {
            "color": "#FF3399",
            "stations": ['作案哥的家', 'Meowth的家']
        },
        'K13线': {
            "color": "#339999",
            "stations": ['阿云台', '荔宫', '土豆镇', '无人沙村']
        },
        'K14线': {
            "color": "#990000",
            "stations": ['艾拉的家', 'gaffey的家', '海中粟', '稻之乡', '秋山的家']
        },
        'K15线': {
            "color": "#003366",
            "stations": ['咸鱼东', '96Ko的家', '提尼岛北', '提尼岛工业园', 'XS枢纽', '共产主义大陆', '瑜陵', '糖湖镇']
        },
        'K16线': {
            "color": "#663300",
            "stations": ['共产主义大陆', '四方枢纽', '影山居']
        },
        'K17线': {
            "color": "#990066",
            "stations": ['运通枢纽', '同妹在樱花下看麦田', '村下屋根', '风之新镇北']
        },
        'M1线': {
            "color": "#3399FF",
            "stations": ['福原枢纽', '赞服苏维埃根据地', 'flam的家', 'x_xGe海灯塔', '末影镇', 'ricky的家', '红牛岛', 'SCP驻赞服总办事处']
        },
        '爱国线': {
            "color": "#66CCCC",
            "stations": ['夏尔镇', 'ACE的家', '夏尔村民农场南', 'slantyone的家', '晓枫故居', '苏瑕瑜的家', '错误岛', '寒月的家']
        },
        '少女前线': {
            "color": "#FFCCFF",
            "stations": ['applezhou的家', '夏尔村民农场南', '格里芬']
        },
        '东方线': {
            "color": "#CC00FF",
            "stations": ['中央枢纽', '河神枢纽', 'miaomiao故居', 'lost的家', 'Byepast家旧址', '福原枢纽', 'KK的安置房', '猫音小村', '艾德拉斯军事基地', '风车镇']
        },
        '二狗线': {
            "color": "#9999CC",
            "stations": ['miaomiao故居', '狗哥的家']
        },
        '发如雪线': {
            "color": "#99FF33",
            "stations": ['风之镇', '终南山', '魔瓶的家']
        },
        '参宿线': {
            "color": "#0099CC",
            "stations": ['KINDEL的家', 'tz的家', '雪亭', '双子阁', 'ij枢纽']
        },
        '雪国线': {
            "color": "#CCCCCC",
            "stations": ['春暖花开', '寒意镇', '黄老菊的家', '七魂的家', '新手村', '天照遗址', '冰船比赛活动场地']
        },
        '德意志线': {
            "color": "#FF9900",
            "stations": ['黄老菊的家', '楚格峰', '柯尼斯堡']
        },
        '奥兹线': {
            "color": "#FFCC00",
            "stations": ['寒意镇', 'Meowth的家']
        },
        '新风线': {
            "color": "#FF0099",
            "stations": ['沙漠枢纽', '糖湖镇']
        },
        '鱼塔线': {
            "color": "#FF00FF",
            "stations": ['河神枢纽', '多拉鱼塔']
        },
        '伊苏线': {
            "color": "#0066CC",
            "stations": ['沙河枢纽', '泽民', '骨乐园', '寺院化石博物馆', '上海老江', '地下城', '地下城北', '猫耳的家', '猫村枢纽', '四方枢纽', '照桥']
        },
        'X专线': {
            "color": "#336699",
            "stations": ['狼窝', '象头岛']
        },
        '比利线': {
            "color": "#003399",
            "stations": ['多拉的家', '北方村庄']
        },
        '风光线': {
            "color": "#339900",
            "stations": ['风之镇', '羊驼小屋', '风之国塔', '风之镇西', '风之新镇北']
        },
        '血汗线': {
            "color": "#CCFFFF",
            "stations": ['楚格峰', '新手村']
        },
        '吕梨线': {
            "color": "#996699",
            "stations": ['共产主义大陆', '瑜陵']
        },
        '波止线': {
            "color": "#66CCFF",
            "stations": ['提尼岛工业园', '地下城北', '上海老江']
        },
    },
    'paths': [
        // 赞一线
        {
            "start": "城北枢纽",
            "end": "赞服国际机场",
            "stationArray": [0, 1],
            "line": "赞一线"
        }, 
        {
            "start": "赞服国际机场",
            "end": "城北枢纽",
            "line": "赞一线"
        }, 
        {
            "start": "赞服国际机场",
            "end": "出生点",
            "stationArray": [1, 1],
            "line": "赞一线"
        }, 
        {
            "start": "出生点",
            "end": "赞服国际机场",
            "line": "赞一线"
        }, 
        {
            "start": "出生点",
            "end": "漆黑之翼",
            "stationArray": [1, 0],
            "line": "赞一线"
        }, 
        {
            "start": "漆黑之翼",
            "end": "出生点",
            "line": "赞一线"
        }, 
        // 赞二线
        {
            "start": "未名阁",
            "end": "出生点",
            "stationArray": [0, 3],
            "line": "赞二线"
        }, 
        {
            "start": "出生点",
            "end": "未名阁",
            "stationArray": [2, 0],
            "line": "赞二线"
        }, 
        {
            "start": "出生点",
            "end": "中央枢纽",
            "stationArray": [3, 0],
            "line": "赞二线"
        }, 
        {
            "start": "中央枢纽",
            "end": "出生点",
            "stationArray": [0, 2],
            "line": "赞二线"
        }, 
        // K1线
        {
            "start": "妹控镇南",
            "end": "applezhou家旧址",
            "line": "K1线"
        }, 
        {
            "start": "applezhou家旧址",
            "end": "妹控镇南",
            "line": "K1线"
        }, 
        {
            "start": "applezhou家旧址",
            "end": "星海湾",
            "stationArray": [0, 1],
            "line": "K1线"
        }, 
        {
            "start": "星海湾",
            "end": "applezhou家旧址",
            //这里距离按照南站台出发算
            "line": "K1线"
        }, 
        {
            "start": "星海湾",
            "end": "雨的故事的家",
            "line": "K1线"
        }, 
        {
            "start": "雨的故事的家",
            "end": "星海湾",
            "stationArray": [0, 1],
            //这里距离按照南站台出发算
            "line": "K1线"
        }, 
        {
            "start": "雨的故事的家",
            "end": "xiximi的家",
            "line": "K1线"
        }, 
        {
            "start": "xiximi的家",
            "end": "雨的故事的家",
            "line": "K1线"
        }, 
        {
            "start": "xiximi的家",
            "end": "象头岛",
            "line": "K1线"
        }, 
        {
            "start": "象头岛",
            "end": "xiximi的家",
            "line": "K1线"
        }, 
        {
            "start": "象头岛",
            "end": "中央枢纽",
            "line": "K1线"
        }, 
        {
            "start": "中央枢纽",
            "end": "象头岛",
            "line": "K1线"
        }, 
        {
            "start": "中央枢纽",
            "end": "LSF的家",
            "line": "K1线"
        }, 
        {
            "start": "LSF的家",
            "end": "中央枢纽",
            "line": "K1线"
        }, 
        {
            "start": "LSF的家",
            "end": "无人沙村",
            "line": "K1线"
        }, 
        {
            "start": "无人沙村",
            "end": "LSF的家",
            "line": "K1线"
        }, 
        {
            "start": "无人沙村",
            "end": "魔瓶的家",
            "line": "K1线"
        }, 
        {
            "start": "魔瓶的家",
            "end": "无人沙村",
            "line": "K1线"
        }, 
        {
            "start": "魔瓶的家",
            "end": "森林枢纽",
            "line": "K1线"
        }, 
        {
            "start": "森林枢纽",
            "end": "魔瓶的家",
            "line": "K1线"
        }, 
        {
            "start": "森林枢纽",
            "end": "夏尔镇",
            "line": "K1线"
        }, 
        {
            "start": "夏尔镇",
            "end": "森林枢纽",
            "line": "K1线"
        }, 

        // K2线
        {
            "start": "flam的家",
            "end": "xiximi的家",
            "line": "K2线"
        },
        {
            "start": "xiximi的家",
            "end": "flam的家",
            "line": "K2线"
        },
        {
            "start": "xiximi的家",
            "end": "KK的沙漠别墅",
            "line": "K2线"
        },
        {
            "start": "KK的沙漠别墅",
            "end": "xiximi的家",
            "line": "K2线"
        },
        {
            "start": "KK的沙漠别墅",
            "end": "城北枢纽",
            "line": "K2线"
        },
        {
            "start": "城北枢纽",
            "end": "KK的沙漠别墅",
            "line": "K2线"
        },
        {
            "start": "城北枢纽",
            "end": "彩虹半岛",
            "line": "K2线"
        },
        {
            "start": "彩虹半岛",
            "end": "城北枢纽",
            "line": "K2线"
        },
        {
            "start": "彩虹半岛",
            "end": "彩虹镇",
            "line": "K2线"
        },
        {
            "start": "彩虹镇",
            "end": "彩虹半岛",
            "line": "K2线"
        },
        // ---- 彩虹镇洲际酒店支线
        {
            "start": "彩虹镇",
            "end": "彩虹镇洲际酒店",
            "line": "K2线"
        },
        {
            "start": "彩虹镇洲际酒店",
            "end": "彩虹镇",
            "line": "K2线"
        },
        {
            "start": "彩虹镇洲际酒店",
            "end": "彩虹半岛",
            "line": "K2线"
        },
        // ---- 彩虹镇洲际酒店支线
        {
            "start": "彩虹镇",
            "end": "三界枢纽",
            "line": "K2线"
        },
        {
            "start": "三界枢纽",
            "end": "彩虹镇",
            "line": "K2线"
        },
        {
            "start": "三界枢纽",
            "end": "妹控镇",
            "line": "K2线"
        },
        {
            "start": "妹控镇",
            "end": "三界枢纽",
            "line": "K2线"
        },
        {
            "start": "妹控镇",
            "end": "xiqiao的家",
            "line": "K2线"
        },
        {
            "start": "xiqiao的家",
            "end": "妹控镇",
            "line": "K2线"
        },
        {
            "start": "xiqiao的家",
            "end": "寒月家旧址",
            "line": "K2线"
        },
        {
            "start": "寒月家旧址",
            "end": "xiqiao的家",
            "line": "K2线"
        },
        {
            "start": "寒月家旧址",
            "end": "ricky的家",
            "line": "K2线"
        },
        {
            "start": "ricky的家",
            "end": "寒月家旧址",
            "line": "K2线"
        },

        // K3线
        {
            "start": "羊村",
            "end": "LSF的家",
            "line": "K3线"
        },
        {
            "start": "LSF的家",
            "end": "羊村",
            "line": "K3线"
        },
        {
            "start": "LSF的家",
            "end": "土豆镇",
            "line": "K3线"
        },
        {
            "start": "土豆镇",
            "end": "LSF的家",
            "stationArray": [1, 0],//按照远的算
            "line": "K3线"
        },
        {
            "start": "土豆镇",
            "end": "Wintering_的家",
            "stationArray": [1, 0],//按照远的算
            "line": "K3线"
        },
        {
            "start": "Wintering_的家",
            "end": "土豆镇",
            "line": "K3线"
        },
        {
            "start": "Wintering_的家",
            "end": "FishWit的家",
            "line": "K3线"
        },
        {
            "start": "FishWit的家",
            "end": "Wintering_的家",
            "line": "K3线"
        },
        {
            "start": "FishWit的家",
            "end": "尸冢",
            "line": "K3线"
        },
        {
            "start": "尸冢",
            "end": "FishWit的家",
            "line": "K3线"
        },
        {
            "start": "尸冢",
            "end": "樱花乡",
            "line": "K3线"
        },
        {
            "start": "樱花乡",
            "end": "尸冢",
            "line": "K3线"
        },
        // ---- 白虎岭支线
        {
            "start": "白虎岭",
            "end": "尸冢",
            "line": "K3线"
        },
        {
            "start": "白虎岭",
            "end": "樱花乡",
            "line": "K3线"
        },
        {
            "start": "樱花乡",
            "end": "白虎岭",
            "line": "K3线"
        },
        // ---- 白虎岭支线
        {
            "start": "樱花乡",
            "end": "樱花乡西",
            "line": "K3线"
        },
        {
            "start": "樱花乡西",
            "end": "樱花乡",
            "line": "K3线"
        },

        // K4线北段
        {
            "start": "未名阁",
            "end": "高地枢纽",
            "line": "K4线北段"
        },
        {
            "start": "高地枢纽",
            "end": "未名阁",
            "line": "K4线北段"
        },
        {
            "start": "高地枢纽",
            "end": "艾拉的家",
            "line": "K4线北段"
        },
        {
            "start": "艾拉的家",
            "end": "高地枢纽",
            "line": "K4线北段"
        },
        {
            "start": "艾拉的家",
            "end": "稻之乡南",
            "line": "K4线北段"
        },
        {
            "start": "稻之乡南",
            "end": "艾拉的家",
            "line": "K4线北段"
        },

        // K4线南段
        {
            "start": "漆黑之翼",
            "end": "FishWit的家",
            "line": "K4线南段"
        },
        {
            "start": "FishWit的家",
            "end": "漆黑之翼",
            "line": "K4线南段"
        },
        {
            "start": "FishWit的家",
            "end": "阿云台",
            "line": "K4线南段"
        },
        {
            "start": "阿云台",
            "end": "FishWit的家",
            "line": "K4线南段"
        },
        {
            "start": "阿云台",
            "end": "终南山",
            "line": "K4线南段"
        },
        {
            "start": "终南山",
            "end": "阿云台",
            "line": "K4线南段"
        },
        {
            "start": "终南山",
            "end": "KINDEL的家",
            "line": "K4线南段"
        },
        {
            "start": "KINDEL的家",
            "end": "终南山",
            "line": "K4线南段"
        },
        {
            "start": "KINDEL的家",
            "end": "雪亭",
            "line": "K4线南段"
        },
        {
            "start": "雪亭",
            "end": "KINDEL的家",
            "line": "K4线南段"
        },
        {
            "start": "雪亭",
            "end": "ij枢纽",
            "line": "K4线南段"
        },
        {
            "start": "ij枢纽",
            "end": "雪亭",
            "line": "K4线南段"
        },
        {
            "start": "ij枢纽",
            "end": "XS枢纽",
            "line": "K4线南段"
        },
        {
            "start": "XS枢纽",
            "end": "ij枢纽",
            "line": "K4线南段"
        },
        {
            "start": "XS枢纽",
            "end": "猫村枢纽",
            "line": "K4线南段"
        },
        {
            "start": "猫村枢纽",
            "end": "XS枢纽",
            "line": "K4线南段"
        },

        // K5线
        {
            "start": "未名阁",
            "end": "七魂家旧址",
            "line": "K5线"
        },
        {
            "start": "七魂家旧址",
            "end": "未名阁",
            "line": "K5线"
        },
        {
            "start": "七魂家旧址",
            "end": "樱花乡",
            "line": "K5线"
        },
        {
            "start": "樱花乡",
            "end": "七魂家旧址",
            "line": "K5线"
        },
        // ---- 盘丝洞支线
        {
            "start": "盘丝洞",
            "end": "樱花乡",
            "line": "K5线"
        },
        // ---- 盘丝洞支线
        {
            "start": "樱花乡",
            "end": "盘丝洞",
            "line": "K5线"
        },
        {
            "start": "盘丝洞",
            "end": "七魂家旧址",
            "line": "K5线"
        },
        {
            "start": "樱花乡",
            "end": "风之镇",
            "line": "K5线"
        },
        {
            "start": "风之镇",
            "end": "樱花乡",
            "line": "K5线"
        },
        // ----lsy的家支线
        {
            "start": "风之镇",
            "end": "lsy的家",
            "line": "K5线"
        },
        {
            "start": "lsy的家",
            "end": "风之镇",
            "line": "K5线"
        },
        // ----lsy的家支线
        {
            "start": "风之镇",
            "end": "风之镇西",
            "line": "K5线"
        },
        {
            "start": "风之镇西",
            "end": "风之镇",
            "line": "K5线"
        },
        {
            "start": "风之镇西",
            "end": "沙漠枢纽",
            "line": "K5线"
        },
        {
            "start": "沙漠枢纽",
            "end": "风之镇西",
            "line": "K5线"
        },
        {
            "start": "沙漠枢纽",
            "end": "tz的家",
            "line": "K5线"
        },
        {
            "start": "tz的家",
            "end": "沙漠枢纽",
            "line": "K5线"
        },
        {
            "start": "tz的家",
            "end": "咸鱼",
            "line": "K5线"
        },
        {
            "start": "咸鱼",
            "end": "tz的家",
            "line": "K5线"
        },
        {
            "start": "双子阁",
            "end": "咸鱼",
            "line": "K5线"
        },
        {
            "start": "咸鱼",
            "end": "双子阁",
            "line": "K5线"
        },

        // K6线
        {
            "start": "樱花乡西",
            "end": "ranfei的家",
            "line": "K6线"
        },
        {
            "start": "ranfei的家",
            "end": "樱花乡西",
            "line": "K6线"
        },
        {
            "start": "ranfei的家",
            "end": "高地枢纽",
            "line": "K6线"
        },
        {
            "start": "高地枢纽",
            "end": "ranfei的家",
            "line": "K6线"
        },
        {
            "start": "高地枢纽",
            "end": "老郭故居",
            "line": "K6线"
        },
        {
            "start": "老郭故居",
            "end": "高地枢纽",
            "line": "K6线"
        },
        {
            "start": "老郭故居",
            "end": "大裤衩",
            "line": "K6线"
        },
        {
            "start": "大裤衩",
            "end": "老郭故居",
            "line": "K6线"
        },
        {
            "start": "大裤衩",
            "end": "肥宅乐园",
            "line": "K6线"
        },
        {
            "start": "肥宅乐园",
            "end": "大裤衩",
            "line": "K6线"
        },
        {
            "start": "肥宅乐园",
            "end": "ZERO的家",
            "line": "K6线"
        },
        {
            "start": "ZERO的家",
            "end": "肥宅乐园",
            "line": "K6线"
        },
        {
            "start": "ZERO的家",
            "end": "Meowth的家",
            "line": "K6线"
        },
        {
            "start": "Meowth的家",
            "end": "ZERO的家",
            "line": "K6线"
        },
        {
            "start": "Meowth的家",
            "end": "三界枢纽",
            "line": "K6线"
        },
        {
            "start": "三界枢纽",
            "end": "Meowth的家",
            "line": "K6线"
        },
        {
            "start": "三界枢纽",
            "end": "妹控镇南",
            "line": "K6线"
        },
        {
            "start": "妹控镇南",
            "end": "三界枢纽",
            "line": "K6线"
        },
        {
            "start": "妹控镇南",
            "end": "妹控客栈",
            "line": "K6线"
        },
        {
            "start": "妹控客栈",
            "end": "妹控镇南",
            "line": "K6线"
        },
        {
            "start": "妹控镇南",
            "end": "妹控镇",
            "line": "K6线"
        },
        {
            "start": "妹控镇",
            "end": "妹控镇南",
            "line": "K6线"
        },
        // ---- 螃蟹岛灯塔支线
        {
            "start": "妹控镇",
            "end": "螃蟹岛灯塔",
            "line": "K6线"
        },
        {
            "start": "螃蟹岛灯塔",
            "end": "妹控镇",
            "line": "K6线"
        },
        {
            "start": "螃蟹岛灯塔",
            "end": "春暖花开",
            "line": "K6线"
        },
        {
            "start": "春暖花开",
            "end": "螃蟹岛灯塔",
            "line": "K6线"
        },
        // ---- 螃蟹岛灯塔支线
        {
            "start": "妹控镇",
            "end": "春暖花开",
            "line": "K6线"
        },
        {
            "start": "春暖花开",
            "end": "妹控镇",
            "line": "K6线"
        },
        {
            "start": "春暖花开",
            "end": "卫岛",
            "line": "K6线"
        },
        {
            "start": "卫岛",
            "end": "春暖花开",
            "line": "K6线"
        },

        // K7线
        {
            "start": "漆黑之翼",
            "end": "天守阁",
            "line": "K7线"
        },
        {
            "start": "天守阁",
            "end": "漆黑之翼",
            "line": "K7线"
        },
        {
            "start": "天守阁",
            "end": "七魂家旧址",
            "line": "K7线"
        },
        {
            "start": "七魂家旧址",
            "end": "天守阁",
            "line": "K7线"
        },
        {
            "start": "七魂家旧址",
            "end": "樱花乡西",
            "line": "K7线"
        },
        {
            "start": "樱花乡西",
            "end": "七魂家旧址",
            "line": "K7线"
        },

        // K8线
        {
            "start": "ZERO的家",
            "end": "彩虹镇",
            "line": "K8线"
        },
        {
            "start": "彩虹镇",
            "end": "ZERO的家",
            "line": "K8线"
        },
        {
            "start": "彩虹镇",
            "end": "_qUUp_的家",
            "line": "K8线"
        },
        {
            "start": "_qUUp_的家",
            "end": "彩虹镇",
            "line": "K8线"
        },
        {
            "start": "_qUUp_的家",
            "end": "星海湾",
            "line": "K8线"
        },
        {
            "start": "星海湾",
            "end": "_qUUp_的家",
            "line": "K8线"
        },
        {
            "start": "星海湾",
            "end": "方台",
            "line": "K8线"
        },
        {
            "start": "方台",
            "end": "星海湾",
            "line": "K8线"
        },
        {
            "start": "方台",
            "end": "x_xGe海灯塔",
            "line": "K8线"
        },
        {
            "start": "x_xGe海灯塔",
            "end": "方台",
            "line": "K8线"
        },

        // K9线
        {
            "start": "森林枢纽",
            "end": "富饶港",
            "line": "K9线"
        },
        {
            "start": "富饶港",
            "end": "森林枢纽",
            "line": "K9线"
        },
        {
            "start": "富饶港",
            "end": "沙河枢纽",
            "line": "K9线"
        },
        {
            "start": "沙河枢纽",
            "end": "富饶港",
            "line": "K9线"
        },
        {
            "start": "沙河枢纽",
            "end": "咸鱼东",
            "line": "K9线"
        },
        {
            "start": "咸鱼东",
            "end": "沙河枢纽",
            "line": "K9线"
        },
        {
            "start": "咸鱼东",
            "end": "双子阁",
            "line": "K9线"
        },
        {
            "start": "双子阁",
            "end": "咸鱼东",
            "line": "K9线"
        },

        // K10线
        {
            "start": "老郭故居",
            "end": "秋山的家",
            "line": "K10线"
        },
        {
            "start": "秋山的家",
            "end": "老郭故居",
            "line": "K10线"
        },
        {
            "start": "秋山的家",
            "end": "光明镇",
            "line": "K10线"
        },
        {
            "start": "光明镇",
            "end": "秋山的家",
            "line": "K10线"
        },
        {
            "start": "光明镇",
            "end": "稻之乡",
            "line": "K10线"
        },
        {
            "start": "稻之乡",
            "end": "光明镇",
            "line": "K10线"
        },
        {
            "start": "稻之乡",
            "end": "稻之乡南",
            "line": "K10线"
        },
        {
            "start": "稻之乡南",
            "end": "稻之乡",
            "line": "K10线"
        },
        {
            "start": "稻之乡南",
            "end": "运通枢纽",
            "line": "K10线"
        },
        {
            "start": "运通枢纽",
            "end": "稻之乡南",
            "line": "K10线"
        },
        {
            "start": "运通枢纽",
            "end": "浮离",
            "line": "K10线"
        },
        {
            "start": "浮离",
            "end": "运通枢纽",
            "line": "K10线"
        },
        {
            "start": "浮离",
            "end": "蜀汉国界",
            "line": "K10线"
        },
        {
            "start": "蜀汉国界",
            "end": "浮离",
            "line": "K10线"
        },

        // K11线
        {
            "start": "七魂的家",
            "end": "作案哥的家",
            "line": "K11线"
        },
        {
            "start": "作案哥的家",
            "end": "七魂的家",
            "line": "K11线"
        },

        // K12线
        {
            "start": "作案哥的家",
            "end": "Meowth的家",
            "line": "K12线"
        },
        {
            "start": "Meowth的家",
            "end": "作案哥的家",
            "line": "K12线"
        },

        // K13线
        {
            "start": "阿云台",
            "end": "荔宫",
            "line": "K13线"
        },
        {
            "start": "荔宫",
            "end": "阿云台",
            "line": "K13线"
        },
        {
            "start": "荔宫",
            "end": "土豆镇",
            "stationArray": [0, 1],
            "line": "K13线"
        },
        {
            "start": "土豆镇",
            "end": "荔宫",//按照远的算
            "line": "K13线"
        },
        {
            "start": "土豆镇",
            "end": "无人沙村",//按照远的算
            "line": "K13线"
        },
        {
            "start": "无人沙村",
            "end": "土豆镇",
            "stationArray": [0, 1],
            "line": "K13线"
        },

        // K14线
        {
            "start": "艾拉的家",
            "end": "gaffey的家",
            "line": "K14线"
        },
        {
            "start": "gaffey的家",
            "end": "艾拉的家",
            "line": "K14线"
        },
        {
            "start": "gaffey的家",
            "end": "海中粟",
            "line": "K14线"
        },
        {
            "start": "海中粟",
            "end": "gaffey的家",
            "line": "K14线"
        },
        {
            "start": "海中粟",
            "end": "稻之乡",
            "line": "K14线"
        },
        {
            "start": "稻之乡",
            "end": "海中粟",
            "line": "K14线"
        },
        {
            "start": "海中粟",
            "end": "秋山的家",
            "line": "K14线"
        },
        {
            "start": "秋山的家",
            "end": "海中粟",
            "line": "K14线"
        },

        // K15线
        {
            "start": "咸鱼东",
            "end": "96Ko的家",
            "line": "K15线"
        },
        {
            "start": "96Ko的家",
            "end": "咸鱼东",
            "line": "K15线"
        },
        {
            "start": "96Ko的家",
            "end": "提尼岛北",
            "line": "K15线"
        },
        {
            "start": "提尼岛北",
            "end": "96Ko的家",
            "line": "K15线"
        },
        {
            "start": "提尼岛北",
            "end": "提尼岛工业园",
            "line": "K15线"
        },
        {
            "start": "提尼岛工业园",
            "end": "提尼岛北",
            "line": "K15线"
        },
        {
            "start": "提尼岛工业园",
            "end": "XS枢纽",
            "line": "K15线"
        },
        {
            "start": "XS枢纽",
            "end": "提尼岛工业园",
            "line": "K15线"
        },
        {
            "start": "XS枢纽",
            "end": "共产主义大陆",
            "line": "K15线"
        },
        {
            "start": "共产主义大陆",
            "end": "XS枢纽",
            "line": "K15线"
        },
        {
            "start": "共产主义大陆",
            "end": "瑜陵",
            "line": "K15线"
        },
        {
            "start": "瑜陵",
            "end": "共产主义大陆",
            "line": "K15线"
        },
        {
            "start": "瑜陵",
            "end": "糖湖镇",
            "line": "K15线"
        },
        {
            "start": "糖湖镇",
            "end": "瑜陵",
            "line": "K15线"
        },
        {
            "start": "共产主义大陆",
            "end": "瑜陵",
            "line": "K15线"
        },
        {
            "start": "瑜陵",
            "end": "共产主义大陆",
            "line": "K15线"
        },

        // M1线
        {
            "start": "福原枢纽",
            "end": "赞服苏维埃根据地",
            "line": "M1线"
        },
        {
            "start": "赞服苏维埃根据地",
            "end": "福原枢纽",
            "line": "M1线"
        },
        {
            "start": "赞服苏维埃根据地",
            "end": "flam的家",
            "line": "M1线"
        },
        {
            "start": "flam的家",
            "end": "赞服苏维埃根据地",
            "line": "M1线"
        },
        {
            "start": "flam的家",
            "end": "x_xGe海灯塔",
            "line": "M1线"
        },
        {
            "start": "x_xGe海灯塔",
            "end": "flam的家",
            "line": "M1线"
        },
        {
            "start": "x_xGe海灯塔",
            "end": "末影镇",
            "line": "M1线"
        },
        {
            "start": "末影镇",
            "end": "x_xGe海灯塔",
            "line": "M1线"
        },
        {
            "start": "末影镇",
            "end": "ricky的家",
            "line": "M1线"
        },
        {
            "start": "ricky的家",
            "end": "末影镇",
            "line": "M1线"
        },
        {
            "start": "ricky的家",
            "end": "红牛岛",
            "line": "M1线"
        },
        {
            "start": "红牛岛",
            "end": "ricky的家",
            "line": "M1线"
        },
        {
            "start": "红牛岛",
            "end": "SCP驻赞服总办事处",
            "line": "M1线"
        },
        {
            "start": "SCP驻赞服总办事处",
            "end": "红牛岛",
            "line": "M1线"
        },

        // 爱国线
        {
            "start": "夏尔镇",
            "end": "ACE的家",
            "line": "爱国线"
        },
        {
            "start": "ACE的家",
            "end": "夏尔镇",
            "line": "爱国线"
        },
        {
            "start": "ACE的家",
            "end": "夏尔村民农场南",
            "line": "爱国线"
        },
        {
            "start": "夏尔村民农场南",
            "end": "ACE的家",
            "line": "爱国线"
        },
        {
            "start": "夏尔村民农场南",
            "end": "slantyone的家",
            "line": "爱国线"
        },
        {
            "start": "slantyone的家",
            "end": "夏尔村民农场南",
            "line": "爱国线"
        },
        {
            "start": "slantyone的家",
            "end": "晓枫故居",
            "line": "爱国线"
        },
        {
            "start": "晓枫故居",
            "end": "slantyone的家",
            "line": "爱国线"
        },
        {
            "start": "晓枫故居",
            "end": "苏瑕瑜的家",
            "line": "爱国线"
        },
        {
            "start": "苏瑕瑜的家",
            "end": "晓枫故居",
            "line": "爱国线"
        },
        {
            "start": "苏瑕瑜的家",
            "end": "错误岛",
            "line": "爱国线"
        },
        {
            "start": "错误岛",
            "end": "苏瑕瑜的家",
            "line": "爱国线"
        },
        {
            "start": "错误岛",
            "end": "寒月的家",
            "line": "爱国线"
        },
        {
            "start": "寒月的家",
            "end": "错误岛",
            "line": "爱国线"
        },

        // 少女前线
        {
            "start": "applezhou的家",
            "end": "夏尔村民农场南",
            "line": "少女前线"
        },
        {
            "start": "夏尔村民农场南",
            "end": "applezhou的家",
            "line": "少女前线"
        },
        {
            "start": "夏尔村民农场南",
            "end": "格里芬",
            "line": "少女前线"
        },
        {
            "start": "格里芬",
            "end": "夏尔村民农场南",
            "line": "少女前线"
        },

        // 东方线
        {
            "start": "中央枢纽",
            "end": "河神枢纽",
            "line": "东方线"
        },
        {
            "start": "河神枢纽",
            "end": "中央枢纽",
            "line": "东方线"
        },
        {
            "start": "河神枢纽",
            "end": "miaomiao故居",
            "line": "东方线"
        },
        {
            "start": "miaomiao故居",
            "end": "河神枢纽",
            "line": "东方线"
        },
        {
            "start": "miaomiao故居",
            "end": "lost的家",
            "line": "东方线"
        },
        {
            "start": "lost的家",
            "end": "miaomiao故居",
            "line": "东方线"
        },
        {
            "start": "lost的家",
            "end": "Byepast家旧址",
            "line": "东方线"
        },
        {
            "start": "Byepast家旧址",
            "end": "lost的家",
            "line": "东方线"
        },
        {
            "start": "Byepast家旧址",
            "end": "福原枢纽",
            "line": "东方线"
        },
        {
            "start": "福原枢纽",
            "end": "Byepast家旧址",
            "line": "东方线"
        },
        {
            "start": "福原枢纽",
            "end": "KK的安置房",
            "line": "东方线"
        },
        {
            "start": "KK的安置房",
            "end": "福原枢纽",
            "line": "东方线"
        },
        {
            "start": "KK的安置房",
            "end": "猫音小村",
            "line": "东方线"
        },
        {
            "start": "猫音小村",
            "end": "KK的安置房",
            "line": "东方线"
        },
        {
            "start": "猫音小村",
            "end": "艾德拉斯军事基地",
            "line": "东方线"
        },
        {
            "start": "艾德拉斯军事基地",
            "end": "猫音小村",
            "line": "东方线"
        },
        {
            "start": "艾德拉斯军事基地",
            "end": "风车镇",
            "line": "东方线"
        },
        {
            "start": "风车镇",
            "end": "艾德拉斯军事基地",
            "line": "东方线"
        },

        // 二狗线
        {
            "start": "miaomiao故居",
            "end": "狗哥的家",
            "line": "二狗线"
        },
        {
            "start": "狗哥的家",
            "end": "miaomiao故居",
            "line": "二狗线"
        },

        // 发如雪线
        {
            "start": "风之镇",
            "end": "终南山",
            "line": "发如雪线"
        },
        {
            "start": "终南山",
            "end": "风之镇",
            "line": "发如雪线"
        },
        {
            "start": "终南山",
            "end": "魔瓶的家",
            "line": "发如雪线"
        },
        {
            "start": "魔瓶的家",
            "end": "终南山",
            "line": "发如雪线"
        },

        // 参宿线
        {
            "start": "KINDEL的家",
            "end": "tz的家",
            "line": "参宿线"
        },
        {
            "start": "tz的家",
            "end": "KINDEL的家",
            "line": "参宿线"
        },
        {
            "start": "tz的家",
            "end": "雪亭",
            "line": "参宿线"
        },
        {
            "start": "雪亭",
            "end": "tz的家",
            "line": "参宿线"
        },
        {
            "start": "雪亭",
            "end": "双子阁",
            "line": "参宿线"
        },
        {
            "start": "双子阁",
            "end": "雪亭",
            "line": "参宿线"
        },
        {
            "start": "双子阁",
            "end": "ij枢纽",
            "line": "参宿线"
        },
        {
            "start": "ij枢纽",
            "end": "双子阁",
            "line": "参宿线"
        },

        // 雪国线
        {
            "start": "春暖花开",
            "end": "寒意镇",
            "line": "雪国线"
        },
        {
            "start": "寒意镇",
            "end": "春暖花开",
            "line": "雪国线"
        },
        {
            "start": "寒意镇",
            "end": "黄老菊的家",
            "line": "雪国线"
        },
        {
            "start": "黄老菊的家",
            "end": "寒意镇",
            "line": "雪国线"
        },
        {
            "start": "黄老菊的家",
            "end": "七魂的家",
            "line": "雪国线"
        },
        {
            "start": "七魂的家",
            "end": "黄老菊的家",
            "line": "雪国线"
        },
        {
            "start": "七魂的家",
            "end": "新手村",
            "line": "雪国线"
        },
        {
            "start": "新手村",
            "end": "七魂的家",
            "line": "雪国线"
        },
        {
            "start": "新手村",
            "end": "天照遗址",
            "line": "雪国线"
        },
        {
            "start": "天照遗址",
            "end": "新手村",
            "line": "雪国线"
        },
        {
            "start": "天照遗址",
            "end": "冰船比赛活动场地",
            "line": "雪国线"
        },
        {
            "start": "冰船比赛活动场地",
            "end": "天照遗址",
            "line": "雪国线"
        },

        // 德意志线
        {
            "start": "黄老菊的家",
            "end": "楚格峰",
            "line": "德意志线"
        },
        {
            "start": "楚格峰",
            "end": "黄老菊的家",
            "line": "德意志线"
        },
        {
            "start": "楚格峰",
            "end": "柯尼斯堡",
            "line": "德意志线"
        },
        {
            "start": "柯尼斯堡",
            "end": "楚格峰",
            "line": "德意志线"
        },

        // 奥兹线
        {
            "start": "寒意镇",
            "end": "Meowth的家",
            "line": "奥兹线"
        },
        {
            "start": "Meowth的家",
            "end": "寒意镇",
            "line": "奥兹线"
        },

        // 新风线
        {
            "start": "沙漠枢纽",
            "end": "糖湖镇",
            "line": "新风线"
        },
        {
            "start": "糖湖镇",
            "end": "沙漠枢纽",
            "line": "新风线"
        },

        // 鱼塔线
        {
            "start": "河神枢纽",
            "end": "多拉鱼塔",
            "line": "鱼塔线"
        },
        {
            "start": "多拉鱼塔",
            "end": "河神枢纽",
            "line": "鱼塔线"
        },

        // 伊苏线
        {
            "start": "沙河枢纽",
            "end": "泽民",
            "line": "伊苏线"
        },
        {
            "start": "泽民",
            "end": "沙河枢纽",
            "line": "伊苏线"
        },
        {
            "start": "泽民",
            "end": "骨乐园",
            "line": "伊苏线"
        },
        {
            "start": "骨乐园",
            "end": "泽民",
            "line": "伊苏线"
        },
        {
            "start": "骨乐园",
            "end": "寺院化石博物馆",
            "line": "伊苏线"
        },
        {
            "start": "寺院化石博物馆",
            "end": "骨乐园",
            "line": "伊苏线"
        },
        {
            "start": "寺院化石博物馆",
            "end": "上海老江",
            "line": "伊苏线"
        },
        {
            "start": "上海老江",
            "end": "寺院化石博物馆",
            "line": "伊苏线"
        },
        {
            "start": "上海老江",
            "end": "地下城",
            "line": "伊苏线"
        },
        {
            "start": "地下城",
            "end": "上海老江",
            "line": "伊苏线"
        },
        {
            "start": "地下城",
            "end": "地下城北",
            "line": "伊苏线"
        },
        {
            "start": "地下城北",
            "end": "地下城",
            "line": "伊苏线"
        },
        {
            "start": "地下城",
            "end": "猫耳的家",
            "line": "伊苏线"
        },
        {
            "start": "猫耳的家",
            "end": "地下城",
            "line": "伊苏线"
        },
        {
            "start": "猫耳的家",
            "end": "猫村枢纽",
            "line": "伊苏线"
        },
        {
            "start": "猫村枢纽",
            "end": "猫耳的家",
            "line": "伊苏线"
        },
        {
            "start": "猫村枢纽",
            "end": "四方枢纽",
            "line": "伊苏线"
        },
        {
            "start": "四方枢纽",
            "end": "猫村枢纽",
            "line": "伊苏线"
        },
        {
            "start": "四方枢纽",
            "end": "照桥",
            "line": "伊苏线"
        },
        {
            "start": "照桥",
            "end": "四方枢纽",
            "line": "伊苏线"
        },

        // X专线
        {
            "start": "狼窝",
            "end": "象头岛",
            "line": "X专线"
        },
        {
            "start": "象头岛",
            "end": "狼窝",
            "line": "X专线"
        },

        // 比利线
        {
            "start": "多拉的家",
            "end": "北方村庄",
            "line": "比利线"
        },
        {
            "start": "北方村庄",
            "end": "多拉的家",
            "line": "比利线"
        },

        // 风光线
        {
            "start": "风之镇",
            "end": "羊驼小屋",
            "line": "风光线"
        },
        {
            "start": "羊驼小屋",
            "end": "风之镇",
            "line": "风光线"
        },
        {
            "start": "羊驼小屋",
            "end": "风之国塔",
            "line": "风光线"
        },
        {
            "start": "风之国塔",
            "end": "羊驼小屋",
            "line": "风光线"
        },
        {
            "start": "风之国塔",
            "end": "风之镇西",
            "line": "风光线"
        },
        {
            "start": "风之镇西",
            "end": "风之国塔",
            "line": "风光线"
        },
        {
            "start": "风之镇西",
            "end": "风之新镇北",
            "line": "风光线"
        },
        {
            "start": "风之新镇北",
            "end": "风之镇西",
            "line": "风光线"
        }, 

        // 血汗线
        {
            "start": "楚格峰",
            "end": "新手村",
            "line": "血汗线"
        },
        {
            "start": "新手村",
            "end": "楚格峰",
            "line": "血汗线"
        },

        // 吕梨线
        {
            "start": "共产主义大陆",
            "end": "瑜陵",
            "line": "吕梨线"
        }, {
            "start": "瑜陵",
            "end": "共产主义大陆",
            "line": "吕梨线"
        }, 

        // 波止线
        {
            "start": "提尼岛工业园",
            "end": "地下城北",
            "line": "波止线"
        },
        {
            "start": "地下城北",
            "end": "提尼岛工业园",
            "line": "波止线"
        },
        {
            "start": "上海老江",
            "end": "地下城北",
            "line": "波止线"
        },
        {
            "start": "地下城北",
            "end": "上海老江",
            "line": "波止线"
        },

        // K16线
        {
            "start": "共产主义大陆",
            "end": "四方枢纽",
            "line": "K16线"
        },
        {
            "start": "四方枢纽",
            "end": "共产主义大陆",
            "line": "K16线"
        },
        {
            "start": "四方枢纽",
            "end": "影山居",
            "line": "K16线"
        },
        {
            "start": "影山居",
            "end": "四方枢纽",
            "line": "K16线"
        },

        // K17线
        {
            "start": "运通枢纽",
            "end": "同妹在樱花下看麦田",
            "line": "K17线"
        },
        {
            "start": "同妹在樱花下看麦田",
            "end": "运通枢纽",
            "line": "K17线"
        },
        {
            "start": "同妹在樱花下看麦田",
            "end": "村下屋根",
            "line": "K17线"
        },
        {
            "start": "村下屋根",
            "end": "同妹在樱花下看麦田",
            "line": "K17线"
        },
        {
            "start": "村下屋根",
            "end": "风之新镇北",
            "line": "K17线"
        },
        {
            "start": "风之新镇北",
            "end": "村下屋根",
            "line": "K17线"
        }
    
    ]
}