var subData = {
    'stations': {
        //注释线下面的都是那条线上的地铁站
        //被注释的地铁站都是重复的

        //赞一线
        '城北枢纽': {
            'location': [-177, 40, -887]
        },
        '赞服国际机场': {
            'location': [
                [-173, 57, -430],
                [-200, 57, -431]
            ]
        },
        //出生点的4个点
        '出生点': {
            'location': [
                [-173, 57, 204],
                [-200, 57, 203],
                [-186, 49, 190],
                [-187, 49, 217]
            ]
        },
        '漆黑之翼': {
            'location': [-120, 40, 837]
        },
        //赞二线
        '未名阁': {
            'location': [-788, 40, 412]
        },
        '中央枢纽': {
            'location': [859, 40, 435]
        },
        '狼窝': {
            'location': [525, 40, 19]
        },

        //K1线
        //'妹控镇南': {'location': [-384, 39, -1985]},
        'applezhou家旧址': {
            'location': [329, 40, -1700]
        },
        //Noawas的家
        '雨的故事的家': {
            'location': [681, 40, -1300]
        },
        // xiximi的家
        '象头岛': {
            'location': [860, 20, 20]
        },
        //'中央枢纽' : { 'location' : [859,40,435]}, 
        'LSF的家': {
            'location': [859, 40, 1036]
        },
        '无人沙村': {
            'location': [859, 40, 1349]
        },
        '魔瓶的家': {
            'location': [859, 40, 1737]
        },
        '森林枢纽': {
            'location': [1080, 40, 1997]
        },
        '夏尔镇': {
            'location': [2282, 50, 1996]
        },

        //爱国线
        //'夏尔镇' : { 'location' : [2282,50,1996]}, 
        'ACE的家': {
            'location': [2280, 40, 2816]
        },
        '夏尔村民农场南': {
            'location': [2800, 40, 2816]
        },
        'slantyone的家': {
            'location': [3376, 40, 2816]
        },
        '晓枫故居': {
            'location': [3376, 40, 3962]
        },
        '苏瑕瑜的家': {
            'location': [3375, 40, 4180]
        },
        '错误岛': {
            'location': [3374, 40, 4600]
        },
        '寒月的家': {
            'location': [3374, 20, 5600]
        },

        //少女前线
        'applezhou的家': {
            'location': [2900, 40, 2599]
        },
        //'夏尔村民农场南' : { 'location' : [2880,40,2816]}, 
        '格里芬': {
            'location': [2800, 40, 3166]
        },

        //K2线
        'flam的家': {
            'location': [1549, 40, -900]
        },
        'xiximi的家': {
            'location': [691, 40, -890]
        },
        'KK的沙漠别墅': {
            'location': [206, 40, -751]
        },
        //'城北枢纽' : { 'location' : [-177,40,-887]}, 
        '彩虹半岛': {
            'location': [-410, 40, -889]
        },
        '彩虹镇洲际酒店': {
            'location': [-651, 40, -1018]
        },
        '彩虹镇': {
            'location': [-650, 40, -1177]
        },
        '三界枢纽': {
            'location': [-650, 40, -1985]
        },
        '妹控镇': {
            'location': [-385, 39, -2228]
        },
        'xiqiao的家': {
            'location': [-40, 40, -2229]
        },
        '寒月家旧址': {
            'location': [700, 40, -2229]
        },
        'ricky的家': {
            'location': [1550, 40, -2230]
        },

        //K3线
        '羊村': {
            'location': [943, 40, 834]
        },
        //'LSF的家' : { 'location' : [859,40,1036]}, 
        '土豆镇': {
            'location': [
                // 北站台，原土豆镇北
                [479, 40, 1160],
                // 南站台，原土豆镇西挪动
                [479, 40, 1350],
            ]
        },
        'Wintering_的家': {
            'location': [120, 40, 1174]
        },
        'FishWit的家': {
            'location': [-120, 40, 1175]
        },
        '尸冢': {
            'location': [-515, 40, 1174]
        },
        '白虎岭': {
            'location': [-671, 40, 1177]
        },
        '樱花乡': {
            'location': [-788, 40, 1175]
        },
        '樱花乡西': {
            'location': [-1030, 40, 1030]
        },

        //东方线
        //'中央枢纽' : { 'location' : [859,40,435]}, 
        '河神枢纽': {
            'location': [1305, 25, 436]
        },
        'miaomiao故居': {
            'location': [1919, 40, 160]
        },
        'lost的家': {
            'location': [1918, 40, -240]
        },
        'Byepast家旧址': {
            'location': [1920, 40, -375]
        },
        '福原枢纽': {
            'location': [1919, 40, -679]
        },
        'KK的安置房': {
            'location': [2050, 40, -681]
        },
        '猫音小村': {
            'location': [2350, 40, -681]
        },
        '艾德拉斯军事基地': {
            'location': [2351, 40, -1202]
        },
        '风车镇': {
            'location': [2322, 40, -1337]
        },

        //鱼塔线
        //'河神枢纽' : { 'location' : [1305,25,436]}, 
        '多拉鱼塔': {
            'location': [1306, 25, 314]
        },

        //二狗线
        //'miaomiao故居' : { 'location' : [1919,40,160]}, 
        '狗哥的家': {
            'location': [2315, 40, 140]
        },

        //K4线北段
        //'未名阁' : { 'location' : [-788,40,412]}, 
        '高地枢纽': {
            'location': [-1130, 40, 412]
        },
        '艾拉的家': {
            'location': [-1350, 40, 412]
        },
        '稻之乡南': {
            'location': [-2301, 40, 405]
        },

        //K4线南段
        //'漆黑之翼' : { 'location' : [-120,40,837]}, 
        //'FishWit的家' : { 'location' : [-120,40,1175]}, 
        'Xiao_Yun的家': {
            'location': [1, 40, 1349]
        },
        '终南山': {
            'location': [0, 40, 1737]
        },
        'KINDEL的家': {
            'location': [-92, 40, 2570]
        },
        '雪亭': {
            'location': [-92, 40, 3020]
        },
        'ij枢纽': {
            'location': [-11, 20, 3878]
        },
        'XS枢纽': {
            'location': [-10, 20, 4500]
        },
        '猫耳的家': {
            'location': [267, 40, 5301]
        },

        //K5线
        //'未名阁' : { 'location' : [-788,40,412]}, 
        '七魂家旧址': {
            'location': [-788, 40, 890]
        },
        '盘丝洞': {
            'location': [-785, 40, 1089]
        },
        //'樱花乡' : { 'location' : [-788,40,1175]}, 
        '风之镇': {
            'location': [-788, 40, 1737]
        },
        'lsy的家': {
            'location': [-862, 60, 1726]
        },
        '风之镇西': {
            'location': [-1256, 56, 1863]
        },
        '沙漠枢纽': {
            'location': [-1245, 74, 2792]
        },
        'tz的家': {
            'location': [-236, 40, 2791]
        },
        '咸鱼': {
            'location': [-38, 40, 2886]
        },
        '双子阁': {
            'location': [106, 40, 3203]
        },

        //发如雪线
        //'风之镇' : { 'location' : [-788,40,1737]}, 
        //'终南山' : { 'location' : [0,40,1737]}, 
        //'魔瓶的家' : { 'location' : [859,40,1737]}, 

        //新风线
        //'沙漠枢纽' : { 'location' : [-1245,74,2792]}, 
        '糖湖镇': {
            'location': [-1258, 69, 3354]
        },

        //参宿线
        //'稻之乡南' : { 'location' : [-2301,40,405]}, 
        //'tz的家' : { 'location' : [-236,40,2791]}, 
        //'雪亭' : { 'location' : [-92,40,3020]}, 
        //'双子阁' : { 'location' : [106,40,3203]}, 
        //'ij枢纽' : { 'location' : [-11,20,3878]}, 

        //K6线
        //'樱花乡西' : { 'location' : [-1030,40,1030]}, 
        'ranfei的家': {
            'location': [-1129, 40, 585]
        },
        //'高地枢纽' : { 'location' : [-1130,40,412]}, 
        '老郭故居': {
            'location': [-1130, 40, -220]
        },
        '大裤衩': {
            'location': [-1130, 40, -400]
        },
        '肥宅乐园': {
            'location': [-1129, 40, -817]
        },
        'ZERO的家': {
            'location': [-1046, 40, -1177]
        },
        'Meowth的家': {
            'location': [-1045, 40, -1985]
        },
        //'三界枢纽' : { 'location' : [-650,40,-1985]}, 
        '妹控镇南': {
            'location': [-384, 39, -1985]
        },
        '妹控客栈': {
            'location': [-405, 39, -2064]
        },
        //'妹控镇' : { 'location' : [-385,39,-2228]}, 
        '螃蟹岛灯塔': {
            'location': [-253, 20, -2730]
        },
        '春暖花开': {
            'location': [-385, 20, -2841]
        },
        '卫岛': {
            'location': [-578, 20, -3121]
        },

        //雪国线
        //'春暖花开' : { 'location' : [-385,20,-2841]}, 
        '寒意镇': {
            'location': [-1045, 40, -2840]
        },
        '黄老菊的家': {
            'location': [-1840, 40, -2840]
        },
        '七魂的家': {
            'location': [-2810, 40, -2839]
        },

        //德意志线
        //'黄老菊的家' : { 'location' : [-1840,40,-2840]}, 
        '楚格峰': {
            'location': [-1839, 40, -4501]
        },
        '柯尼斯堡': {
            'location': [-1841, 40, -4827]
        },

        //奥兹线
        //'寒意镇' : { 'location' : [-1045,40,-2840]}, 
        //'Meowth的家' : { 'location' : [-1045,40,-1985]}, 

        //K7线
        //'漆黑之翼' : { 'location' : [-120,40,837]}, 
        '天守阁': {
            'location': [-560, 40, 890]
        },
        //'七魂家旧址' : { 'location' : [-788,40,890]}, 
        //'樱花乡西' : { 'location' : [-1030,40,1030]}, 

        //K8线
        //'ZERO的家' : { 'location' : [-1046,40,-1177]}, 
        //'彩虹镇' : { 'location' : [-650,40,-1177]}, 
        '_qUUp_的家': {
            'location': [-35, 40, -1178]
        },
        'Noawas的家': {
            'location': [
                [330, 40, -1178],

                // 北站台，对接applezhou家和雨的故事的家
                [330, 40, -1301]
            ]
        },
        '方台': {
            'location': [810, 40, -1090]
        },
        'x_xGe海灯塔': {
            'location': [1549, 40, -1090]
        },

        //M1线
        //'福原枢纽' : { 'location' : [1919,40,-679]}, 
        '赞服苏维埃根据地': {
            'location': [1770, 40, -679]
        },
        //'flam的家' : { 'location' : [1549,40,-900]}, 
        //'x_xGe海灯塔' : { 'location' : [1549,40,-1090]}, 
        '末影镇': {
            'location': [1549, 40, -1610]
        },
        //'ricky的家' : { 'location' : [1550,40,-2230]}, 
        '红牛岛': {
            'location': [2000, 40, -3071]
        },
        'SCP驻赞服办事处': {
            'location': [3454, 47, -3650]
        },

        //K9线
        //'森林枢纽' : { 'location' : [1080,40,1997]}, 
        '富饶港': {
            'location': [1074, 40, 2700]
        },
        '沙河枢纽': {
            'location': [1080, 40, 3202]
        },
        '咸鱼东': {
            'location': [400, 40, 3203]
        },
        //'双子阁' : { 'location' : [106,40,3203]}, 

        //伊苏线
        //'沙河枢纽' : { 'location' : [1080,40,3202]}, 
        '泽民': {
            'location': [1205, 40, 3410]
        },
        '骨乐园': {
            'location': [1205, 40, 3690]
        },
        '寺院化石博物馆': {
            'location': [1206, 40, 4190]
        },
        '上海老江': {
            'location': [1207, 40, 4489]
        },
        '地下城' : {
            'location': [917, 40, 4737]
        },
        //'地下城北': {'location': [917, 40, 4499]},

        //K10线
        //'老郭故居' : { 'location' : [-1130,40,-220]}, 
        '秋山的家': {
            'location': [-1950, 40, -221]
        },
        '光明镇': {
            'location': [-2150, 40, -130]
        },
        '稻之乡': {
            'location': [-2299, 40, 160]
        },
        //'稻之乡南' : { 'location' : [-2301,40,405]}, 
        '浮离': {
            'location': [-3100, 40, 499]
        },
        '蜀汉国界': {
            'location': [-3901, 40, 1350]
        },

        //K11线
        //'七魂的家' : { 'location' : [-2810,40,-2839]}, 
        '作案哥的家': {
            'location': [-2809, 40, -1985]
        },

        //K12线
        //'作案哥的家' : { 'location' : [-2809,40,-1985]}, 
        //'Meowth的家' : { 'location' : [-1045,40,-1985]}, 

        //K13线
        //'Xiao_Yun的家' : { 'location' : [1,40,1349]}, 
        '荔宫': {
            'location': [160, 40, 1350]
        },
        //'土豆镇': {'location': [[479, 40, 1160],[479, 40, 1350],]},
        //'无人沙村' : { 'location' : [859,40,1349]},

        //K14线
        //'艾拉的家' : { 'location' : [-1350,40,412]}, 
        'gaffey的家': {
            'location': [-1349, 40, 120]
        },
        '海中粟': {
            'location': [-1871, 20, 128]
        },
        //'稻之乡': {
        //    'location': [-2299, 40, 160]
        //},

        //K15线
        //'咸鱼东' : { 'location' : [400,40,3203]}, 
        '96Ko的家': {
            'location': [399, 40, 3340]
        },
        '提尼岛北': {
            'location': [401, 20, 4000]
        },
        '提尼岛工业园': {
            'location': [400, 20, 4499]
        },
        //'XS枢纽' : { 'location' : [-10,20,4500]},
        '共产主义大陆': {
            'location': [-945, 40, 4329]
        },
        '瑜陵': {
            'location': [
                [-1257, 20, 4329],
                [-1257, 72, 4329]
            ]
        },
        //'糖湖镇': {'location': [-1258, 69, 3354]},

        //比利线
        '多拉的家': {
            'location': [654, 71, -2149]
        },
        '北方村庄': {
            'location': [556, 66, -1733]
        },

        //波止线
        //'提尼岛工业园': {'location': [400, 20, 4499]},
        '地下城北': {
            'location': [917, 40, 4499]
        },
        //'上海老江': {'location': [1207, 40, 4489]},

        //风光线
        //'风之镇': {'location': [-788, 40, 1737]},
        '羊驼小屋': {
            'location': [-849, 93, 1866]
        },
        '风之国塔': {
            'location': [-1104, 96,1860]
        },
        //'风之镇西': {'location': [-1256, 56, 1863]},

        //血汗线
        '楚格峰': {
            'location': [-1839, 40, -4501]
        },
        '新手村': {
            'location': [-3987, 40, -4502]
        },

        //X专线
        '狼窝': {
            'location': [525, 40, 19]
        },
        '象头岛': {
            'location': [860, 20, 20]
        },

        //吕梨线
        //'共产主义大陆': {'location': [-945, 40, 4329]},
        //'瑜陵': {'location': [[-1257, 20, 4329],[-1257, 72, 4329]]},
    },
    'lines': {
        '赞一线': {
            "color": "#FF0000",
            "stations": ['城北枢纽', '赞服国际机场', '出生点', '漆黑之翼']
        },
        '赞二线': {
            "color": "#000066",
            "stations": ['未名阁', '出生点', '中央枢纽']
        },
        'K1线': {
            "color": "#3399CC",
            "stations": ['妹控镇南', 'applezhou家旧址', 'Noawas的家', '雨的故事的家', 'xiximi的家', '象头岛', '中央枢纽', 'LSF的家', '无人沙村', '魔瓶的家', '森林枢纽', '夏尔镇']
        },
        'K2线': {
            "color": "#999999",
            "stations": ['flam的家', 'xiximi的家', 'KK的沙漠别墅', '城北枢纽', '彩虹半岛', '彩虹镇洲际酒店', '彩虹镇', '三界枢纽', '妹控镇', 'xiqiao的家', '寒月家旧址', 'ricky的家']
        },
        'K3线': {
            "color": "#996600",
            "stations": ['羊村', 'LSF的家', '土豆镇', 'Wintering_的家', 'FishWit的家', '尸冢', '白虎岭', '樱花乡', '樱花乡西']
        },
        'K4线北段': {
            "color": "#CC6699",
            "stations": ['未名阁', '高地枢纽', '艾拉的家', '稻之乡南']
        },
        'K4线南段': {
            "color": "#CC6699",
            "stations": ['漆黑之翼', 'FishWit的家', 'Xiao_Yun的家', '终南山', 'KINDEL的家', '雪亭', 'ij枢纽', 'XS枢纽', '猫耳的家']
        },
        'K5线': {
            "color": "#99CCFF",
            "stations": ['未名阁', '七魂家旧址', '盘丝洞', '樱花乡', '风之镇', 'lsy的家', '风之镇西', '沙漠枢纽', 'tz的家', '咸鱼', '双子阁']
        },
        'K6线': {
            "color": "#FF9999",
            "stations": ['樱花乡西', 'ranfei的家', '高地枢纽', '老郭故居', '大裤衩', '肥宅乐园', 'ZERO的家', 'Meowth的家', '三界枢纽', '妹控镇南', '妹控客栈', '妹控镇', '螃蟹岛灯塔', '春暖花开', '卫岛']
        },
        'K7线': {
            "color": "#FF6633",
            "stations": ['漆黑之翼', '天守阁', '七魂家旧址', '樱花乡西']
        },
        'K8线': {
            "color": "#99CCCC",
            "stations": ['ZERO的家', '彩虹镇', '_qUUp_的家', 'Noawas的家', '方台', 'x_xGe海灯塔']
        },
        'K9线': {
            "color": "#CC9999",
            "stations": ['森林枢纽', '富饶港', '沙河枢纽', '咸鱼东', '双子阁']
        },
        'K10线': {
            "color": "#33CC66",
            "stations": ['老郭故居', '秋山的家', '光明镇', '稻之乡', '稻之乡南', '浮离', '蜀汉国界']
        },
        'K11线': {
            "color": "#CC6600",
            "stations": ['七魂的家', '作案哥的家']
        },
        'K12线': {
            "color": "#FF3399",
            "stations": ['作案哥的家', 'Meowth的家']
        },
        'K13线': {
            "color": "#339999",
            "stations": ['Xiao_Yun的家', '荔宫', '土豆镇', '无人沙村']
        },
        'K14线': {
            "color": "#990000",
            "stations": ['艾拉的家', 'gaffey的家','海中粟', '稻之乡']
        },
        'K15线': {
            "color": "#003366",
            "stations": ['咸鱼东', '96Ko的家', '提尼岛北', '提尼岛工业园', 'XS枢纽', '共产主义大陆', '瑜陵', '糖湖镇']
        },
        'M1线': {
            "color": "#3399FF",
            "stations": ['福原枢纽', '赞服苏维埃根据地', 'flam的家', 'x_xGe海灯塔', '末影镇', 'ricky的家', '红牛岛', 'SCP驻赞服办事处']
        },
        '爱国线': {
            "color": "#66CCCC",
            "stations": ['夏尔镇', 'ACE的家', '夏尔村民农场南', 'slantyone的家', '晓枫故居', '苏瑕瑜的家', '错误岛', '寒月的家']
        },
        '少女前线': {
            "color": "#FFCCFF",
            "stations": ['applezhou的家', '夏尔村民农场南', '格里芬']
        },
        '东方线': {
            "color": "#CC00FF",
            "stations": ['中央枢纽', '河神枢纽', 'miaomiao故居', 'lost的家', 'Byepast家旧址', '福原枢纽', 'KK的安置房', '猫音小村', '艾德拉斯军事基地', '风车镇']
        },
        '二狗线': {
            "color": "#9999CC",
            "stations": ['miaomiao故居', '狗哥的家']
        },
        '发如雪线': {
            "color": "#99FF33",
            "stations": ['风之镇', '终南山', '魔瓶的家']
        },
        '参宿线': {
            "color": "#0099CC",
            "stations": ['KINDEL的家', 'tz的家', '雪亭', '双子阁', 'ij枢纽']
        },
        '雪国线': {
            "color": "#CCCCCC",
            "stations": ['春暖花开', '寒意镇', '黄老菊的家', '七魂的家', '新手村']
        },
        '德意志线': {
            "color": "#FF9900",
            "stations": ['黄老菊的家', '楚格峰', '柯尼斯堡']
        },
        '奥兹线': {
            "color": "#FFCC00",
            "stations": ['寒意镇', 'Meowth的家']
        },
        '新风线': {
            "color": "#FF0099",
            "stations": ['沙漠枢纽', '糖湖镇']
        },
        '鱼塔线': {
            "color": "#FF00FF",
            "stations": ['河神枢纽', '多拉鱼塔']
        },
        '伊苏线': {
            "color": "#0066CC",
            "stations": ['沙河枢纽', '泽民', '骨乐园', '寺院化石博物馆', '上海老江','地下城', '地下城北']
        },
        'X专线': {
            "color": "#336699",
            "stations": ['狼窝', '象头岛']
        },
        '比利线': {
            "color": "#003399",
            "stations": ['多拉的家', '北方村庄']
        },
        '风光线': {
            "color": "#339900",
            "stations": ['风之镇', '羊驼小屋', '风之国塔', '风之镇西']
        },
        '血汗线': {
            "color": "#CCFFFF",
            "stations": ['楚格峰', '新手村']
        },
        '吕梨线': {
            "color": "#996699",
            "stations": ['共产主义大陆', '瑜陵']
        },
        '波止线': {
            "color": "#66CCFF",
            "stations": ['提尼岛工业园', '地下城北', '上海老江']
        },

    },
    'paths': [
        //只记录坐标
        // ['起点站', '终点站', [（如果是多站台，留空就是默认(0,0)）起点站的站台号（从0开始）,终点站的站台号（从0开始）]]
        // 赞一线
        ['城北枢纽', '赞服国际机场', [0,1]],
        ['赞服国际机场', '城北枢纽', [0,0]],

        ['赞服国际机场', '出生点', [1,1]],
        ['出生点', '赞服国际机场', [0,0]],

        ['出生点', '漆黑之翼', [1,0]],
        ['漆黑之翼', '出生点', [0,0]],

        // 赞二线
        ['未名阁', '出生点', [0, 3]],
        ['出生点', '未名阁', [2, 0]],

        ['出生点', '中央枢纽', [3,0]],
        ['中央枢纽', '出生点', [0,2]],

        // K1线
        ['妹控镇南', 'applezhou家旧址'],
        ['applezhou家旧址', '妹控镇南'],

        ['applezhou家旧址', 'Noawas的家', [0, 1]],
        ['Noawas的家', 'applezhou家旧址', [0, 0]], //这里距离按照南站台出发算

        ['Noawas的家', '雨的故事的家'],
        ['雨的故事的家', 'Noawas的家', [0, 1]],//这里距离按照南站台出发算

        ['雨的故事的家', 'xiximi的家'],
        ['xiximi的家', '雨的故事的家'],

        ['xiximi的家', '象头岛'],
        ['象头岛', 'xiximi的家'],

        ['象头岛', '中央枢纽'],
        ['中央枢纽', '象头岛'],

        ['中央枢纽', 'LSF的家'],
        ['LSF的家', '中央枢纽'],

        ['LSF的家', '无人沙村'],
        ['无人沙村', 'LSF的家'],

        ['无人沙村', '魔瓶的家'],
        ['魔瓶的家', '无人沙村'],

        ['魔瓶的家', '森林枢纽'],
        ['森林枢纽', '魔瓶的家'],

        ['森林枢纽', '夏尔镇'],
        ['夏尔镇', '森林枢纽'],

        // K2线
        ['flam的家', 'xiximi的家'],
        ['xiximi的家', 'flam的家'],

        ['xiximi的家', 'KK的沙漠别墅'],
        ['KK的沙漠别墅', 'xiximi的家'],

        ['KK的沙漠别墅', '城北枢纽'],
        ['城北枢纽', 'KK的沙漠别墅'],

        ['城北枢纽', '彩虹半岛'],
        ['彩虹半岛', '城北枢纽'],

        ['彩虹半岛', '彩虹镇'],
        ['彩虹镇', '彩虹半岛'],

        // ---- 彩虹镇洲际酒店支线
        ['彩虹镇', '彩虹镇洲际酒店'],
        ['彩虹镇洲际酒店', '彩虹镇'],
        ['彩虹镇洲际酒店', '彩虹半岛'],
        // ---- 彩虹镇洲际酒店支线

        ['彩虹镇', '三界枢纽'],
        ['三界枢纽', '彩虹镇'],

        ['三界枢纽', '妹控镇'],
        ['妹控镇', '三界枢纽'],

        ['妹控镇', 'xiqiao的家'],
        ['xiqiao的家', '妹控镇'],

        ['xiqiao的家', '寒月家旧址'],
        ['寒月家旧址', 'xiqiao的家'],

        ['寒月家旧址', 'ricky的家'],
        ['ricky的家', '寒月家旧址'],

        // K3线
        ['羊村', 'LSF的家'],
        ['LSF的家', '羊村'],

        ['LSF的家', '土豆镇', [0, 0]],
        ['土豆镇', 'LSF的家', [1, 0]], //按照远的算

        ['土豆镇', 'Wintering_的家', [1,0]],//按照远的算
        ['Wintering_的家', '土豆镇', [0,0]],

        ['Wintering_的家', 'FishWit的家'],
        ['FishWit的家', 'Wintering_的家'],

        ['FishWit的家', '尸冢'],
        ['尸冢', 'FishWit的家'],

        ['尸冢', '樱花乡'],
        ['樱花乡', '尸冢'],

        // ---- 白虎岭支线
        ['白虎岭', '尸冢'],
        ['白虎岭', '樱花乡'],
        ['樱花乡', '白虎岭'],
        // ---- 白虎岭支线

        ['樱花乡', '樱花乡西'],
        ['樱花乡西', '樱花乡'],

        // K4线北段
        ['未名阁', '高地枢纽'],
        ['高地枢纽', '未名阁'],

        ['高地枢纽', '艾拉的家'],
        ['艾拉的家', '高地枢纽'],

        ['艾拉的家', '稻之乡南'],
        ['稻之乡南', '艾拉的家'],

        // K4线南段
        ['漆黑之翼', 'FishWit的家'],
        ['FishWit的家', '漆黑之翼'],

        ['FishWit的家', 'Xiao_Yun的家'],
        ['Xiao_Yun的家', 'FishWit的家'],

        ['Xiao_Yun的家', '终南山'],
        ['终南山', 'Xiao_Yun的家'],

        ['终南山', 'KINDEL的家'],
        ['KINDEL的家', '终南山'],

        ['KINDEL的家', '雪亭'],
        ['雪亭', 'KINDEL的家'],

        ['雪亭', 'ij枢纽'],
        ['ij枢纽', '雪亭'],

        ['ij枢纽', 'XS枢纽'],
        ['XS枢纽', 'ij枢纽'],

        ['XS枢纽', '猫耳的家'],
        ['猫耳的家', 'XS枢纽'],

        // K5线
        ['未名阁', '七魂家旧址'],
        ['七魂家旧址', '未名阁'],

        ['七魂家旧址', '樱花乡'],
        ['樱花乡', '七魂家旧址'],

        // ---- 盘丝洞支线
        ['盘丝洞', '樱花乡'],
        ['樱花乡', '盘丝洞'],
        ['盘丝洞', '七魂家旧址'],
        // ---- 盘丝洞支线

        ['樱花乡', '风之镇'],
        ['风之镇', '樱花乡'],

        // ----lsy的家支线
        ['风之镇', 'lsy的家'],
        ['lsy的家', '风之镇'],
        // ----lsy的家支线

        ['风之镇', '风之镇西'],
        ['风之镇西', '风之镇'],

        ['风之镇西', '沙漠枢纽'],
        ['沙漠枢纽', '风之镇西'],

        ['沙漠枢纽', 'tz的家'],
        ['tz的家', '沙漠枢纽'],

        ['tz的家', '咸鱼'],
        ['咸鱼', 'tz的家'],

        ['双子阁', '咸鱼'],
        ['咸鱼', '双子阁'],

        // K6线
        ['樱花乡西', 'ranfei的家'],
        ['ranfei的家', '樱花乡西'],

        ['ranfei的家', '高地枢纽'],
        ['高地枢纽', 'ranfei的家'],

        ['高地枢纽', '老郭故居'],
        ['老郭故居', '高地枢纽'],

        ['老郭故居', '大裤衩'],
        ['大裤衩', '老郭故居'],

        ['大裤衩', '肥宅乐园'],
        ['肥宅乐园', '大裤衩'],

        ['肥宅乐园', 'ZERO的家'],
        ['ZERO的家', '肥宅乐园'],

        ['ZERO的家', 'Meowth的家'],
        ['Meowth的家', 'ZERO的家'],

        ['Meowth的家', '三界枢纽'],
        ['三界枢纽', 'Meowth的家'],

        ['三界枢纽', '妹控镇南'],
        ['妹控镇南', '三界枢纽'],

        ['妹控镇南', '妹控客栈'],
        ['妹控客栈', '妹控镇南'],

        ['妹控镇南', '妹控镇'],
        ['妹控镇', '妹控镇南'],

        // ---- 螃蟹岛灯塔支线
        ['妹控镇', '螃蟹岛灯塔'],
        ['螃蟹岛灯塔', '妹控镇'],
        ['螃蟹岛灯塔', '春暖花开'],
        ['春暖花开', '螃蟹岛灯塔'],

        // ---- 螃蟹岛灯塔支线

        ['妹控镇', '春暖花开'],
        ['春暖花开', '妹控镇'],

        ['春暖花开', '卫岛'],
        ['卫岛', '春暖花开'],

        // K7线
        ['漆黑之翼', '天守阁'],
        ['天守阁', '漆黑之翼'],

        ['天守阁', '七魂家旧址'],
        ['七魂家旧址', '天守阁'],

        ['七魂家旧址', '樱花乡西'],
        ['樱花乡西', '七魂家旧址'],

        // K8线
        ['ZERO的家', '彩虹镇'],
        ['彩虹镇', 'ZERO的家'],

        ['彩虹镇', '_qUUp_的家'],
        ['_qUUp_的家', '彩虹镇'],

        ['_qUUp_的家', 'Noawas的家'],
        ['Noawas的家', '_qUUp_的家'],

        ['Noawas的家', '方台'],
        ['方台', 'Noawas的家'],

        ['方台', 'x_xGe海灯塔'],
        ['x_xGe海灯塔', '方台'],

        // K9线
        ['森林枢纽', '富饶港'],
        ['富饶港', '森林枢纽'],

        ['富饶港', '沙河枢纽'],
        ['沙河枢纽', '富饶港'],

        ['沙河枢纽', '咸鱼东'],
        ['咸鱼东', '沙河枢纽'],

        ['咸鱼东', '双子阁'],
        ['双子阁', '咸鱼东'],

        // K10线
        ['老郭故居', '秋山的家'],
        ['秋山的家', '老郭故居'],

        ['秋山的家', '光明镇'],
        ['光明镇', '秋山的家'],

        ['光明镇', '稻之乡'],
        ['稻之乡', '光明镇'],

        ['稻之乡', '稻之乡南'],
        ['稻之乡南', '稻之乡'],

        ['稻之乡南', '浮离'],
        ['浮离', '稻之乡南'],

        ['浮离', '蜀汉国界'],
        ['蜀汉国界', '浮离'],

        // K11线
        ['七魂的家', '作案哥的家'],
        ['作案哥的家', '七魂的家'],

        // K12线
        ['作案哥的家', 'Meowth的家'],
        ['Meowth的家', '作案哥的家'],

        // K13线
        ['Xiao_Yun的家', '荔宫'],
        ['荔宫', 'Xiao_Yun的家'],

        ['荔宫', '土豆镇', [0, 1]],
        ['土豆镇', '荔宫', [0, 0]],//按照远的算

        ['土豆镇', '无人沙村', [0, 0]],//按照远的算
        ['无人沙村', '土豆镇', [0, 1]],

        // K14线
        ['艾拉的家', 'gaffey的家'],
        ['gaffey的家', '艾拉的家'],

        ['gaffey的家', '海中粟'],
        ['海中粟', 'gaffey的家'],

        ['海中粟', '稻之乡'],
        ['稻之乡', '海中粟'],

        // K15线
        ['咸鱼东', '96Ko的家'],
        ['96Ko的家', '咸鱼东'],

        ['96Ko的家', '提尼岛北'],
        ['提尼岛北', '96Ko的家'],

        ['提尼岛北', '提尼岛工业园'],
        ['提尼岛工业园', '提尼岛北'],

        ['提尼岛工业园', 'XS枢纽'],
        ['XS枢纽', '提尼岛工业园'],

        ['XS枢纽', '共产主义大陆'],
        ['共产主义大陆', 'XS枢纽'],

        ['共产主义大陆', '瑜陵'],
        ['瑜陵', '共产主义大陆'],

        ['瑜陵', '糖湖镇'],
        ['糖湖镇', '瑜陵'],

        ['共产主义大陆', '瑜陵'],
        ['瑜陵', '共产主义大陆'],


        // M1线
        ['福原枢纽', '赞服苏维埃根据地'],
        ['赞服苏维埃根据地', '福原枢纽'],

        ['赞服苏维埃根据地', 'flam的家'],
        ['flam的家', '赞服苏维埃根据地'],

        ['flam的家', 'x_xGe海灯塔'],
        ['x_xGe海灯塔', 'flam的家'],

        ['x_xGe海灯塔', '末影镇'],
        ['末影镇', 'x_xGe海灯塔'],

        ['末影镇', 'ricky的家'],
        ['ricky的家', '末影镇'],

        ['ricky的家', '红牛岛'],
        ['红牛岛', 'ricky的家'],

        ['红牛岛', 'SCP驻赞服办事处'],
        ['SCP驻赞服办事处', '红牛岛'],

        // 爱国线
        ['夏尔镇', 'ACE的家'],
        ['ACE的家', '夏尔镇'],

        ['ACE的家', '夏尔村民农场南'],
        ['夏尔村民农场南', 'ACE的家'],

        ['夏尔村民农场南', 'slantyone的家'],
        ['slantyone的家', '夏尔村民农场南'],

        ['slantyone的家', '晓枫故居'],
        ['晓枫故居', 'slantyone的家'],

        ['晓枫故居', '苏瑕瑜的家'],
        ['苏瑕瑜的家', '晓枫故居'],

        ['苏瑕瑜的家', '错误岛'],
        ['错误岛', '苏瑕瑜的家'],

        ['错误岛', '寒月的家'],
        ['寒月的家', '错误岛'],

        // 少女前线
        ['applezhou的家', '夏尔村民农场南'],
        ['夏尔村民农场南', 'applezhou的家'],

        ['夏尔村民农场南', '格里芬'],
        ['格里芬', '夏尔村民农场南'],

        // 东方线
        ['中央枢纽', '河神枢纽'],
        ['河神枢纽', '中央枢纽'],

        ['河神枢纽', 'miaomiao故居'],
        ['miaomiao故居', '河神枢纽'],

        ['miaomiao故居', 'lost的家'],
        ['lost的家', 'miaomiao故居'],

        ['lost的家', 'Byepast家旧址'],
        ['Byepast家旧址', 'lost的家'],

        ['Byepast家旧址', '福原枢纽'],
        ['福原枢纽', 'Byepast家旧址'],

        ['福原枢纽', 'KK的安置房'],
        ['KK的安置房', '福原枢纽'],

        ['KK的安置房', '猫音小村'],
        ['猫音小村', 'KK的安置房'],

        ['猫音小村', '艾德拉斯军事基地'],
        ['艾德拉斯军事基地', '猫音小村'],

        ['艾德拉斯军事基地', '风车镇'],
        ['风车镇', '艾德拉斯军事基地'],

        // 二狗线
        ['miaomiao故居', '狗哥的家'],
        ['狗哥的家', 'miaomiao故居'],

        // 发如雪线
        ['风之镇', '终南山'],
        ['终南山', '风之镇'],

        ['终南山', '魔瓶的家'],
        ['魔瓶的家', '终南山'],

        // 参宿线
        ['KINDEL的家', 'tz的家'],
        ['tz的家', 'KINDEL的家'],

        ['tz的家', '雪亭'],
        ['雪亭', 'tz的家'],

        ['雪亭', '双子阁'],
        ['双子阁', '雪亭'],

        ['双子阁', 'ij枢纽'],
        ['ij枢纽', '双子阁'],

        // 雪国线
        ['春暖花开', '寒意镇'],
        ['寒意镇', '春暖花开'],

        ['寒意镇', '黄老菊的家'],
        ['黄老菊的家', '寒意镇'],

        ['黄老菊的家', '七魂的家'],
        ['七魂的家', '黄老菊的家'],
        
        ['七魂的家', '新手村'],
        ['新手村', '七魂的家'],

        // 德意志线
        ['黄老菊的家', '楚格峰'],
        ['楚格峰', '黄老菊的家'],

        ['楚格峰', '柯尼斯堡'],
        ['柯尼斯堡', '楚格峰'],

        // 奥兹线
        ['寒意镇', 'Meowth的家'],
        ['Meowth的家', '寒意镇'],

        // 新风线
        ['沙漠枢纽', '糖湖镇'],
        ['糖湖镇', '沙漠枢纽'],

        // 鱼塔线
        ['河神枢纽', '多拉鱼塔'],
        ['多拉鱼塔', '河神枢纽'],

        // 伊苏线
        ['沙河枢纽', '泽民'],
        ['泽民', '沙河枢纽'],

        ['泽民', '骨乐园'],
        ['骨乐园', '泽民'],

        ['骨乐园', '寺院化石博物馆'],
        ['寺院化石博物馆', '骨乐园'],

        ['寺院化石博物馆', '上海老江'],
        ['上海老江', '寺院化石博物馆'],

        ['上海老江', '地下城'],
        ['地下城', '上海老江'],

        ['地下城', '地下城北'],
        ['地下城北', '地下城'],

        // X专线
        ['狼窝', '象头岛'],
        ['象头岛', '狼窝'],

        // 比利线
        ['多拉的家', '北方村庄'],
        ['北方村庄', '多拉的家'],

        //风光线
        ['风之镇', '羊驼小屋'],
        ['羊驼小屋', '风之镇'],

        ['羊驼小屋', '风之国塔'],
        ['风之国塔', '羊驼小屋'],

        ['风之国塔', '风之镇西'],
        ['风之镇西', '风之国塔'],
      
        //血汗线
        ['楚格峰', '新手村'],
        ['新手村', '楚格峰'],

        //吕梨线
        ['共产主义大陆', '瑜陵'],
        ['瑜陵', '共产主义大陆'],

        // 波止线
        ['提尼岛工业园', '地下城北'],
        ['地下城北', '提尼岛工业园'],

        ['上海老江', '地下城北'],
        ['地下城北', '上海老江']

    ]
}
