var subData = {
    'stations': {
        /* 注释线下面的都是那条线上的地铁站
        //被注释的地铁站都是重复的*/

        //一号线
        // 赞铁一局博物馆
        '赞服国际机场': {
            'location': [
                [-173, 57, -430],
                [-200, 57, -431]
            ]
        },
        //出生点的4个点
        '出生点': {
            'location': [
                [-173, 57, 204],
                [-200, 57, 203],
                [-186, 49, 190],
                [-187, 49, 217]
            ]
        },
        'Niko的家': {
            'location': [-120, 40, 837]
        },

        //二号线
        // 归墟东
        // 出生点
        '中央枢纽': {
            'location': [858, 20, 204]
        },

        //K1线
        // 妹控镇南
        'applezhou家旧址': {
            'location': [329, 40, -1700]
        },
        // 星海湾
        '星海山顶洞': {
            "location": [455, 40, -1297],
            'img': 'station_xinghaishandingdong.jpg',
            'description': 'LZXOR创建的星海山顶洞'
        },
        '雨的故事的家': {
            'location': [681, 40, -1300]
        },
        '方台': {
            'location': [810, 40, -1090]
        },
        // 中央枢纽
        'LSF的家': {
            'location': [859, 40, 1036]
        },
        '无人沙村': {
            'location': [859, 40, 1349]
        },
        '魔瓶的家': {
            'location': [859, 40, 1737]
        },
        '森林枢纽': {
            'location': [1080, 40, 1997]
        },
        '未终': {
            'location': [1547, 40, 1997]
        },
        '夏尔镇': {
            'location': [2282, 50, 1996]
        },

        //爱国线
        // 夏尔镇
        'ACE的家': {
            'location': [2280, 40, 2816]
        },
        '夏尔村民农场南': {
            'location': [2800, 40, 2816]
        },
        'slantyone的家': {
            'location': [3376, 40, 2816]
        },
        '上弦半岛': {
            'location': [3376, 40, 3962]
        },
        '瑜庭': {
            'location': [3375, 40, 4180]
        },
        '错误岛': {
            'location': [3374, 40, 4600]
        },
        '寒月的家': {
            'location': [3374, 20, 5600]
        },
        '_qUUp_的家': {
            'location': [2680, 40, 6001]
        },

        //少女前线
        // 夏尔村民农场南
        '格里芬': {
            'location': [2801, 40, 3165]
        },

        //K2线
        'flam的家': {
            'location': [1549, 40, -900]
        },
        '彩虹半岛': {
            'location': [-410, 40, -889],
            'description': '彩虹镇东南沿海的半岛。',
            'img': 'station_caihongbandao.jpg'
        },
        '彩虹镇洲际酒店': {
            'location': [-651, 40, -1018],
            'description': '又大又长的酒店，住在里面很舒适。',
            'img': 'station_caihongzhenzhoujijiudian.jpg'
        },
        '彩虹镇': {
            'location': [-650, 40, -1177]
        },
        '三界枢纽': {
            'location': [-650, 40, -1985]
        },
        '妹控镇': {
            'location': [-385, 39, -2228],
            'description': 'Shadow_Xi创建的小镇，有大鱼大船。',
            'img': 'station_meikongzhen.jpg'
        },
        'xiqiao的家': {
            'location': [-40, 40, -2229]
        },
        '寒月家旧址': {
            'location': [700, 40, -2229]
        },
        'ricky的家': {
            'location': [1550, 40, -2230]
        },
        '西门吹雪的家': {
            'location': [2199, 20, -2840]
        },

        //K3线
        '羊庄': {
            'location': [1098, 40, 1037]
        },
        // LSF的家
        '土豆镇': {
            'location': [479, 40, 1160]
        },
        'Wintering_的家': {
            'location': [120, 40, 1174]
        },
        '大庙公园': {
            'location': [-120, 40, 1175]
        },
        // 小冷的家
        '尸冢': {
            'location': [-515, 40, 1174]
        },
        '白虎岭': {
            'location': [-671, 40, 1177]
        },
        '樱花乡': {
            'location': [-788, 40, 1175]
        },
        '樱花乡西': {
            'location': [-1030, 40, 1030]
        },

        //东方线
        '橘子的家': {
            'location': [1919, 40, 160]
        },
        'lost的家': {
            'location': [1918, 40, -240]
        },
        'Byepast家旧址': {
            'location': [1920, 40, -375]
        },
        '福原枢纽': {
            'location': [1919, 40, -679]
        },
        'KK的安置房': {
            'location': [2050, 40, -681]
        },
        '猫音小村': {
            'location': [2350, 40, -681]
        },
        '艾德拉斯军事基地': {
            'location': [2351, 40, -1202]
        },
        '风车镇': {
            'location': [2322, 40, -1351]
        },

        //二狗线
        // 橘子的家
        '狗哥村庄': {
            'location': [2392, 40, 159]
        },
        '苍樱寮': {
            'location': [2860, 40, 159]
        },
        'Xalloy的家': {
            'location': [3450, 40, 161]
        },

        //K4线
        '稻之乡南': {
            'location': [-2301, 40, 405],
            'img': 'station_daozhixiangnan.jpg',
            'description': '某鸽子搁在稻之乡南边的驱逐舰。'
        },
        '艾拉的家': {
            'location': [-1350, 40, 412]
        },
        '高地枢纽': {
            'location': [-1130, 40, 412]
        },
        '安家神机': {
            'location': [-788, 40, 412]
        },
        '迦勒底': {
            'location': [-335, 57, 547]
        },
        //'Niko的家
        //'大庙公园
        '阿云台': {
            'location': [1, 40, 1349]
        },
        '终南山': {
            'location': [0, 40, 1737]
        },
        '明镜湖': {
            'location': [-92, 40, 2570]
        },
        '咸鱼': {
            'location': [-38, 40, 2881]
        },
        '双子阁遗址': {
            'location': [-11, 40, 3204]
        },
        'XS枢纽': {
            'location': [-10, 20, 4500]
        },
        '猫村枢纽': {
            'location': [-11, 40, 5301]
        },

        //K5线
        'SBU的家': {
            'location': [-1449, 40, -1520]
        },
        '多雷古镇': {
            'location': [-1450, 40, -1178]
        },
        '守矢神社': {
            'location': [-1451, 40, -592]
        },
        // 归墟
        '归墟东': {
            'location': [-1130, 40, 130]
        },
        '一周年活动场地': {
            'location': [-930, 40, 131]
        },
        // 安家神机
        '七魂家旧址': {
            'location': [-788, 40, 890]
        },
        '盘丝洞': {
            'location': [-785, 40, 1089]
        },
        // 樱花乡
        '风之镇': {
            'location': [-788, 40, 1737]
        },
        'lsy的家': {
            'location': [-862, 60, 1726]
        },
        '方林枢纽': {
            'location': [-788, 40, 2791]
        },
        '沙漠枢纽': {
            'location': [-1256, 40, 2791]
        },
        'tz村庄': {
            'location': [-236, 40, 2791]
        },
        // 双子阁遗址
        //'咸鱼东'
        //'沙河枢纽'
        'makaruina的家': {
            'location': [1600, 40, 3204]
        },

        //发如雪线
        // 风之镇
        // 终南山
        // 终南山鸟居
        // 魔瓶的家
        '赞广遗址': {
            'location': [1270, 40, 1738]
        },
        //绿宝石公寓
        '绿帽村': {
            'location': [3260, 40, 1549]
        },

        //新风线
        // 沙漠枢纽
        '糖湖镇': {
            'location': [-1258, 20, 3347]
        },

        //K6线
        //'樱花乡西' : { 'location' : [-1030,40,1030]}, 
        'ranfei的家': {
            'location': [-1129, 40, 585]
        },
        //'高地枢纽' : { 'location' : [-1130,40,412]}, 
        // 归墟东
        '老郭故居': {
            'location': [-1130, 40, -220]
        },
        '肥宅乐园': {
            'location': [-1129, 40, -817]
        },
        'ZERO的家': {
            'location': [-1046, 40, -1177]
        },
        '红魔印象园': {
            'location': [-1046, 40, -1378]
        },
        '澎湖湾': {
            'location': [-1046, 40, -1693]
        },
        'Meowth的家': {
            'location': [-1045, 40, -1985]
        },
        //'三界枢纽' : { 'location' : [-650,40,-1985]}, 
        '妹控镇南': {
            'location': [-384, 39, -1985]
        },
        '妹控客栈': {
            'location': [-405, 39, -2064]
        },
        //'妹控镇' : { 'location' : [-385,39,-2228]}, 
        '螃蟹岛南': {
            'location': [-253, 20, -2730]
        },
        '春暖花开': {
            'location': [-386, 20, -2841]
        },
        '卫岛': {
            'location': [-570, 20, -3119]
        },
        '珊瑚湾': {
            'location': [-711, 40, -4799]
        },
        // 柯尼斯堡

        //雪国线
        //'春暖花开' : { 'location' : [-385,20,-2841]}, 
        '寒意镇': {
            'location': [-1045, 40, -2840]
        },
        '黄老菊的家': {
            'location': [-1840, 40, -2840]
        },
        '七村枢纽': {
            'location': [-2810, 40, -2841]
        },
        // '新手村': {'location': [-3987, 40, -4502]},
        '19年圣诞活动场地': {
            'location': [-4600, 40, -4500]
        },
        '二周年活动场地': {
            'location': [-4599, 40, -5340]
        },
        '北境平原': {
            'location': [
                [-4600, 40, -6901],
                [-4528, 71, -6896],
            ]
        },
        'MoKoHom的家': {
            'location': [-5870, 40, -6899]
        },

        //德意志线
        //'黄老菊的家' : { 'location' : [-1840,40,-2840]}, 
        '石榴群岛': {
            'location': [-1839, 20, -3510]
        },
        '楚格峰': {
            'location': [-1839, 40, -4501]
        },
        '柯尼斯堡': {
            'location': [-1841, 40, -4827]
        },

        //奥兹线
        '飞猫度假村': {
            'location': [-850, 20, -3549]
        },
        '卡莫俱乐部': {
            'location': [-1044, 20, -3370]
        },
        // 寒意镇
        '雪松镇': {
            'location': [-1044, 40, -2629]
        },
        // Meowth的家

        //K7线
        //'Niko的家' : { 'location' : [-120,40,837]}, 
        '天守阁': {
            'location': [-560, 40, 890]
        },
        '小驴屋': {
            'location': [-310, 40, 889]
        },
        //'七魂家旧址' : { 'location' : [-788,40,890]}, 
        //'樱花乡西' : { 'location' : [-1030,40,1030]}, 

        //K8线
        'SSame的家': {
            'location': [-3520, 40, -1401]
        },
        // 搬运镇
        '小埋的家': {
            'location': [-2518, 50, -1176]
        },
        // 多雷古镇
        '虹彩社区': {
            'location': [-1254, 40, -1178]
        },
        // ZERO的家
        // 彩虹镇
        '赞铁一局博物馆': {
            'location': [-186, 40, -1176]
        },
        '星海湾': {
            'location': [330, 40, -1178]
        },
        // 方台
        'x_xGe海灯塔': {
            'location': [1549, 40, -1090]
        },

        //M1线
        //'福原枢纽' : { 'location' : [1919,40,-679]}, 
        '赞服苏维埃根据地': {
            'location': [1770, 40, -679]
        },
        //'flam的家' : { 'location' : [1549,40,-900]}, 
        //'x_xGe海灯塔' : { 'location' : [1549,40,-1090]}, 
        '末影镇南': {
            'location': [1549, 40, -1350]
        },
        '末影镇': {
            'location': [1549, 40, -1610]
        },
        //'ricky的家' : { 'location' : [1550,40,-2230]}, 
        '红牛岛': {
            'location': [2000, 40, -3071]
        },
        'SCP驻赞服总办事处': {
            'location': [3454, 47, -3650],
            "img": "station_scp.jpg",
            "description": "内部地铁线路通向多种刷怪笼（塔）"
        },

        //K9线
        //'森林枢纽' : { 'location' : [1080,40,1997]}, 
        '富饶港': {
            'location': [1074, 40, 2700]
        },
        '沙河枢纽': {
            'location': [1080, 40, 3202]
        },
        '咸鱼东': {
            'location': [400, 40, 3203]
        },

        // 伊苏线
        '地下城': {
            'location': [915, 40, 4738]
        },
        '猫耳的家': {
            'location': [267, 40, 5301]
        },
        //'猫村枢纽': {'location': [-11, 40, 5301]},
        //'四方枢纽': {'location': [-900, 40, 5300]},
        '破碎城堡': {
            'location': [-1867, 40, 5301]
        },
        '叶观建筑群': {
            'location': [-1976, 40, 5399]
        },

        //K10线
        //'老郭故居' : { 'location' : [-1130,40,-220]}, 
        '卫宫邸': {
            'location': [-1950, 40, -221]
        },
        '光明镇': {
            'location': [-2150, 40, -130]
        },
        '稻之港': {
            'location': [-2299,40,-11],
            'img': 'station_daozhigang.jpg',
            'description': '灵森建造的位于稻之乡海岸的港口。'
        },
        '稻之乡': {
            'location': [-2299, 40, 160],
            'img': 'station_daozhixiang.jpg',
            'description': '位于地铁口出口上方醒目的圣诞树是灵森在圣诞节前夕所建。'
        },
        //'稻之乡南' : { 'location' : [-2301,40,405]}, 
        //'运通枢纽': {'location': [-2700, 40, 499]},
        '浮离': {
            'location': [-3090, 30, 501],
            'description': '一个力图实用与美观相结合的小镇。',
            'img': 'station_fuli.jpg'
        },
        '蜀汉国界': {
            'location': [-3901, 40, 1350]
        },

        //K12线
        //'作案哥的家' : { 'location' : [-2809,40,-1985]}, 
        '中世纪现代小镇': {
            'location': [-2001, 40, -1986]
        },
        //'Meowth的家' : { 'location' : [-1045,40,-1985]}, 

        //K13线
        // 阿云台
        '荔宫': {
            'location': [160, 40, 1350],
            'description': 'b站搜索纯种荔枝酱，了解一下',
            'img': 'station_ligong.jpg'
        },
        // 土豆镇
        // 无人沙村
        // 绿宝石
        '麦记': {
            'location': [3456, 40, 1346]
        },
        '花花坡村': {
            'location': [3748, 40, 1348]
        },

        //K14线
        //'艾拉的家' : { 'location' : [-1350,40,412]}, 
        '归墟': {
            'location': [-1349, 40, 129]
        },
        '海中粟': {
            'location': [-1871, 20, 128]
        },
        '钓鱼台': {
            'location': [-1949, 20, -20]
        },
        //'稻之乡': {
        //    'location': [-2299, 40, 160]
        //},
        // 稻之港
        '稻香村': {
            'location': [-2524, 40, -1]
        },
        '圣枭堡': {
            'location': [-2810, 40, -1]
        },
        '游泳圈的家': {
            'location': [-3260, 40, -1]
        },
        //K15线
        //'咸鱼东' : { 'location' : [400,40,3203]}, 
        '96Ko的家': {
            'location': [399, 40, 3340]
        },
        '提尼岛北': {
            'location': [401, 20, 4000]
        },
        '提尼岛工业园': {
            'location': [400, 20, 4499]
        },
        //'XS枢纽' : { 'location' : [-10,20,4500]},
        '共产主义大陆': {
            'location': [-945, 40, 4329]
        },
        '瑜陵': {
            'location': [
                [-1257, 20, 4329],
                [-1257, 72, 4329]
            ]
        },
        //'糖湖镇': {'location': [-1258, 69, 3354]},

        //血汗线
        '楚格峰': {
            'location': [-1839, 40, -4501]
        },
        '新手村': {
            'location': [-3987, 40, -4502],
            'description': '我只是个新手村不知道怎么介绍自己。',
            'img': 'station_xinshoucun.jpg'
        },

        //K16线
        //'共产主义大陆': {'location': [-945, 40, 4329]},
        '四方枢纽': {
            'location': [-900, 40, 5300]
        },
        '影山居': {
            'location': [-919, 41, 5990]
        },

        //K17线
        // 沙漠枢纽
        '风之新镇': {
            'location': [-1601, 40, 2229]
        },
        '村下屋根': {
            'location': [-1880, 40, 1864]
        },
        '运通枢纽': {
            'location': [-2700, 40, 499]
        },
        // 圣枭堡
        '兔岛': {
            'location': [-2809, 20, -650]
        },
        '搬运镇': {
            'location': [-2810, 40, -1400]
        },
        '作案哥的家': {
            'location': [-2809, 40, -1985]
        },
        '格莱斯枢纽': {
            'location': [-2810, 40, -2414]
        },
        // 七村枢纽

        // 星海线
        '星海大火锅': {
            'location': [292, 40, -987]
        },
        //星海湾
        //星海山顶洞


        // 平妖线
        // tz村庄
        //明镜湖
        '南山小院': {
            'location': [-119, 40, 2226]
        },
        '终南山鸟居': {
            'location': [-119, 40, 1725]
        },
        'Yusir的家': {
            'location': [-119, 40, 1530]
        },
        'COOREA的家': {
            'location': [-121, 40, 1349]
        },
        '小冷的家': {
            'location': [-1, 40, 1160]
        },
        '九里': {
            'location': [220, 40, 999]
        },

        // K18线
        //雨的故事的家
        '永远亭': {
            'location': [1112, 40, -1349]
        },
        //末影镇南
        '风车镇西': {
            'location': [2120, 40, -1351]
        },
        //风车镇

        // 方舟线
        //夏尔镇
        '绿宝石公寓': {
            'location': [2281, 40, 1553]
        },
        '绿宝石': {
            'location': [2245, 40, 1347]
        },

        // 波止线
        // 瑜庭
        '神肥国度': {
            'location': [5229, 40, 4179]
        },

        // k11线
        // 格莱斯枢纽
        '新岩石之令': {
            'location': [-2493, 40, -2413]
        }
    },
    'lines': {
        '一号线': {
            "color": "#FF0000",
            "stations": ['赞铁一局博物馆', '赞服国际机场', '出生点', 'Niko的家'],
            "description": "赞服第一条基础线，中提施工，曾为舒富佳服务，多次重修后，接入赞铁管网构成了现在地铁系统的中心最大客运枢纽，双层双向独立轨道。",
            "selfemployed": true
        },
        '二号线': {
            "color": "#000066",
            "stations": ['归墟东', '出生点', '中央枢纽'],
            "description": "有赞政府与赞铁合作完善出生点站功能以及科学而特别加建的官方线，中提施工，同样使用双向独立轨道接入赞铁管网。",
            "selfemployed": true
        },
        'K1线': {
            "color": "#3399CC",
            "stations": ['妹控镇南', 'applezhou家旧址', '星海山顶洞', '雨的故事的家', '方台', '中央枢纽', 'LSF的家', '无人沙村', '魔瓶的家', '森林枢纽', '未终','夏尔镇'],
            "description": "K1线是赞铁一局的第一条线路，由魔瓶建造，赞铁一局运营。K1线因挖掘工具由KK提供而得名，修建初衷为连通中央枢纽与魔瓶的家，后与原K3线合并，延长至妹控镇南与夏尔镇。2018年4月17日前开通。"
        },
        'K2线': {
            "color": "#999999",
            "stations": ['flam的家', '彩虹半岛', '彩虹镇洲际酒店', '彩虹镇', '三界枢纽', '妹控镇', 'xiqiao的家', '寒月家旧址', 'ricky的家', '西门吹雪的家'],
            "description": "K2线是赞服第一条有水下隧道的线路，由lettit与魔瓶建造，赞铁一局运营。修建初衷为连通妹控镇、彩虹镇与主城，后主城-城北枢纽段被赞方拆除废弃，K2线延长至flam的家与ricky的家。2018年4月17日前开通。"
        },
        'K3线': {
            "color": "#996600",
            "stations": ['羊庄', 'LSF的家', '土豆镇', 'Wintering_的家', '大庙公园', '小冷的家', '尸冢', '白虎岭', '樱花乡', '樱花乡西'],
            "description": "K3线由魔瓶建造，赞铁一局运营。修建初衷为连通羊村与LSF的家，后延长至樱花乡西。2018年4月30日开通。"
        },
        'K4线': {
            "color": "#CC6699",
            "stations": ['稻之乡南', '艾拉的家', '高地枢纽', '安家神机', '迦勒底', 'Niko的家', '大庙公园', '阿云台', '终南山', '明镜湖', '咸鱼', '双子阁遗址', 'XS枢纽', '猫村枢纽'],
            "description": "K4线由魔瓶建造，赞铁一局运营。修建初衷为连通卡琪米亚大敎堂、终南山与雪亭，后主城段被赞方市拆除，开始分段运营，后延长至稻之乡南与猫耳的家，后猫耳的家-猫村枢纽段并入伊苏线，交由苏瑕瑜铁路局运营。2018年4月23日开通"
        },
        'K5线': {
            "color": "#99CCFF",
            "stations": ['SBU的家', '多雷古镇', '守矢神社', '归墟','归墟东','一周年活动场地', '安家神机', '七魂家旧址', '盘丝洞', '樱花乡', '风之镇', 'lsy的家','方林枢纽', '双子阁遗址', '咸鱼东', '沙河枢纽', 'makaruina的家', '格里芬'],
            "description": "K5线由魔瓶建造，赞铁一局运营。修建初衷为连通未名阁与风之镇，后延长至KINDEL的家，后KINDEL的家-tz村庄段并入参宿线，K5线延长至双子阁。2018年5月9日开通。"
        },
        'K6线': {
            "color": "#FF9999",
            "stations": ['樱花乡西', '高地枢纽', '归墟东','老郭故居', '肥宅乐园', 'ZERO的家', '红魔印象园', '澎湖湾', 'Meowth的家', '三界枢纽', '妹控镇南', '妹控客栈', '妹控镇', '螃蟹岛南', '春暖花开', '卫岛', '珊瑚湾', '柯尼斯堡'],
            "description": "K6线由魔瓶建造，赞铁一局运营。修建初衷为连通Meowth的家与三界枢纽，后延长至樱花乡西与飞猫岛，后飞猫岛-卫岛段塌方废弃。2018年5月4日开通。"
        },
        'K7线': {
            "color": "#FF6633",
            "stations": ['Niko的家', '小驴屋', '天守阁', '七魂家旧址', '樱花乡西'],
            "description": "K7线由魔瓶建造，赞铁一局运营。修建初衷为连通Niko的家与七魂家旧址，后延长至fade的家。2018年5月14日开通。"
        },
        'K8线': {
            "color": "#99CCCC",
            "stations": ['SSame的家', '搬运镇', '小埋的家', '多雷古镇', '虹彩社区', 'ZERO的家', '彩虹镇', '赞铁一局博物馆', '星海湾', '方台', 'x_xGe海灯塔'],
            "description": "K8线由魔瓶建造，赞铁一局运营。修建初衷为连通平平枢纽与彩虹镇，后延长至x_xGe海灯塔。2018年6月6日开通。"
        },
        'K9线': {
            "color": "#CC9999",
            "stations": ['森林枢纽', '富饶港', '沙河枢纽'],
            "description": "K9线由魔瓶建造，赞铁一局运营。修建初衷为连通富饶港与森林枢纽，后延长至双子阁。2018年8月14日开通。"
        },
        'K10线': {
            "color": "#33CC66",
            "stations": ['老郭故居', '卫宫邸', '光明镇', '稻之港', '稻之乡', '稻之乡南', '运通枢纽', '浮离', '蜀汉国界'],
            "description": "K10线由魔瓶建造，赞铁一局运营。修建初衷为连通老郭的家与光明镇，后延长至蜀汉国界。2018年8月28日开通。"
        },
        'K11线': {
            "color": "#CC6600",
            "stations": ['格莱斯枢纽', '新岩石之令']
        },
        'K12线': {
            "color": "#FF3399",
            "stations": ['作案哥的家', '中世纪现代小镇', 'Meowth的家'],
            "description": "K12线由魔瓶建造，赞铁一局运营。修建初衷为连通作案哥的家与Meowth的家。2018年11月17日开通。"
        },
        'K13线': {
            "color": "#339999",
            "stations": ['阿云台', '荔宫', '无人沙村', '绿宝石', '麦记', '花花坡村'],
            "description": "K13线由魔瓶建造，赞铁一局运营。修建初衷为连通Xiao_Yun的家与无人沙村。2018年10月20日开通。"
        },
        'K14线': {
            "color": "#990000",
            "stations": ['艾拉的家', '归墟', '海中粟', '钓鱼台', '稻之乡', '卫宫邸', '稻之港', '稻香村', '圣枭堡', '游泳圈的家'],
            "description": "K14线由魔瓶建造，赞铁一局运营。修建初衷为连通归墟与艾拉的家，后延长至稻之乡与秋山的家。2018年11月25日开通。"
        },
        'K15线': {
            "color": "#003366",
            "stations": ['咸鱼东', '提尼岛北', '提尼岛工业园', 'XS枢纽', '共产主义大陆', '瑜陵', '糖湖镇', '沙漠枢纽', '方林枢纽', 'tz村庄'],
            "description": "K15线由魔瓶建造，赞铁一局运营。修建初衷为连通提尼岛北与咸鱼东，后与文明线合併，延长至糖湖镇。2018年11月26日开通。"
        },
        'K16线': {
            "color": "#663300",
            "stations": ['共产主义大陆', '四方枢纽', '影山居'],
            "description": "K16线由魔瓶建造，赞铁一局运营。修建初衷为连通共产主义大陆与影山居。2019年3月3日开通。"
        },
        'K17线': {
            "color": "#990066",
            "stations": ['七村枢纽', '格莱斯枢纽', '作案哥的家', '搬运镇', '兔岛', '圣枭堡', '运通枢纽', '村下屋根', '风之新镇', '沙漠枢纽'],
            "description": "K17线由魔瓶建造，赞铁一局运营。修建初衷为连通运通枢纽与同妹在樱花下看麦田，后延长至风之镇西。2019年3月9日开通。"
        },
        'M1线': {
            "color": "#3399FF",
            "stations": ['福原枢纽', '赞服苏维埃根据地', 'flam的家', 'x_xGe海灯塔', '末影镇南', '末影镇', 'ricky的家', '红牛岛', 'SCP驻赞服总办事处'],
            "description": "M1线由曼史坦纳与魔瓶建造，赞铁一局运营。M1线是由曼史坦纳规划设计并主要施工的线路，故名M1线，修建初衷为连通ricky的家与末影镇，后延长至SCP驻赞服总办事处福原枢纽。2018年8月4日开通。"
        },
        '爱国线': {
            "color": "#66CCCC",
            "stations": ['夏尔镇', 'ACE的家', '夏尔村民农场南', 'slantyone的家', '上弦半岛', '瑜庭', '错误岛', '寒月的家', '_qUUp_的家'],
            "description": "爱国线是K1线的延长线，由诗织与魔瓶建造，赞铁一局运营。爱国线由诗织命名，修建初衷为连通夏尔镇与晓枫的家，后延长至寒月的家。2018年7月6日开通。"
        },
        '少女前线': {
            "color": "#FFCCFF",
            "stations": ['夏尔村民农场南', '格里芬'],
            "description": "少女前线由魔瓶建造，赞铁一局运营。少女前线由诗织命名，修建初衷为连通诗织的家与夏尔村民农场南，后延长至applezhou的家。2018年7月31日开通。"
        },
        '东方线': {
            "color": "#CC00FF",
            "stations": ['中央枢纽', '橘子的家', 'lost的家', 'Byepast家旧址', '福原枢纽', 'KK的安置房', '猫音小村', '艾德拉斯军事基地', '风车镇'],
            "description": "东方线由Byepast建造，魔瓶改造，赞铁一局代运营。修建初衷为连通中央枢纽与Byepast的家，后延长至风车镇。2018年4月17日前开通。"
        },
        '发如雪线': {
            "color": "#99CC33",
            "stations": ['风之镇', '终南山','终南山鸟居', '魔瓶的家', '赞广遗址', '绿宝石公寓', '绿帽村'],
            "description": "发如雪线由迷城与魔瓶建造，赞铁一局运营。发如雪线由迷城命名，修建初衷为连通风之镇与魔瓶的家。2018年4月21日开通。"
        },
        '雪国线': {
            "color": "#CCCCCC",
            "stations": ['春暖花开', '寒意镇', '黄老菊的家', '七村枢纽', '新手村', '19年圣诞活动场地', '二周年活动场地', '北境平原', 'MoKoHom的家'],
            "description": "雪国线由魔瓶建造，赞铁一局运营。雪国线修建初衷为连通春暖花开与位于雪原生态域的天照遗址，并因此得名，但开通初期仅连通至七魂的家，半年后延长至天照遗址。2018年7月25日开通。"
        },
        '德意志线': {
            "color": "#FF9900",
            "stations": ['黄老菊的家', '石榴群岛', '楚格峰', '柯尼斯堡'],
            "description": "德意志线由曼史坦纳与魔瓶建造，赞铁一局运营。德意志线由曼史坦纳命名，修建初衷为连通柯尼斯堡与黄老菊的家。2018年8月9日开通。"
        },
        '奥兹线': {
            "color": "#FFCC00",
            "stations": ['飞猫度假村', '卡莫俱乐部', '寒意镇', '雪松镇', 'Meowth的家'],
            "description": "奥兹线由魔瓶建造，赞铁一局运营。奥兹线修建初衷为连通Royenheart的家与Mewoth的家，因两地间有一条黄色小径，似《绿野仙踪》中的金砖路，故名奥兹线。2018年7月27日开通。"
        },
        '伊苏线': {
            "color": "#0066CC",
            "stations": ['提尼岛工业园', '地下城', '猫耳的家', '猫村枢纽', '四方枢纽', '破碎城堡', '叶观建筑群'],
            "selfemployed": true
        },
        '星海线': {
            "color": '#0033FF',
            "stations": ['星海湾', '星海山顶洞','星海大火锅'],
            "description": '星海线是一条地区线路，也是赞服第一条环线，由魔瓶建造，赞铁一局运营。星海线修建初衷为连通星海地区各建筑，并因此得名。2019年5月12日开通。'
        },
        '平妖线': {
            "color": '#33CCFF',
            "stations": ['tz村庄', '明镜湖','南山小院','终南山鸟居', 'Yusir的家', 'COOREA的家', '小冷的家', '九里'],
            "description": '平妖线由魔瓶建造，赞铁一局运营。平妖线修建初衷为连通阿云台附近多户人家，因施工途中受到骷髅阻碍而得名。2019年6月16日开通。'
        },
        'K18线': {
            "color": '#666666',
            "stations": ['雨的故事的家', '永远亭', '末影镇南', '风车镇西', '风车镇']
        },
        '方舟线': {
            "color": '#006600',
            "stations": ['绿宝石', '绿宝石公寓', '夏尔镇']
        },
        '二狗线': {
            "color": '#9999CC',
            "stations": ['橘子的家', '狗哥村庄', '苍樱寮', 'Xalloy的家']
        },
        '波止线': {
            "color": '#66CCFF',
            "stations": ['瑜庭', '神肥国度'],
            "selfemployed": true
        },
        '血汗线': {
            "color": '#CCFFFF',
            "stations": ['新手村', '楚格峰']
        }
    },
    'paths': [
        // 一号线
        {
            "start": "赞铁一局博物馆",
            "end": "赞服国际机场",
            "stationArray": [0, 1],
            "line": "一号线"
        }, 
        {
            "start": "赞服国际机场",
            "end": "赞铁一局博物馆",
            "line": "一号线"
        }, 
        {
            "start": "赞服国际机场",
            "end": "出生点",
            "stationArray": [1, 1],
            "line": "一号线"
        }, 
        {
            "start": "出生点",
            "end": "赞服国际机场",
            "line": "一号线"
        }, 
        {
            "start": "出生点",
            "end": "Niko的家",
            "stationArray": [1, 0],
            'polyline': [
                [-186.5, 53, 203.5],
                [-186.5, 40, 837],
                [-120, 40, 837]
            ],
            "line": "一号线"
        }, 
        {
            "start": "Niko的家",
            "end": "出生点",
            'polyline': [
                [-120, 40, 837],
                [-186.5, 40, 837],
                [-186.5, 53, 203.5]
            ],
            "line": "一号线"
        }, 
        // 二号线
        {
            "start": "归墟东",
            "end": "出生点",
            "stationArray": [0, 3],
            'polyline': [
                [-1130, 40, 130],
                [-1130, 40, 203.5],
                [-186.5, 53, 203.5],
            ],
            "line": "二号线"
        }, 
        {
            "start": "出生点",
            "end": "归墟东",
            "stationArray": [2, 0],
            'polyline': [
                [-186.5, 53, 203.5],
                [-1130, 40, 203.5],
                [-1130, 40, 130]
            ],
            "line": "二号线"
        }, 
        {
            "start": "出生点",
            "end": "中央枢纽",
            "stationArray": [3, 0],
            "line": "二号线"
        }, 
        {
            "start": "中央枢纽",
            "end": "出生点",
            "stationArray": [0, 2],
            "line": "二号线"
        }, 
        // K1线
        {
            "start": "妹控镇南",
            "end": "applezhou家旧址",
            "line": "K1线"
        }, 
        {
            "start": "applezhou家旧址",
            "end": "妹控镇南",
            "line": "K1线"
        }, 
        {
            "start": "applezhou家旧址",
            "end": "星海山顶洞",
            "line": "K1线"
        }, 
        {
            "start": "星海山顶洞",
            "end": "applezhou家旧址",
            //这里距离按照南站台出发算
            "line": "K1线"
        }, 
        {
            "start": "星海山顶洞",
            "end": "雨的故事的家",
            "line": "K1线"
        }, 
        {
            "start": "雨的故事的家",
            "end": "星海山顶洞",
            //这里距离按照南站台出发算
            "line": "K1线"
        }, 
        {
            "start": "雨的故事的家",
            "end": "方台",
            "line": "K1线"
        }, 
        {
            "start": "方台",
            "end": "雨的故事的家",
            "line": "K1线"
        },
        {
            "start": "方台",
            "end": "中央枢纽",
            "line": "K1线"
        }, 
        {
            "start": "中央枢纽",
            "end": "方台",
            "line": "K1线"
        },
        {
            "start": "中央枢纽",
            "end": "LSF的家",
            "line": "K1线"
        }, 
        {
            "start": "LSF的家",
            "end": "中央枢纽",
            "line": "K1线"
        }, 
        {
            "start": "LSF的家",
            "end": "无人沙村",
            "line": "K1线"
        }, 
        {
            "start": "无人沙村",
            "end": "LSF的家",
            "line": "K1线"
        }, 
        {
            "start": "无人沙村",
            "end": "魔瓶的家",
            "line": "K1线"
        }, 
        {
            "start": "魔瓶的家",
            "end": "无人沙村",
            "line": "K1线"
        }, 
        {
            "start": "魔瓶的家",
            "end": "森林枢纽",
            "line": "K1线"
        }, 
        {
            "start": "森林枢纽",
            "end": "魔瓶的家",
            "line": "K1线"
        }, 
        {
            "start": "森林枢纽",
            "end": "未终",
            "line": "K1线"
        }, 
        {
            "start": "未终",
            "end": "森林枢纽",
            "line": "K1线"
        }, 
        {
            "start": "未终",
            "end": "夏尔镇",
            "line": "K1线"
        }, 
        {
            "start": "夏尔镇",
            "end": "未终",
            "line": "K1线"
        }, 

        // K2线
        {
            "start": "flam的家",
            "end": "彩虹半岛",
            "line": "K2线"
        },
        {
            "start": "彩虹半岛",
            "end": "flam的家",
            "line": "K2线"
        },
        {
            "start": "彩虹半岛",
            "end": "彩虹镇",
            'polyline': [
                [-410, 40, -889],
                [-650, 40, -889],
                [-650, 40, -1177]
            ],
            "line": "K2线"
        },
        {
            "start": "彩虹镇",
            "end": "彩虹半岛",
            'polyline': [
                [-650, 40, -1177],
                [-650, 40, -889],
                [-410, 40, -889],
            ],
            "line": "K2线"
        },
        // ---- 彩虹镇洲际酒店支线  
        {
            "start": "彩虹镇",
            "end": "彩虹镇洲际酒店",
            "line": "K2线"
        },
        {
            "start": "彩虹镇洲际酒店",
            "end": "彩虹镇",
            "line": "K2线"
        },
        {
            "start": "彩虹镇洲际酒店",
            "end": "彩虹半岛",
            'polyline': [
                [-651, 40, -1018],
                [-650, 40, -889],
                [-410, 40, -889],
            ],
            "line": "K2线"
        },
        // ---- 彩虹镇洲际酒店支线
        {
            "start": "彩虹镇",
            "end": "三界枢纽",
            "line": "K2线"
        },
        {
            "start": "三界枢纽",
            "end": "彩虹镇",
            "line": "K2线"
        },
        {
            "start": "三界枢纽",
            "end": "妹控镇",
            'polyline': [
                [-650, 40, -1985],
                [-650, 40, -2228],
                [-385, 39, -2228]
            ],
            "line": "K2线"
        },
        {
            "start": "妹控镇",
            "end": "三界枢纽",
            'polyline': [
                [-385, 39, -2228],
                [-650, 40, -2228],
                [-650, 40, -1985]
            ],
            "line": "K2线"
        },
        {
            "start": "妹控镇",
            "end": "xiqiao的家",
            "line": "K2线"
        },
        {
            "start": "xiqiao的家",
            "end": "妹控镇",
            "line": "K2线"
        },
        {
            "start": "xiqiao的家",
            "end": "寒月家旧址",
            "line": "K2线"
        },
        {
            "start": "寒月家旧址",
            "end": "xiqiao的家",
            "line": "K2线"
        },
        {
            "start": "寒月家旧址",
            "end": "ricky的家",
            "line": "K2线"
        },
        {
            "start": "ricky的家",
            "end": "寒月家旧址",
            "line": "K2线"
        },
        {
            "start": "ricky的家",
            "end": "西门吹雪的家",
            'polyline': [
                [1550, 40, -2230],
                [2199, 40, -2230],
                [2199, 20, -2840]
            ],
            "line": "K2线"
        },
        {
            "start": "西门吹雪的家",
            "end": "ricky的家",
            'polyline': [
                [2199, 20, -2840],
                [2199, 40, -2230],
                [1550, 40, -2230]
            ],
            "line": "K2线"
        },

        // K3线
        {
            "start": "羊庄",
            "end": "LSF的家",
            "line": "K3线"
        },
        {
            "start": "LSF的家",
            "end": "羊庄",
            "line": "K3线"
        },
        {
            "start": "LSF的家",
            "end": "土豆镇",
            "line": "K3线"
        },
        {
            "start": "土豆镇",
            "end": "LSF的家",
            "line": "K3线"
        },
        {
            "start": "土豆镇",
            "end": "Wintering_的家",
            "line": "K3线"
        },
        {
            "start": "Wintering_的家",
            "end": "土豆镇",
            "line": "K3线"
        },
        {
            "start": "Wintering_的家",
            "end": "大庙公园",
            "line": "K3线"
        },
        {
            "start": "大庙公园",
            "end": "Wintering_的家",
            "line": "K3线"
        },
        {
            "start": "大庙公园",
            "end": "尸冢",
            "line": "K3线"
        },
        {
            "start": "大庙公园",
            "end": "小冷的家",
            "line": "K3线"
        },
        {
            "start": "小冷的家",
            "end": "大庙公园",
            "line": "K3线"
        },
        {
            "start": "尸冢",
            "end": "大庙公园",
            "line": "K3线"
        },
        {
            "start": "尸冢",
            "end": "樱花乡",
            "line": "K3线"
        },
        {
            "start": "樱花乡",
            "end": "尸冢",
            "line": "K3线"
        },
        // ---- 白虎岭支线
        {
            "start": "白虎岭",
            "end": "尸冢",
            "line": "K3线"
        },
        {
            "start": "白虎岭",
            "end": "樱花乡",
            "line": "K3线"
        },
        {
            "start": "樱花乡",
            "end": "白虎岭",
            "line": "K3线"
        },
        // ---- 白虎岭支线
        {
            "start": "樱花乡",
            "end": "樱花乡西",
            "line": "K3线"
        },
        {
            "start": "樱花乡西",
            "end": "樱花乡",
            "line": "K3线"
        },

        // K4线
        {
            "start": "艾拉的家",
            "end": "稻之乡南",
            "line": "K4线"
        },
        {
            "start": "稻之乡南",
            "end": "艾拉的家",
            "line": "K4线"
        },
        {
            "start": "高地枢纽",
            "end": "艾拉的家",
            "line": "K4线"
        },
        {
            "start": "艾拉的家",
            "end": "高地枢纽",
            "line": "K4线"
        },
        {
            "start": "安家神机",
            "end": "高地枢纽",
            "line": "K4线"
        },
        {
            "start": "高地枢纽",
            "end": "安家神机",
            "line": "K4线"
        },
        {
            "start": "安家神机",
            "end": "迦勒底",
            "line": "K4线"
        },
        {
            "start": "迦勒底",
            "end": "安家神机",
            "line": "K4线"
        },

        {
            "start": "迦勒底",
            "end": "Niko的家",
            "line": "K4线"
        },
        {
            "start": "Niko的家",
            "end": "迦勒底",
            "line": "K4线"
        },
        {
            "start": "Niko的家",
            "end": "大庙公园",
            "line": "K4线"
        },
        {
            "start": "大庙公园",
            "end": "Niko的家",
            "line": "K4线"
        },
        {
            "start": "大庙公园",
            "end": "阿云台",
            "line": "K4线"
        },
        {
            "start": "阿云台",
            "end": "大庙公园",
            "line": "K4线"
        },
        {
            "start": "阿云台",
            "end": "终南山",
            "line": "K4线"
        },
        {
            "start": "终南山",
            "end": "阿云台",
            "line": "K4线"
        },
        {
            "start": "终南山",
            "end": "明镜湖",
            "line": "K4线"
        },
        {
            "start": "明镜湖",
            "end": "终南山",
            "line": "K4线"
        },
        {
            "start": "明镜湖",
            "end": "咸鱼",
            "line": "K4线"
        },
        {
            "start": "咸鱼",
            "end": "明镜湖",
            "line": "K4线"
        },
        {
            "start": "咸鱼",
            "end": "双子阁遗址",
            "line": "K4线"
        },
        {
            "start": "双子阁遗址",
            "end": "咸鱼",
            "line": "K4线"
        },
        {
            "start": "双子阁遗址",
            "end": "XS枢纽",
            "line": "K4线"
        },
        {
            "start": "XS枢纽",
            "end": "双子阁遗址",
            "line": "K4线"
        },
        {
            "start": "XS枢纽",
            "end": "猫村枢纽",
            "line": "K4线"
        },
        {
            "start": "猫村枢纽",
            "end": "XS枢纽",
            "line": "K4线"
        },

        // K5线
        {
            "start": "多雷古镇",
            "end": "SBU的家",
            "line": "K5线"
        },
        {
            "start": "SBU的家",
            "end": "多雷古镇",
            "line": "K5线"
        },
        {
            "start": "多雷古镇",
            "end": "守矢神社",
            "line": "K5线"
        },
        {
            "start": "守矢神社",
            "end": "多雷古镇",
            "line": "K5线"
        },
        {
            "start": "守矢神社",
            "end": "归墟",
            "line": "K5线"
        },
        {
            "start": "归墟",
            "end": "守矢神社",
            "line": "K5线"
        },
        {
            "start": "归墟",
            "end": "归墟东",
            "line": "K5线"
        },
        {
            "start": "归墟东",
            "end": "归墟",
            "line": "K5线"
        },
        {
            "start": "归墟东",
            "end": "一周年活动场地",
            "line": "K5线"
        },
        {
            "start": "一周年活动场地",
            "end": "归墟东",
            "line": "K5线"
        },
        {
            "start": "一周年活动场地",
            "end": "安家神机",
            "line": "K5线"
        },
        {
            "start": "安家神机",
            "end": "一周年活动场地",
            "line": "K5线"
        },
        {
            "start": "安家神机",
            "end": "七魂家旧址",
            "line": "K5线"
        },
        {
            "start": "七魂家旧址",
            "end": "安家神机",
            "line": "K5线"
        },
        {
            "start": "七魂家旧址",
            "end": "樱花乡",
            "line": "K5线"
        },
        {
            "start": "樱花乡",
            "end": "七魂家旧址",
            "line": "K5线"
        },
        // ---- 盘丝洞支线
        {
            "start": "盘丝洞",
            "end": "樱花乡",
            "line": "K5线"
        },
        // ---- 盘丝洞支线
        {
            "start": "樱花乡",
            "end": "盘丝洞",
            "line": "K5线"
        },
        {
            "start": "盘丝洞",
            "end": "七魂家旧址",
            "line": "K5线"
        },
        {
            "start": "樱花乡",
            "end": "风之镇",
            "line": "K5线"
        },
        {
            "start": "风之镇",
            "end": "樱花乡",
            "line": "K5线"
        },
        // ----lsy的家支线
        {
            "start": "风之镇",
            "end": "lsy的家",
            "line": "K5线"
        },
        {
            "start": "lsy的家",
            "end": "风之镇",
            "line": "K5线"
        },
        // ----lsy的家支线

        {
            "start": "方林枢纽",
            "end": "风之镇",
            "line": "K5线"
        },
        {
            "start": "风之镇",
            "end": "方林枢纽",
            "line": "K5线"
        },
        {
            "start": "双子阁遗址",
            "end": "方林枢纽",
            "line": "K5线"
        },
        {
            "start": "方林枢纽",
            "end": "双子阁遗址",
            "line": "K5线"
        },
        {
            "start": "双子阁遗址",
            "end": "咸鱼东",
            "line": "K5线"
        },
        {
            "start": "咸鱼东",
            "end": "双子阁遗址",
            "line": "K5线"
        },
        {
            "start": "咸鱼东",
            "end": "沙河枢纽",
            "line": "K5线"
        },
        {
            "start": "沙河枢纽",
            "end": "咸鱼东",
            "line": "K5线"
        },
        {
            "start": "沙河枢纽",
            "end": "makaruina的家",
            "line": "K5线"
        },
        {
            "start": "makaruina的家",
            "end": "沙河枢纽",
            "line": "K5线"
        },
         {
            "start": "格里芬",
            "end": "makaruina的家",
            "line": "K5线"
        },
        {
            "start": "makaruina的家",
            "end": "格里芬",
            "line": "K5线"
        },

        // K6线
        {
            "start": "樱花乡西",
            "end": "高地枢纽",
            "line": "K6线"
        },
        {
            "start": "高地枢纽",
            "end": "樱花乡西",
            "line": "K6线"
        },
        {
            "start": "高地枢纽",
            "end": "归墟东",
            "line": "K6线"
        },
        {
            "start": "归墟东",
            "end": "高地枢纽",
            "line": "K6线"
        },
        {
            "start": "归墟东",
            "end": "老郭故居",
            "line": "K6线"
        },
        {
            "start": "老郭故居",
            "end": "归墟东",
            "line": "K6线"
        },
        {
            "start": "老郭故居",
            "end": "肥宅乐园",
            "line": "K6线"
        },
        {
            "start": "肥宅乐园",
            "end": "老郭故居",
            "line": "K6线"
        },
        {
            "start": "肥宅乐园",
            "end": "ZERO的家",
            "line": "K6线"
        },
        {
            "start": "ZERO的家",
            "end": "肥宅乐园",
            "line": "K6线"
        },
        {
            "start": "ZERO的家",
            "end": "红魔印象园",
            "line": "K6线"
        },
        {
            "start": "红魔印象园",
            "end": "ZERO的家",
            "line": "K6线"
        },
        {
            "start": "红魔印象园",
            "end": "澎湖湾",
            "line": "K6线"
        },
        {
            "start": "澎湖湾",
            "end": "红魔印象园",
            "line": "K6线"
        },
        {
            "start": "澎湖湾",
            "end": "Meowth的家",
            "line": "K6线"
        },
        {
            "start": "Meowth的家",
            "end": "澎湖湾",
            "line": "K6线"
        },
        {
            "start": "Meowth的家",
            "end": "三界枢纽",
            "line": "K6线"
        },
        {
            "start": "三界枢纽",
            "end": "Meowth的家",
            "line": "K6线"
        },
        {
            "start": "三界枢纽",
            "end": "妹控镇南",
            "line": "K6线"
        },
        {
            "start": "妹控镇南",
            "end": "三界枢纽",
            "line": "K6线"
        },
        {
            "start": "妹控镇南",
            "end": "妹控客栈",
            "line": "K6线"
        },
        {
            "start": "妹控客栈",
            "end": "妹控镇南",
            "line": "K6线"
        },
        {
            "start": "妹控镇南",
            "end": "妹控镇",
            "line": "K6线"
        },
        {
            "start": "妹控镇",
            "end": "妹控镇南",
            "line": "K6线"
        },
        // ---- 螃蟹岛南支线
        {
            "start": "妹控镇",
            "end": "螃蟹岛南",
            "line": "K6线"
        },
        {
            "start": "螃蟹岛南",
            "end": "妹控镇",
            "line": "K6线"
        },
        {
            "start": "螃蟹岛南",
            "end": "春暖花开",
            "line": "K6线"
        },
        {
            "start": "春暖花开",
            "end": "螃蟹岛南",
            "line": "K6线"
        },
        // ---- 螃蟹岛南支线
        {
            "start": "妹控镇",
            "end": "春暖花开",
            "line": "K6线"
        },
        {
            "start": "春暖花开",
            "end": "妹控镇",
            "line": "K6线"
        },
        {
            "start": "春暖花开",
            "end": "卫岛",
            "line": "K6线"
        },
        {
            "start": "卫岛",
            "end": "春暖花开",
            "line": "K6线"
        },
        {
            "start": "珊瑚湾",
            "end": "春暖花开",
            "line": "K6线"
        },
        {
            "start": "春暖花开",
            "end": "珊瑚湾",
            "line": "K6线"
        },
        {
            "start": "珊瑚湾",
            "end": "柯尼斯堡",
            "line": "K6线"
        },
        {
            "start": "柯尼斯堡",
            "end": "珊瑚湾",
            "line": "K6线"
        },

        // K7线
        {
            "start": "Niko的家",
            "end": "小驴屋",
            "line": "K7线"
        },
        {
            "start": "小驴屋",
            "end": "Niko的家",
            "line": "K7线"
        },
        {
            "start": "小驴屋",
            "end": "天守阁",
            "line": "K7线"
        },
        {
            "start": "天守阁",
            "end": "小驴屋",
            "line": "K7线"
        },
        {
            "start": "天守阁",
            "end": "七魂家旧址",
            "line": "K7线"
        },
        {
            "start": "七魂家旧址",
            "end": "天守阁",
            "line": "K7线"
        },
        {
            "start": "七魂家旧址",
            "end": "樱花乡西",
            "line": "K7线"
        },
        {
            "start": "樱花乡西",
            "end": "七魂家旧址",
            "line": "K7线"
        },

        // K8线
        {
            "start": "SSame的家",
            "end": "搬运镇",
            "line": "K8线"
        },
        {
            "start": "搬运镇",
            "end": "SSame的家",
            "line": "K8线"
        },
        {
            "start": "搬运镇",
            "end": "小埋的家",
            "line": "K8线"
        },
        {
            "start": "小埋的家",
            "end": "搬运镇",
            "line": "K8线"
        },
        {
            "start": "多雷古镇",
            "end": "小埋的家",
            "line": "K8线"
        },
        {
            "start": "小埋的家",
            "end": "多雷古镇",
            "line": "K8线"
        },
        {
            "start": "多雷古镇",
            "end": "虹彩社区",
            "line": "K8线"
        },
        {
            "start": "虹彩社区",
            "end": "多雷古镇",
            "line": "K8线"
        },
        {
            "start": "虹彩社区",
            "end": "ZERO的家",
            "line": "K8线"
        },
        {
            "start": "ZERO的家",
            "end": "虹彩社区",
            "line": "K8线"
        },
        {
            "start": "ZERO的家",
            "end": "彩虹镇",
            "line": "K8线"
        },
        {
            "start": "彩虹镇",
            "end": "ZERO的家",
            "line": "K8线"
        },
        {
            "start": "彩虹镇",
            "end": "赞铁一局博物馆",
            "line": "K8线"
        },
        {
            "start": "赞铁一局博物馆",
            "end": "彩虹镇",
            "line": "K8线"
        },
        {
            "start": "赞铁一局博物馆",
            "end": "星海湾",
            "line": "K8线"
        },
        {
            "start": "星海湾",
            "end": "赞铁一局博物馆",
            "line": "K8线"
        },
        {
            "start": "星海湾",
            "end": "方台",
            "line": "K8线"
        },
        {
            "start": "方台",
            "end": "星海湾",
            "line": "K8线"
        },
        {
            "start": "方台",
            "end": "x_xGe海灯塔",
            "line": "K8线"
        },
        {
            "start": "x_xGe海灯塔",
            "end": "方台",
            "line": "K8线"
        },

        // K9线
        {
            "start": "森林枢纽",
            "end": "富饶港",
            "line": "K9线"
        },
        {
            "start": "富饶港",
            "end": "森林枢纽",
            "line": "K9线"
        },
        {
            "start": "富饶港",
            "end": "沙河枢纽",
            "line": "K9线"
        },
        {
            "start": "沙河枢纽",
            "end": "富饶港",
            "line": "K9线"
        },

        // K10线
        {
            "start": "老郭故居",
            "end": "卫宫邸",
            "line": "K10线"
        },
        {
            "start": "卫宫邸",
            "end": "老郭故居",
            "line": "K10线"
        },
        {
            "start": "卫宫邸",
            "end": "光明镇",
            "line": "K10线"
        },
        {
            "start": "光明镇",
            "end": "卫宫邸",
            "line": "K10线"
        },
        {
            "start": "光明镇",
            "end": "稻之港",
            "line": "K10线"
        },
        {
            "start": "稻之港",
            "end": "光明镇",
            "line": "K10线"
        },
        {
            "start": "稻之港",
            "end": "稻之乡",
            "line": "K10线"
        },
        {
            "start": "稻之乡",
            "end": "稻之港",
            "line": "K10线"
        },
        {
            "start": "稻之乡",
            "end": "稻之乡南",
            "line": "K10线"
        },
        {
            "start": "稻之乡南",
            "end": "稻之乡",
            "line": "K10线"
        },
        {
            "start": "稻之乡南",
            "end": "运通枢纽",
            "line": "K10线"
        },
        {
            "start": "运通枢纽",
            "end": "稻之乡南",
            "line": "K10线"
        },
        {
            "start": "运通枢纽",
            "end": "浮离",
            "line": "K10线"
        },
        {
            "start": "浮离",
            "end": "运通枢纽",
            "line": "K10线"
        },
        {
            "start": "浮离",
            "end": "蜀汉国界",
            "line": "K10线"
        },
        {
            "start": "蜀汉国界",
            "end": "浮离",
            "line": "K10线"
        },

        // K12线
        {
            "start": "作案哥的家",
            "end": "中世纪现代小镇",
            "line": "K12线"
        },
        {
            "start": "中世纪现代小镇",
            "end": "作案哥的家",
            "line": "K12线"
        },
        {
            "start": "中世纪现代小镇",
            "end": "Meowth的家",
            "line": "K12线"
        },
        {
            "start": "Meowth的家",
            "end": "中世纪现代小镇",
            "line": "K12线"
        },

        // K13线
        {
            "start": "阿云台",
            "end": "荔宫",
            "line": "K13线"
        },
        {
            "start": "荔宫",
            "end": "阿云台",
            "line": "K13线"
        },
        {
            "start": "荔宫",
            "end": "无人沙村",
            "line": "K13线"
        },
        {
            "start": "无人沙村",
            "end": "荔宫",
            "line": "K13线"
        },
        {
            "start": "无人沙村",
            "end": "绿宝石",
            "line": "K13线"
        },
        {
            "start": "绿宝石",
            "end": "无人沙村",
            "line": "K13线"
        },
        {
            "start": "麦记",
            "end": "绿宝石",
            "line": "K13线"
        },
        {
            "start": "绿宝石",
            "end": "麦记",
            "line": "K13线"
        },
        {
            "start": "麦记",
            "end": "花花坡村",
            "line": "K13线"
        },
        {
            "start": "花花坡村",
            "end": "麦记",
            "line": "K13线"
        },

        // K14线
        {
            "start": "艾拉的家",
            "end": "归墟",
            "line": "K14线"
        },
        {
            "start": "归墟",
            "end": "艾拉的家",
            "line": "K14线"
        },
        {
            "start": "归墟",
            "end": "海中粟",
            "line": "K14线"
        },
        {
            "start": "海中粟",
            "end": "归墟",
            "line": "K14线"
        },
        {
            "start": "海中粟",
            "end": "稻之乡",
            "line": "K14线"
        },
        {
            "start": "稻之乡",
            "end": "海中粟",
            "line": "K14线"
        },
        {
            "start": "海中粟",
            "end": "钓鱼台",
            "line": "K14线"
        },
        {
            "start": "钓鱼台",
            "end": "海中粟",
            "line": "K14线"
        },

        {
            "start": "钓鱼台",
            "end": "卫宫邸",
            "line": "K14线"
        },
        {
            "start": "卫宫邸",
            "end": "钓鱼台",
            "line": "K14线"
        },
        {
            "start": "稻之乡",
            "end": "稻之港",
            "line": "K14线"
        },
        {
            "start": "稻之港",
            "end": "稻之乡",
            "line": "K14线"
        },
        {
            "start": "稻之港",
            "end": "稻香村",
            "line": "K14线"
        },
        {
            "start": "稻香村",
            "end": "稻之港",
            "line": "K14线"
        },
        {
            "start": "稻香村",
            "end": "圣枭堡",
            "line": "K14线"
        },
        {
            "start": "圣枭堡",
            "end": "稻香村",
            "line": "K14线"
        },
        {
            "start": "圣枭堡",
            "end": "游泳圈的家",
            "line": "K14线"
        },
        {
            "start": "游泳圈的家",
            "end": "圣枭堡",
            "line": "K14线"
        },


        // K15线
        {
            "start": "咸鱼东",
            "end": "提尼岛北",
            "line": "K15线"
        },
        {
            "start": "提尼岛北",
            "end": "咸鱼东",
            "line": "K15线"
        },
        {
            "start": "提尼岛北",
            "end": "提尼岛工业园",
            "line": "K15线"
        },
        {
            "start": "提尼岛工业园",
            "end": "提尼岛北",
            "line": "K15线"
        },
        {
            "start": "提尼岛工业园",
            "end": "XS枢纽",
            "line": "K15线"
        },
        {
            "start": "XS枢纽",
            "end": "提尼岛工业园",
            "line": "K15线"
        },
        {
            "start": "XS枢纽",
            "end": "共产主义大陆",
            "line": "K15线"
        },
        {
            "start": "共产主义大陆",
            "end": "XS枢纽",
            "line": "K15线"
        },
        {
            "start": "共产主义大陆",
            "end": "瑜陵",
            "line": "K15线"
        },
        {
            "start": "瑜陵",
            "end": "共产主义大陆",
            "line": "K15线"
        },
        {
            "start": "瑜陵",
            "end": "糖湖镇",
            "line": "K15线"
        },
        {
            "start": "糖湖镇",
            "end": "瑜陵",
            "line": "K15线"
        },
        {
            "start": "沙漠枢纽",
            "end": "糖湖镇",
            "line": "K15线"
        },
        {
            "start": "糖湖镇",
            "end": "沙漠枢纽",
            "line": "K15线"
        },
        {
            "start": "沙漠枢纽",
            "end": "方林枢纽",
            "line": "K15线"
        },
        {
            "start": "方林枢纽",
            "end": "沙漠枢纽",
            "line": "K15线"
        },
        {
            "start": "tz村庄",
            "end": "方林枢纽",
            "line": "K15线"
        },
        {
            "start": "方林枢纽",
            "end": "tz村庄",
            "line": "K15线"
        },
        {
            "start": "tz村庄",
            "end": "咸鱼东",
            "line": "K15线"
        },
        {
            "start": "咸鱼东",
            "end": "tz村庄",
            "line": "K15线"
        },

        // M1线
        {
            "start": "福原枢纽",
            "end": "赞服苏维埃根据地",
            "line": "M1线"
        },
        {
            "start": "赞服苏维埃根据地",
            "end": "福原枢纽",
            "line": "M1线"
        },
        {
            "start": "赞服苏维埃根据地",
            "end": "flam的家",
            "line": "M1线"
        },
        {
            "start": "flam的家",
            "end": "赞服苏维埃根据地",
            "line": "M1线"
        },
        {
            "start": "flam的家",
            "end": "x_xGe海灯塔",
            "line": "M1线"
        },
        {
            "start": "x_xGe海灯塔",
            "end": "flam的家",
            "line": "M1线"
        },
        {
            "start": "x_xGe海灯塔",
            "end": "末影镇南",
            "line": "M1线"
        },
        {
            "start": "末影镇南",
            "end": "x_xGe海灯塔",
            "line": "M1线"
        },
        {
            "start": "末影镇南",
            "end": "末影镇",
            "line": "M1线"
        },
        {
            "start": "末影镇",
            "end": "末影镇南",
            "line": "M1线"
        },
        {
            "start": "末影镇",
            "end": "ricky的家",
            "line": "M1线"
        },
        {
            "start": "ricky的家",
            "end": "末影镇",
            "line": "M1线"
        },
        {
            "start": "ricky的家",
            "end": "红牛岛",
            "line": "M1线"
        },
        {
            "start": "红牛岛",
            "end": "ricky的家",
            "line": "M1线"
        },
        {
            "start": "红牛岛",
            "end": "SCP驻赞服总办事处",
            "line": "M1线"
        },
        {
            "start": "SCP驻赞服总办事处",
            "end": "红牛岛",
            "line": "M1线"
        },

        // 爱国线
        {
            "start": "夏尔镇",
            "end": "ACE的家",
            "line": "爱国线"
        },
        {
            "start": "ACE的家",
            "end": "夏尔镇",
            "line": "爱国线"
        },
        {
            "start": "ACE的家",
            "end": "夏尔村民农场南",
            "line": "爱国线"
        },
        {
            "start": "夏尔村民农场南",
            "end": "ACE的家",
            "line": "爱国线"
        },
        {
            "start": "夏尔村民农场南",
            "end": "slantyone的家",
            "line": "爱国线"
        },
        {
            "start": "slantyone的家",
            "end": "夏尔村民农场南",
            "line": "爱国线"
        },
        {
            "start": "slantyone的家",
            "end": "上弦半岛",
            "line": "爱国线"
        },
        {
            "start": "上弦半岛",
            "end": "slantyone的家",
            "line": "爱国线"
        },
        {
            "start": "上弦半岛",
            "end": "瑜庭",
            "line": "爱国线"
        },
        {
            "start": "瑜庭",
            "end": "上弦半岛",
            "line": "爱国线"
        },
        {
            "start": "瑜庭",
            "end": "错误岛",
            "line": "爱国线"
        },
        {
            "start": "错误岛",
            "end": "瑜庭",
            "line": "爱国线"
        },
        {
            "start": "错误岛",
            "end": "寒月的家",
            "line": "爱国线"
        },
        {
            "start": "寒月的家",
            "end": "错误岛",
            "line": "爱国线"
        },
        {
            "start": "寒月的家",
            "end": "_qUUp_的家",
            'polyline': [
                [3374, 20, 5600],
                [3374, 40, 6001],
                [2680, 40, 6001],
            ],
            "line": "爱国线"
        },
        {
            "start": "_qUUp_的家",
            "end": "寒月的家",
            'polyline': [
                [2680, 40, 6001],
                [3374, 40, 6001],
                [3374, 20, 5600],
            ],
            "line": "爱国线"
        },

        // 少女前线
        {
            "start": "夏尔村民农场南",
            "end": "格里芬",
            "line": "少女前线"
        },
        {
            "start": "格里芬",
            "end": "夏尔村民农场南",
            "line": "少女前线"
        },

        // 东方线
        {
            "start": "橘子的家",
            "end": "中央枢纽",
            "line": "东方线"
        },
        {
            "start": "中央枢纽",
            "end": "橘子的家",
            "line": "东方线"
        },
        {
            "start": "橘子的家",
            "end": "lost的家",
            "line": "东方线"
        },
        {
            "start": "lost的家",
            "end": "橘子的家",
            "line": "东方线"
        },
        {
            "start": "lost的家",
            "end": "Byepast家旧址",
            "line": "东方线"
        },
        {
            "start": "Byepast家旧址",
            "end": "lost的家",
            "line": "东方线"
        },
        {
            "start": "Byepast家旧址",
            "end": "福原枢纽",
            "line": "东方线"
        },
        {
            "start": "福原枢纽",
            "end": "Byepast家旧址",
            "line": "东方线"
        },
        {
            "start": "福原枢纽",
            "end": "KK的安置房",
            "line": "东方线"
        },
        {
            "start": "KK的安置房",
            "end": "福原枢纽",
            "line": "东方线"
        },
        {
            "start": "KK的安置房",
            "end": "猫音小村",
            "line": "东方线"
        },
        {
            "start": "猫音小村",
            "end": "KK的安置房",
            "line": "东方线"
        },
        {
            "start": "猫音小村",
            "end": "艾德拉斯军事基地",
            "line": "东方线"
        },
        {
            "start": "艾德拉斯军事基地",
            "end": "猫音小村",
            "line": "东方线"
        },
        {
            "start": "艾德拉斯军事基地",
            "end": "风车镇",
            "line": "东方线"
        },
        {
            "start": "风车镇",
            "end": "艾德拉斯军事基地",
            "line": "东方线"
        },

        // 发如雪线
        {
            "start": "风之镇",
            "end": "终南山",
            "line": "发如雪线"
        },
        {
            "start": "终南山",
            "end": "风之镇",
            "line": "发如雪线"
        },
        {
            "start": "终南山",
            "end": "终南山鸟居",
            "line": "发如雪线"
        },
        {
            "start": "终南山鸟居",
            "end": "终南山",
            "line": "发如雪线"
        },
        {
            "start": "终南山",
            "end": "魔瓶的家",
            "line": "发如雪线"
        },
        {
            "start": "魔瓶的家",
            "end": "终南山",
            "line": "发如雪线"
        },
        {
            "start": "赞广遗址",
            "end": "魔瓶的家",
            "line": "发如雪线"
        },
        {
            "start": "魔瓶的家",
            "end": "赞广遗址",
            "line": "发如雪线"
        },
        {
            "start": "赞广遗址",
            "end": "绿宝石公寓",
            "line": "发如雪线"
        },
        {
            "start": "绿宝石公寓",
            "end": "赞广遗址",
            "line": "发如雪线"
        },
        {
            "start": "绿帽村",
            "end": "绿宝石公寓",
            "line": "发如雪线"
        },
        {
            "start": "绿宝石公寓",
            "end": "绿帽村",
            "line": "发如雪线"
        },

        // 雪国线
        {
            "start": "春暖花开",
            "end": "寒意镇",
            "line": "雪国线"
        },
        {
            "start": "寒意镇",
            "end": "春暖花开",
            "line": "雪国线"
        },
        {
            "start": "寒意镇",
            "end": "黄老菊的家",
            "line": "雪国线"
        },
        {
            "start": "黄老菊的家",
            "end": "寒意镇",
            "line": "雪国线"
        },
        {
            "start": "黄老菊的家",
            "end": "七村枢纽",
            "line": "雪国线"
        },
        {
            "start": "七村枢纽",
            "end": "黄老菊的家",
            "line": "雪国线"
        },
        {
            "start": "七村枢纽",
            "end": "新手村",
            'polyline': [
                [-2810, 40, -2841],
                [-3987, 40, -2841],
                [-3987, 40, -4502],
            ],
            "line": "雪国线"
        },
        {
            "start": "新手村",
            "end": "七村枢纽",
            'polyline': [
                [-3987, 40, -4502],
                [-3987, 40, -2841],
                [-2810, 40, -2841],
            ],
            "line": "雪国线"
        },
        {
            "start": "新手村",
            "end": "19年圣诞活动场地",
            "line": "雪国线"
        },
        {
            "start": "19年圣诞活动场地",
            "end": "新手村",
            "line": "雪国线"
        },
        {
            "start": "19年圣诞活动场地",
            "end": "二周年活动场地",
            "line": "雪国线"
        },
        {
            "start": "二周年活动场地",
            "end": "19年圣诞活动场地",
            "line": "雪国线"
        },
        {
            "start": "二周年活动场地",
            "end": "北境平原",
            "stationArray": [0, 0],
            "line": "雪国线"
        },
        {
            "start": "北境平原",
            "end": "二周年活动场地",
            "stationArray": [0, 0],
            "line": "雪国线"
        },
        {
            "start": "北境平原",
            "end": "MoKoHom的家",
            "stationArray": [0, 0],
            "line": "雪国线"
        },
        {
            "start": "MoKoHom的家",
            "end": "北境平原",
            "stationArray": [0, 0],
            "line": "雪国线"
        },

        // 德意志线
         {
            "start": "黄老菊的家",
            "end": "石榴群岛",
            "line": "德意志线"
        },
        {
            "start": "石榴群岛",
            "end": "黄老菊的家",
            "line": "德意志线"
        },
        {
            "start": "石榴群岛",
            "end": "楚格峰",
            "line": "德意志线"
        },
        {
            "start": "楚格峰",
            "end": "石榴群岛",
            "line": "德意志线"
        },
        {
            "start": "楚格峰",
            "end": "柯尼斯堡",
            "line": "德意志线"
        },
        {
            "start": "柯尼斯堡",
            "end": "楚格峰",
            "line": "德意志线"
        },

        // 奥兹线
        {
            "start": "飞猫度假村",
            "end": "卡莫俱乐部",
            "line": "奥兹线"
        },
        {
            "start": "卡莫俱乐部",
            "end": "飞猫度假村",
            "line": "奥兹线"
        },
        {
            "start": "寒意镇",
            "end": "卡莫俱乐部",
            "line": "奥兹线"
        },
        {
            "start": "卡莫俱乐部",
            "end": "寒意镇",
            "line": "奥兹线"
        },
        {
            "start": "雪松镇",
            "end": "寒意镇",
            "line": "奥兹线"
        },
        {
            "start": "寒意镇",
            "end": "雪松镇",
            "line": "奥兹线"
        },

        {
            "start": "雪松镇",
            "end": "Meowth的家",
            "line": "奥兹线"
        },
        {
            "start": "Meowth的家",
            "end": "雪松镇",
            "line": "奥兹线"
        },

        // 伊苏线
        {
            "start": "地下城",
            "end": "提尼岛工业园",
            'polyline': [
                [915, 40, 4738],
                [915, 40, 4499],
                [400, 20, 4499],
            ],
            "line": "伊苏线"
        },
        {
            "start": "提尼岛工业园",
            "end": "地下城",
            'polyline': [
                [400, 20, 4499],
                [915, 40, 4499],
                [915, 40, 4738],
            ],
            "line": "伊苏线"
        },
        {
            "start": "地下城",
            "end": "猫耳的家",
            'polyline': [
                [915, 40, 4738],
                [915, 40, 5301],
                [267, 40, 5301],
            ],
            "line": "伊苏线"
        },
        {
            "start": "猫耳的家",
            "end": "地下城",
            'polyline': [
                [267, 40, 5301],
                [915, 40, 5301],
                [915, 40, 4738],
            ],
            "line": "伊苏线"
        },
        {
            "start": "猫耳的家",
            "end": "猫村枢纽",
            "line": "伊苏线"
        },
        {
            "start": "猫村枢纽",
            "end": "猫耳的家",
            "line": "伊苏线"
        },
        {
            "start": "猫村枢纽",
            "end": "四方枢纽",
            "line": "伊苏线"
        },
        {
            "start": "四方枢纽",
            "end": "猫村枢纽",
            "line": "伊苏线"
        },
        {
            "start": "破碎城堡",
            "end": "四方枢纽",
            "line": "伊苏线"
        },
        {
            "start": "四方枢纽",
            "end": "破碎城堡",
            "line": "伊苏线"
        },
        {
            "start": "破碎城堡",
            "end": "叶观建筑群",
            'polyline': [
                [-1867, 40, 5301],
                [-1976, 40, 5301],
                [-1976, 40, 5399],

            ],
            "line": "伊苏线"
        },
        {
            "start": "叶观建筑群",
            "end": "破碎城堡",
            'polyline': [
                [-1976, 40, 5399],
                [-1976, 40, 5301],
                [-1867, 40, 5301],
            ],
            "line": "伊苏线"
        },

        // K16线
        {
            "start": "共产主义大陆",
            "end": "四方枢纽",
            "line": "K16线"
        },
        {
            "start": "四方枢纽",
            "end": "共产主义大陆",
            "line": "K16线"
        },
        {
            "start": "四方枢纽",
            "end": "影山居",
            "line": "K16线"
        },
        {
            "start": "影山居",
            "end": "四方枢纽",
            "line": "K16线"
        },

        // K17线
        {
            "start": "七村枢纽",
            "end": "格莱斯枢纽",
            "line": "K17线"
        },
        {
            "start": "格莱斯枢纽",
            "end": "七村枢纽",
            "line": "K17线"
        },
        {
            "start": "格莱斯枢纽",
            "end": "作案哥的家",
            "line": "K17线"
        },
        {
            "start": "作案哥的家",
            "end": "格莱斯枢纽",
            "line": "K17线"
        },
        {
            "start": "作案哥的家",
            "end": "搬运镇",
            "line": "K17线"
        },
        {
            "start": "搬运镇",
            "end": "作案哥的家",
            "line": "K17线"
        },
        {
            "start": "兔岛",
            "end": "搬运镇",
            "line": "K17线"
        },
        {
            "start": "搬运镇",
            "end": "兔岛",
            "line": "K17线"
        },
        {
            "start": "兔岛",
            "end": "圣枭堡",
            "line": "K17线"
        },
        {
            "start": "圣枭堡",
            "end": "兔岛",
            "line": "K17线"
        },
        {
            "start": "圣枭堡",
            "end": "运通枢纽",
            "line": "K17线"
        },
        {
            "start": "运通枢纽",
            "end": "圣枭堡",
            "line": "K17线"
        },
        {
            "start": "运通枢纽",
            "end": "村下屋根",
            "line": "K17线"
        },
        {
            "start": "村下屋根",
            "end": "运通枢纽",
            "line": "K17线"
        },
        {
            "start": "风之新镇",
            "end": "村下屋根",
            "line": "K17线"
        },
        {
            "start": "村下屋根",
            "end": "风之新镇",
            "line": "K17线"
        },
        {
            "start": "风之新镇",
            "end": "沙漠枢纽",
            "line": "K17线"
        },
        {
            "start": "沙漠枢纽",
            "end": "风之新镇",
            "line": "K17线"
        },

        //星海线
        {
            "start": "星海山顶洞",
            "end": "星海湾",
            "line": "星海线"
        },
        {
            "start": "星海湾",
            "end": "星海山顶洞",
            "line": "星海线"
        },
        {
            "start": "星海湾",
            "end": "星海大火锅",
            "line": "星海线"
        },
        {
            "start": "星海大火锅",
            "end": "星海湾",
            "line": "星海线"
        },

        //平妖线
        {
            "start": "明镜湖",
            "end": "tz村庄",
            "line": "平妖线"
        },
        {
            "start": "tz村庄",
            "end": "明镜湖",
            "line": "平妖线"
        },
        {
            "start": "明镜湖",
            "end": "南山小院",
            "line": "平妖线"
        },
        {
            "start": "南山小院",
            "end": "明镜湖",
            "line": "平妖线"
        },
        {
            "start": "终南山鸟居",
            "end": "南山小院",
            "line": "平妖线"
        },
        {
            "start": "南山小院",
            "end": "终南山鸟居",
            "line": "平妖线"
        },
        {
            "start": "终南山鸟居",
            "end": "Yusir的家",
            "line": "平妖线"
        },
        {
            "start": "Yusir的家",
            "end": "终南山鸟居",
            "line": "平妖线"
        },
        {
            "start": "Yusir的家",
            "end": "COOREA的家",
            "line": "平妖线"
        },
        {
            "start": "COOREA的家",
            "end": "Yusir的家",
            "line": "平妖线"
        },
        {
            "start": "COOREA的家",
            "end": "小冷的家",
            "line": "平妖线"
        },
        {
            "start": "小冷的家",
            "end": "COOREA的家",
            "line": "平妖线"
        },
        {
            "start": "九里",
            "end": "小冷的家",
            "line": "平妖线"
        },
        {
            "start": "小冷的家",
            "end": "九里",
            "line": "平妖线"
        },

        // K18线
        {
            "start": "雨的故事的家",
            "end": "永远亭",
            'polyline': [
                [681, 40, -1300],
                [681, 40, -1349],
                [1112, 40, -1349]
            ],
            "line": "K18线"
        }, 
        {
            "start": "永远亭",
            "end": "雨的故事的家",
             'polyline': [
                [1112, 40, -1349],
                [681, 40, -1349],
                [681, 40, -1300]
            ],
            "line": "K18线"
        },
        {
            "start": "永远亭",
            "end": "末影镇南",
            "line": "K18线"
        },
        {
            "start": "末影镇南",
            "end": "永远亭",
            "line": "K18线"
        },
        {
            "start": "末影镇南",
            "end": "风车镇西",
            "line": "K18线"
        },
        {
            "start": "风车镇西",
            "end": "末影镇南",
            "line": "K18线"
        },
        {
            "start": "风车镇西",
            "end": "风车镇",
            "line": "K18线"
        },
        {
            "start": "风车镇",
            "end": "风车镇西",
            "line": "K18线"
        },

        // 方舟线
        {
            "start": "绿宝石",
            "end": "绿宝石公寓",
            'polyline': [
                [2245, 40, 1347],
                [2281, 40, 1347],
                [2281, 40, 1553]
            ],
            "line": "方舟线"
        },
        {
            "start": "绿宝石公寓",
            "end": "绿宝石",
            'polyline': [
                [2281, 40, 1553],
                [2281, 40, 1347],
                [2245, 40, 1347]
            ],
            "line": "方舟线"
        },
        {
            "start": "绿宝石公寓",
            "end": "夏尔镇",
            "line": "方舟线"
        },
        {
            "start": "夏尔镇",
            "end": "绿宝石公寓",
            "line": "方舟线"
        },

        // 二狗线
        {
            "start": "橘子的家",
            "end": "狗哥村庄",
            "line": "二狗线"
        },
        {
            "start": "狗哥村庄",
            "end": "橘子的家",
            "line": "二狗线"
        },
        {
            "start": "苍樱寮",
            "end": "狗哥村庄",
            "line": "二狗线"
        },
        {
            "start": "狗哥村庄",
            "end": "苍樱寮",
            "line": "二狗线"
        },
        {
            "start": "Xalloy的家",
            "end": "苍樱寮",
            "line": "二狗线"
        },
        {
            "start": "苍樱寮",
            "end": "Xalloy的家",
            "line": "二狗线"
        },

        // 波止线
        {
            "start": "瑜庭",
            "end": "神肥国度",
            "line": "波止线"
        },
        {
            "start": "神肥国度",
            "end": "瑜庭",
            "line": "波止线"
        },

        // K11线
        {
            "start": "格莱斯枢纽",
            "end": "新岩石之令",
            "line": "K11线"
        },
        {
            "start": "新岩石之令",
            "end": "格莱斯枢纽",
            "line": "K11线"
        },

        // 血汗线
        {
            "start": "新手村",
            "end": "楚格峰",
            "line": "血汗线"
        },
        {
            "start": "楚格峰",
            "end": "新手村",
            "line": "血汗线"
        }
    ]
}
