var subData = {
    'stations': {
        '彩虹半岛' : { 'location' : [-410, 40, -889]},
        '彩虹镇' : { 'location' : [-650, 40, -1177]}       
    },
    'lines': {
        '赞一线': ['城北枢纽', '赞服国际机场', '出生点', '漆黑之翼'],
        '赞二线': ['未名阁', '出生点', '中央枢纽'],
        'K1线': ['中央枢纽', 'LSF的家', '无人沙村', '魔瓶的家', '森林枢纽', '夏尔镇'],
        'K2线': ['flam的家', 'xiximi的家', 'KK的沙漠别墅', '城北枢纽', '彩虹半岛', '彩虹镇洲际酒店', '彩虹镇', '三界枢纽', '妹控镇', 'xiqiao的家', '寒月家旧址', 'ricky的家'],
        'K3线': ['zcw农庄', 'LSF的家', '土豆镇北', 'Wintering_的家', 'FishWit的家', '尸冢', '白虎岭', '樱花乡', 'fade的家'],
        'K4线北段': ['未名阁','高地枢纽','艾拉的家','kuend的家'],
        'K4线南段': ['漆黑之翼', 'FishWit的家', 'Xiao_Yun的家', '终南山', 'KINDEL的家', '雪亭', 'ij枢纽', 'XS枢纽', '猫耳的家'],
        'K5线': ['未名阁', '七魂家旧址', '盘丝洞', '樱花乡', '风之镇', '沙漠枢纽', 'tz的家', '咸鱼', '双子阁'],
        'K6线': ['fade的家', 'ranfei的家', '高地枢纽', '老郭故居', '大裤衩', '肥宅乐园', 'ZERO的家', 'Meowth的家', '三界枢纽', '妹控镇南', '妹控镇', '螃蟹岛灯塔', '春暖花开', '卫岛'],
        'K7线': ['漆黑之翼', '天守阁', '七魂家旧址', 'fade的家'],
        'K8线': ['ZERO的家', '彩虹镇','_qUUp_的家', 'Noawas的家', '方台', 'x_xGe海灯塔'],
        'K9线': ['森林枢纽', '富饶港', '沙河枢纽', '咸鱼东', '双子阁'],
        'K10线': ['老郭故居', '秋山的家', '光明镇', '稻之乡', 'kuend的家', '浮离'],
        'K11线': ['七魂的家', '作案哥的家'],
        'K12线': ['作案哥的家', 'Meowth的家'],
        'K13线': ['Xiao_Yun的家', '荔宫', '土豆镇西', '无人沙村'],
        'K14线': ['艾拉的家', 'gaffey的家'],
        'K15线': ['咸鱼东', '96Ko的家', '提尼岛北', '提尼岛工业园', 'XS枢纽', '共产主义大陆'],
        'M1线': ['福原枢纽', '赞服苏维埃根据地', 'flam的家', 'x_xGe海灯塔', '末影镇', 'ricky的家', '红牛岛', 'SCP驻赞服办事处'],
        '爱国线': ['夏尔镇', 'ACE的家', '夏尔村民农场南', 'slantyone的家', '晓枫故居', '苏瑕瑜的家', '错误岛', '寒月的家'],    
        '少女前线': ['夏尔村民农场南','格里芬'],
        '东方线': ['中央枢纽', '河神枢纽', 'miaomiao故居', 'lost的家', 'Byepast家旧址', '福原枢纽', 'KK的安置房', '猫音小村', '艾德拉斯军事基地', '风车镇'],
        '二狗线': ['miaomiao故居', '狗哥的家'],
        '发如雪线': ['风之镇', '终南山', '魔瓶的家'],
        '参宿线': ['KINDEL的家', 'tz的家', '雪亭', '双子阁', 'ij枢纽'],
        '雪国线': ['春暖花开', '皇心的家', '黄老菊的家', '七魂的家'],
        '德意志线': ['黄老菊的家', '柯尼斯堡'],
        '奥兹线': ['皇心的家', 'Meowth的家'],
        '新风线': ['沙漠枢纽', '糖湖镇'],
        '鱼塔线': ['河神枢纽', '多拉鱼塔'],
        '伊苏线': ['沙河枢纽', '泽民', '骨乐园', '寺院化石博物馆', '上海老江'],



    },
    'paths': [
        // 赞一线
        ['城北枢纽', '赞服国际机场', 466],
        ['赞服国际机场', '城北枢纽', 466],

        ['赞服国际机场', '出生点', 204],
        ['出生点', '赞服国际机场', 204],

        ['出生点', '漆黑之翼', 700],
        ['漆黑之翼', '出生点', 700],

        // 赞二线
        ['未名阁', '出生点', 810],
        ['出生点', '未名阁', 810],

        ['出生点', '中央枢纽', 1277],
        ['中央枢纽', '出生点', 1277],

        // K1线
        ['中央枢纽', 'LSF的家', 601],
        ['LSF的家', '中央枢纽', 601],

        ['LSF的家', '无人沙村', 313],
        ['无人沙村', 'LSF的家', 313],

        ['无人沙村', '魔瓶的家', 388],
        ['魔瓶的家', '无人沙村', 388],

        ['魔瓶的家', '森林枢纽', 481],
        ['森林枢纽', '魔瓶的家', 481],

        ['森林枢纽', '夏尔镇', 1203],
        ['夏尔镇', '森林枢纽', 1203],

        // K2线
        ['flam的家', 'xiximi的家', 868],
        ['xiximi的家', 'flam的家', 868],

        ['xiximi的家', 'KK的沙漠别墅', 624],
        ['KK的沙漠别墅', 'xiximi的家', 624],

        ['KK的沙漠别墅', '城北枢纽', 519],
        ['城北枢纽', 'KK的沙漠别墅', 519],

        ['城北枢纽', '彩虹半岛', 235],
        ['彩虹半岛', '城北枢纽', 235],

        ['彩虹半岛', '彩虹镇', 528],
        ['彩虹镇', '彩虹半岛', 528],

        // ---- 彩虹镇洲际酒店支线
        ['彩虹镇', '彩虹镇洲际酒店', 160],
        ['彩虹镇洲际酒店', '彩虹镇', 160],
        ['彩虹镇洲际酒店', '彩虹半岛', 370],
        // ---- 彩虹镇洲际酒店支线

        ['彩虹镇', '三界枢纽', 808],
        ['三界枢纽', '彩虹镇', 808],

        ['三界枢纽', '妹控镇', 508],
        ['妹控镇', '三界枢纽', 508],

        ['妹控镇', 'xiqiao的家', 346],
        ['xiqiao的家', '妹控镇', 346],

        ['xiqiao的家', '寒月家旧址', 740],
        ['寒月家旧址', 'xiqiao的家', 740],

        ['寒月家旧址', 'ricky的家', 851],
        ['ricky的家', '寒月家旧址', 851],

        // K3线
        ['zcw农庄', 'LSF的家', 256],
        ['LSF的家', 'zcw农庄', 256],

        ['LSF的家', '土豆镇北', 504],
        ['土豆镇北', 'LSF的家', 504],

        ['土豆镇北', 'Wintering_的家', 373],
        ['Wintering_的家', '土豆镇北', 373],

        ['Wintering_的家', 'FishWit的家', 241],
        ['FishWit的家', 'Wintering_的家', 241],

        ['FishWit的家', '尸冢', 396],
        ['尸冢', 'FishWit的家', 396],

        ['尸冢', '樱花乡', 273],
        ['樱花乡', '尸冢', 273],

        // ---- 白虎岭支线
        ['白虎岭', '尸冢', 159],
        ['白虎岭', '樱花乡', 117],
        ['樱花乡', '白虎岭', 117],
        // ---- 白虎岭支线
        
        ['樱花乡', 'fade的家', 387],
        ['fade的家', '樱花乡', 387],

        // K4线北段
        ['未名阁', '高地枢纽', 342],
        ['高地枢纽', '未名阁', 342],

        ['高地枢纽', '艾拉的家', 220],
        ['艾拉的家', '高地枢纽', 220],

        ['艾拉的家', 'kuend的家', 958],
        ['kuend的家', '艾拉的家', 958],

        // K4线南段
        ['漆黑之翼', 'FishWit的家', 338],
        ['FishWit的家', '漆黑之翼', 338],

        ['FishWit的家', 'Xiao_Yun的家', 295],
        ['Xiao_Yun的家', 'FishWit的家', 295],

        ['Xiao_Yun的家', '终南山', 389],
        ['终南山', 'Xiao_Yun的家', 389],

        ['终南山', 'KINDEL的家', 925],
        ['KINDEL的家', '终南山', 925],

        ['KINDEL的家', '雪亭', 450],
        ['雪亭', 'KINDEL的家', 450],

        ['雪亭', 'ij枢纽', 939],
        ['ij枢纽', '雪亭', 939],

        ['ij枢纽', 'XS枢纽', 623],
        ['XS枢纽', 'ij枢纽', 623],

        ['XS枢纽', '猫耳的家', 1078],
        ['猫耳的家', 'XS枢纽', 1078],

        // K5线
        ['未名阁', '七魂家旧址', 478],
        ['七魂家旧址', '未名阁', 478],

        ['七魂家旧址', '樱花乡', 285],
        ['樱花乡', '七魂家旧址', 285],

        // ---- 盘丝洞支线
        ['盘丝洞', '樱花乡', 89],
        ['樱花乡', '盘丝洞', 89],
        ['盘丝洞', '七魂家旧址', 202],
        // ---- 盘丝洞支线
        
        ['樱花乡', '风之镇', 562],
        ['风之镇', '樱花乡', 562],

        ['风之镇', '沙漠枢纽', 1512],
        ['沙漠枢纽', '风之镇', 1512],

        ['沙漠枢纽', 'tz的家', 1010],
        ['tz的家', '沙漠枢纽', 1010],

        ['tz的家', '咸鱼', 293],
        ['咸鱼', 'tz的家', 293],

        ['双子阁', '咸鱼', 461],
        ['咸鱼', '双子阁', 461],

        // K6线
        ['fade的家', 'ranfei的家', 544],
        ['ranfei的家', 'fade的家', 544],

        ['ranfei的家', '高地枢纽', 174],
        ['高地枢纽', 'ranfei的家', 174],

        ['高地枢纽', '老郭故居', 632],
        ['老郭故居', '高地枢纽', 632],

        ['老郭故居', '大裤衩', 180],
        ['大裤衩', '老郭故居', 180],

        ['大裤衩', '肥宅乐园', 418],
        ['肥宅乐园', '大裤衩', 418],

        ['肥宅乐园', 'ZERO的家', 443],
        ['ZERO的家', '肥宅乐园', 443],

        ['ZERO的家', 'Meowth的家', 809],
        ['Meowth的家', 'ZERO的家', 809],

        ['Meowth的家', '三界枢纽', 395],
        ['三界枢纽', 'Meowth的家', 395],

        ['三界枢纽', '妹控镇南', 266],
        ['妹控镇南', '三界枢纽', 266],

        ['妹控镇南', '妹控镇', 244],
        ['妹控镇', '妹控镇南', 244],

        // ---- 螃蟹岛灯塔支线
        ['妹控镇', '螃蟹岛灯塔', 634],
        ['螃蟹岛灯塔', '妹控镇', 634],
        ['螃蟹岛灯塔', '春暖花开', 243],
        ['春暖花开', '螃蟹岛灯塔', 243],
        
        // ---- 螃蟹岛灯塔支线

        ['妹控镇', '春暖花开', 613],
        ['春暖花开', '妹控镇', 613],

        ['春暖花开', '卫岛', 273],
        ['卫岛', '春暖花开', 273],

        // K7线
        ['漆黑之翼', '天守阁', 493],
        ['天守阁', '漆黑之翼', 493],

        ['天守阁', '七魂家旧址', 228],
        ['七魂家旧址', '天守阁', 228],

        ['七魂家旧址', 'fade的家', 382],
        ['fade的家', '七魂家旧址', 382],

        // K8线
        ['ZERO的家', '彩虹镇', 396],
        ['彩虹镇', 'ZERO的家', 396],

        ['彩虹镇', '_qUUp_的家', 616],
        ['_qUUp_的家', '彩虹镇', 616],

        ['_qUUp_的家', 'Noawas的家', 365],
        ['Noawas的家', '_qUUp_的家', 365],

        ['Noawas的家', '方台', 568],
        ['方台', 'Noawas的家', 568],

        ['方台', 'x_xGe海灯塔', 739],
        ['x_xGe海灯塔', '方台', 739],

        // K9线
        ['森林枢纽', '富饶港', 709],
        ['富饶港',  '森林枢纽', 709],

        ['富饶港', '沙河枢纽', 508],
        ['沙河枢纽', '富饶港', 508],

        ['沙河枢纽', '咸鱼东', 680],
        ['咸鱼东', '沙河枢纽', 680],

        ['咸鱼东', '双子阁', 295],
        ['双子阁', '咸鱼东', 295],

        // K10线
        ['老郭故居', '秋山的家', 821],
        ['秋山的家', '老郭故居', 821],

        ['秋山的家', '光明镇', 291],
        ['光明镇', '秋山的家', 291],

        ['光明镇', '稻之乡', 439],
        ['稻之乡', '光明镇', 439],

        ['稻之乡', 'kuend的家', 245],
        ['kuend的家', '稻之乡', 245],

        ['kuend的家', '浮离', 893],
        ['浮离', 'kuend的家', 893],

        // K11线
        ['七魂的家', '作案哥的家', 855],
        ['作案哥的家', '七魂的家', 855],

        // K12线
        ['作案哥的家', 'Meowth的家', 1764],
        ['Meowth的家', '作案哥的家', 1764],

        // K13线
        ['Xiao_Yun的家', '荔宫', 160],
        ['荔宫', 'Xiao_Yun的家', 160],

        ['荔宫', '土豆镇西', 312],
        ['土豆镇西', '荔宫', 312],

        ['土豆镇西', '无人沙村', 390],
        ['无人沙村', '土豆镇西', 390],

        // K14线
        ['艾拉的家', 'gaffey的家', 293],
        ['gaffey的家', '艾拉的家', 293],

        // K15线
        ['咸鱼东', '96Ko的家', 138],
        ['96Ko的家', '咸鱼东', 138],

        ['96Ko的家', '提尼岛北', 662],
        ['提尼岛北', '96Ko的家', 662],

        ['提尼岛北', '提尼岛工业园', 500],
        ['提尼岛工业园', '提尼岛北', 500],

        ['提尼岛工业园', 'XS枢纽', 411],
        ['XS枢纽', '提尼岛工业园', 411],
        
        ['XS枢纽', '共产主义大陆', 1105],
        ['共产主义大陆', 'XS枢纽', 1105],

        // M1线
        ['福原枢纽', '赞服苏维埃根据地', 749],
        ['赞服苏维埃根据地', '福原枢纽', 749],

        ['赞服苏维埃根据地', 'flam的家', 600],
        ['flam的家', '赞服苏维埃根据地', 600],

        ['flam的家', 'x_xGe海灯塔', 190],
        ['x_xGe海灯塔', 'flam的家', 190],

        ['x_xGe海灯塔', '末影镇', 520],
        ['末影镇', 'x_xGe海灯塔', 520],

        ['末影镇', 'ricky的家', 621],
        ['ricky的家', '末影镇', 621],

        ['ricky的家', '红牛岛', 1291],
        ['红牛岛', 'ricky的家', 1291],

        ['红牛岛', 'SCP驻赞服办事处', 2203],
        ['SCP驻赞服办事处', '红牛岛', 2203],

        // 爱国线
        ['夏尔镇', 'ACE的家', 822],
        ['ACE的家', '夏尔镇', 822],

        ['ACE的家', '夏尔村民农场南', 600],
        ['夏尔村民农场南', 'ACE的家', 600],

        ['夏尔村民农场南', 'slantyone的家', 496],
        ['slantyone的家', '夏尔村民农场南', 496],

        ['slantyone的家', '晓枫故居', 1146],
        ['晓枫故居', 'slantyone的家', 1146],

        ['晓枫故居', '苏瑕瑜的家', 219],
        ['苏瑕瑜的家', '晓枫故居', 219],

        ['苏瑕瑜的家', '错误岛', 421],
        ['错误岛', '苏瑕瑜的家', 421],

        ['错误岛', '寒月的家', 1000],
        ['寒月的家', '错误岛', 1000],

        // 少女前线
        ['夏尔村民农场南', '格里芬', 430],
        ['格里芬', '夏尔村民农场南', 430],

        // 东方线
        ['中央枢纽', '河神枢纽', 447],
        ['河神枢纽', '中央枢纽', 447],

        ['河神枢纽', 'miaomiao故居', 890],
        ['miaomiao故居', '河神枢纽', 890],

        ['miaomiao故居', 'lost的家', 401],
        ['lost的家', 'miaomiao故居', 401],

        ['lost的家', 'Byepast家旧址', 137],
        ['Byepast家旧址', 'lost的家', 137],

        ['Byepast家旧址', '福原枢纽', 305],
        ['福原枢纽', 'Byepast家旧址', 305],

        ['福原枢纽', 'KK的安置房', 133],
        ['KK的安置房', '福原枢纽', 133],

        ['KK的安置房', '猫音小村', 300],
        ['猫音小村', 'KK的安置房', 300],

        ['猫音小村', '艾德拉斯军事基地', 522],
        ['艾德拉斯军事基地', '猫音小村', 522],

        ['艾德拉斯军事基地', '风车镇', 164],
        ['风车镇', '艾德拉斯军事基地', 164],

        // 二狗线
        ['miaomiao故居', '狗哥的家', 416],
        ['狗哥的家', 'miaomiao故居', 416],

        // 发如雪线
        ['风之镇', '终南山', 788],
        ['终南山', '风之镇', 788],

        ['终南山', '魔瓶的家', 859],
        ['魔瓶的家', '终南山', 859],

        // 参宿线
        ['KINDEL的家', 'tz的家', 365],
        ['tz的家', 'KINDEL的家', 365],

        ['tz的家', '雪亭', 373],
        ['雪亭', 'tz的家', 373],

        ['雪亭', '双子阁', 381],
        ['双子阁', '雪亭', 381],

        ['双子阁', 'ij枢纽', 792],
        ['ij枢纽', '双子阁', 792],

        // 雪国线
        ['春暖花开', '皇心的家', 661],
        ['皇心的家', '春暖花开', 661],

        ['皇心的家', '黄老菊的家', 795],
        ['黄老菊的家', '皇心的家', 795],

        ['黄老菊的家', '七魂的家', 971],
        ['七魂的家', '黄老菊的家', 971],

        // 德意志线
        ['黄老菊的家', '柯尼斯堡', 1988],
        ['柯尼斯堡', '黄老菊的家', 1988],

        // 奥兹线
        ['皇心的家', 'Meowth的家', 855],
        ['Meowth的家', '皇心的家', 855],

        // 新风线
        ['沙漠枢纽', '糖湖镇', 575],
        ['糖湖镇', '沙漠枢纽', 575],

        // 鱼塔线
        ['河神枢纽', '多拉鱼塔', 123],
        ['多拉鱼塔', '河神枢纽', 123],

        // 伊苏线
        ['沙河枢纽', '泽民', 333],
        ['泽民', '沙河枢纽', 333],

        ['泽民', '骨乐园', 280],
        ['骨乐园', '泽民', 280],

        ['骨乐园', '寺院化石博物馆', 501],
        ['寺院化石博物馆', '骨乐园', 501],

        ['寺院化石博物馆', '上海老江', 300],
        ['上海老江', '寺院化石博物馆', 300]
    ]
}
